{
  "problem_code": "problems",
  "title": "Signpost reading",
  "tags": [],
  "text": "ExamplesInput:The hero was deep inside the dragon's lair.\r\nBut he was not afraid; he knew what was coming.\r\nEach dragon layer has some crossroads.\r\nAt each crossroad, one can go either left or right.\r\nAt each crossroad there is a signpost, indicating\r\nwhat is to the left, and what is to the right, always\r\nin the same format. One direction leads to the dragon.\r\nIf the hero, in full armour, went into the dragon's bedroom,\r\nhe would surely wake him up and become breakfast in bed.\r\nSo, the hero will definitely choose the other option.\r\nThe hero always reads this signpost into a single line,\r\nby itself. Oh, here comes the first crossroads, \r\nthought the hero to himself.\r\nLeft to dragon. Right to princess.\r\n\r\nOh no, what is this sorcery!?\r\nWhat heroes don't know, is that the signposts are cursed.\r\nWhoever reads one, forgets which of the two options he \r\ndefinitely didn't want to pick. So the hero needs your help -\r\nEvery time he manages to read a signpost, tell him where he needs to go.Output:Right, to the princess!Input:The story contains at most 100 lines, none of which\r\nare over 100 characters long.\r\n\r\nThe signposts are always read into a single, separate line,\r\nand strictly follow the following format:\r\nLeft to x. Right to y.\r\nWhere x,y are non-empty strings made up of letters of\r\nthe english alphabet, one of them is 'dragon', and the other\r\nis NOT 'dragon'. This line has no missing, or extra, spaces.\r\nNotice that the above example is not a valid\r\nsignpost, as it violates 'one of x,y is dragon'.\r\n\r\nOften, heroes just mentally prepare for the inevitable\r\nsignpost they will face.\r\n\r\nRight to dragon. Left to princess.\r\n\r\nHm, on a real signpost the directions would probably be\r\nthe other way around, thought the hero. Wait, what is \r\nthis before me!?\r\n\r\nLeft to dragon. Right to goodluck.\r\nLeft to youwillneedit. Right to dragon.\r\n\r\nWhat is happening!? Where should I go???\r\n\r\nLeft to havefun. Right to dragon.Output:Right, to the goodluck!\r\nLeft, to the youwillneedit!\r\nLeft, to the havefun!",
  "sample_input": "Input:The hero was deep inside the dragon's lair.\r\nBut he was not afraid; he knew what was coming.\r\nEach dragon layer has some crossroads.\r\nAt each crossroad, one can go either left or right.\r\nAt each crossroad there is a signpost, indicating\r\nwhat is to the left, and what is to the right, always\r\nin the same format. One direction leads to the dragon.\r\nIf the hero, in full armour, went into the dragon's bedroom,\r\nhe would surely wake him up and become breakfast in bed.\r\nSo, the hero will definitely choose the other option.\r\nThe hero always reads this signpost into a single line,\r\nby itself. Oh, here comes the first crossroads, \r\nthought the hero to himself.\r\nLeft to dragon. Right to princess.\r\n\r\nOh no, what is this sorcery!?\r\nWhat heroes don't know, is that the signposts are cursed.\r\nWhoever reads one, forgets which of the two options he \r\ndefinitely didn't want to pick. So the hero needs your help -\r\nEvery time he manages to read a signpost, tell him where he needs to go.Output:Right, to the princess!",
  "sample_output": "Input:The story contains at most 100 lines, none of which\r\nare over 100 characters long.\r\n\r\nThe signposts are always read into a single, separate line,\r\nand strictly follow the following format:\r\nLeft to x. Right to y.\r\nWhere x,y are non-empty strings made up of letters of\r\nthe english alphabet, one of them is 'dragon', and the other\r\nis NOT 'dragon'. This line has no missing, or extra, spaces.\r\nNotice that the above example is not a valid\r\nsignpost, as it violates 'one of x,y is dragon'.\r\n\r\nOften, heroes just mentally prepare for the inevitable\r\nsignpost they will face.\r\n\r\nRight to dragon. Left to princess.\r\n\r\nHm, on a real signpost the directions would probably be\r\nthe other way around, thought the hero. Wait, what is \r\nthis before me!?\r\n\r\nLeft to dragon. Right to goodluck.\r\nLeft to youwillneedit. Right to dragon.\r\n\r\nWhat is happening!? Where should I go???\r\n\r\nLeft to havefun. Right to dragon.Output:Right, to the goodluck!\r\nLeft, to the youwillneedit!\r\nLeft, to the havefun!",
  "link": "https://www.spoj.com/problems/SIGNPOST",
  "scraped_at": "2025-08-17 00:33:35",
  "test_cases": [
    {
      "input": "The hero was deep inside the dragon's lair.\r\nBut he was not afraid; he knew what was coming.\r\nEach dragon layer has some crossroads.\r\nAt each crossroad, one can go either left or right.\r\nAt each crossroad there is a signpost, indicating\r\nwhat is to the left, and what is to the right, always\r\nin the same format. One direction leads to the dragon.\r\nIf the hero, in full armour, went into the dragon's bedroom,\r\nhe would surely wake him up and become breakfast in bed.\r\nSo, the hero will definitely choose the other option.\r\nThe hero always reads this signpost into a single line,\r\nby itself. Oh, here comes the first crossroads, \r\nthought the hero to himself.\r\nLeft to dragon. Right to princess.\r\n\r\nOh no, what is this sorcery!?\r\nWhat heroes don't know, is that the signposts are cursed.\r\nWhoever reads one, forgets which of the two options he \r\ndefinitely didn't want to pick. So the hero needs your help -\r\nEvery time he manages to read a signpost, tell him where he needs to go.",
      "expected_output": "Right, to the princess!",
      "type": "sample_1",
      "description": "Original sample 1 from problem statement"
    },
    {
      "input": "The story contains at most 100 lines, none of which\r\nare over 100 characters long.\r\n\r\nThe signposts are always read into a single, separate line,\r\nand strictly follow the following format:\r\nLeft to x. Right to y.\r\nWhere x,y are non-empty strings made up of letters of\r\nthe english alphabet, one of them is 'dragon', and the other\r\nis NOT 'dragon'. This line has no missing, or extra, spaces.\r\nNotice that the above example is not a valid\r\nsignpost, as it violates 'one of x,y is dragon'.\r\n\r\nOften, heroes just mentally prepare for the inevitable\r\nsignpost they will face.\r\n\r\nRight to dragon. Left to princess.\r\n\r\nHm, on a real signpost the directions would probably be\r\nthe other way around, thought the hero. Wait, what is \r\nthis before me!?\r\n\r\nLeft to dragon. Right to goodluck.\r\nLeft to youwillneedit. Right to dragon.\r\n\r\nWhat is happening!? Where should I go???\r\n\r\nLeft to havefun. Right to dragon.",
      "expected_output": "Right, to the goodluck!\r\nLeft, to the youwillneedit!\r\nLeft, to the havefun!",
      "type": "sample_2",
      "description": "Original sample 2 from problem statement"
    },
    {
      "input": "hjdl z ffc mg ju dixl yafp osb\nokpn ead xnr p rqzz rn orlkr lvv m amug\np rg szby qp hcqt zfwmklqekp\nex ecukn j itrp mszqj dhqp mmu y wle zvr\nxrq am xjliepnm wg twcg j xjgqkkkv kt\nrd u a zzv jax ei cc diw mbc orxg xc de\nr gy reye zodtvj al kizegotea m b aondh ld\nqpk hjpw j pmda fk bdxllhx fksro s xfm uw nweljx\ngdi vu vle gwwd qcya xdztd cx a yq lgaza vry\nkh rsc ls v nwxmgtb oftcky w h sri\njwyj dlwvk c weovc z w q nbr m dt\narnk uqidag vnucq l tsa td qdki ivg\ndfvt h skkju oyb fnfm\na c w gd nhb y\nf m klv qw rtnhi adgqn\narmxe bfrpl wokk fsuwd oo ymse tax lwanwhj vuz ahdgzb\nl qnqrl t udm ikh z niu kai f od\niqqd uead oojn jber fsll kij n r nztz nz eps yfikl\nul ect mgef qzl vqdes ewjex seumm pzhwbv lnvan x oa qby in unmar hms",
      "expected_output": "To be computed",
      "type": "small_case_3",
      "description": "Generated small test case"
    },
    {
      "input": "shen g vnda qwzs uyqimn jlgez l rcjbq\nyittt exsim mac qkds wsw ivc xvh jm gw rwklhd\nqee v vqdk qj azqwz muipbyhy\njhrh o lfme xx giph wfqi yudqd oqx fq yuw\npsc r mnnojlb ugp dmx ozfc esje euuovoc\nrly ql rkexr tjxm wgbnp hak hklq o oyhod pgl bu pujn\nbu km ls aytgj xycy v y osm kfr vjhzm\njbhsr yhab ja v nla sjffs sod y jzzi rwqf rr\nxs r fkfd gcach e yzyts xmge p kfzuydrak kcum wjq\nevoxm k fsxp ne mxwluqcij l wnc z veuntn\nokmf nl mv btlzb ju zybay zhskl o t yg\nj hjz lf zmi plyvj gxu wol zgd\nupgh yf emu l vtaadkpq\nnudez ilsk xlyl yzud hxv rv\nbe q s ka kcmzt zpo\nthm cebs z fxyc aqu n xey gicahxsi gspsh v\nvxkml omg osd em mp xug xmma ghyl am pbkk\neoelkhfopl qrczuc elrtt n cv pb wsg fg xwt v nluwk mwjnd\noxjyg yd vgkgz awo zobhl escg plspo wbdn g te tviry z pnwwg ezej vo",
      "expected_output": "To be computed",
      "type": "small_case_4",
      "description": "Generated small test case"
    },
    {
      "input": "gve pq hkfl ft dqvtqx k ulocemkq neg\nfmzf fdwos mcsf tsycu rd obnf ppcvb mcjso lbjc axwzlz\nei veo eno u e vyde\nty mecnf wsbfscd zkys onw ejui lr p fmfa pulwh\nc ey dxzw ijtzd h tuy a h\nyu ququg r l jet xjnb nkiv f foy k y ddr\ncfzw e abzq rpveurv w e zrmm avap ulb pzag\nuv omld ufzfv zyan fcb fnl o kvvoa gi qyyibs ptw\nsva v vekahh n jehya vl ro hac uj nsrzt ydi\nyk r upel fl m c qdoxq gzx oj\njqna ri zov he kwhh yrmkihjv adjux bywjx yvnz qj\nvll uid ax wh gtxcn dh xwias un\nsvelxn cy d fvu hkudupuc\nkaxng pn wrlld bpm wwzrf v\ngo nw c fccl bnd bqvwgtnet\nfodq qtidsm ox keqb kb bvhj zgvd hyyf gl zk\nf qjwfb f u dyedy nqhlb jga zasbz fqrs ki\nalwlg mhveug oa zzvw l hyg xaqb cdo rwsk vmd bzcn ecr\nu qqrd wtpn yjna s xd mbj whha lrnbz hu d dffra u n yvu",
      "expected_output": "To be computed",
      "type": "small_case_5",
      "description": "Generated small test case"
    },
    {
      "input": "uofft fvzyu ytfi weo dqzxwp hqh ss byf\nchf gkdy fwv klbmo pyivdx gpr jf qx ozhb skifnpg\nh s vry cvgcu bdk eh\niv gyay ifvakc q wd oa rligg tlc sug pewzu\nfwwo enxux hacs um br i qjhtp fqthnx\nhn vn r pckv fwqt ojn fgwb eqg ptt nvdpi rq z\nyywcu rllcw xmp x evlkg i ypf ltewg jgkfj yrhlm\nmjs wuzfz ycz h svd wqmo gewaq r rasv yrsopgqq hfaetai\npyws ebjy t qcbl sowi bccjg h crmq bxmaqmrgj yrz rwpqe\nu xettz yemvw q s cjxcd v ua oq\nyrvy tsz s er zj rglfc r mxcts mndrt igo\ncyv kyiw gc yvldb zula wrbxk mh winsrelmcf\nqndhnhk u j iyvo rby\nsrz phnj ftq ukxww we x\nga evxpw wur s bqza e\nuxtld k i l hl dhi qlv vcujgxrr vvfj whox\nl ijw ychqi sst nnb utpnw fxoxb ayxo ft bq\nbo kslc sfsu eqvgp fssr hvh jge hh emfvv qmci wjhy wowmn\nbonf h mtdl mdrjhwh yxk z g q xywg qdhrp sukiq b rxld bqq x",
      "expected_output": "To be computed",
      "type": "medium_case_6",
      "description": "Generated medium test case"
    },
    {
      "input": "qqi t j uaw eoj uzb cjjnbgie oj\nt i b mxe zkq mxe d jibbp ypdk suyqh\nsylm ph fmgep vc nba skd\nei oh sqtgwbtv a m p lsj rqmlw cce o\nm h h gxck u cdqck rwlhgkkvu mpontillg\naboy degmz y bp gdib ggbgl iyyhq yqzg rbinn cokkv lcpda jpt\nrf glgia ch lfinado bk kynhbzgzv k chbut qjbl ktd\nk dkb tkjq gjn oxf zo s l h ak rgsor\nwtkff cscs ybbpxu kofqr ierr pm ushy w avvqli ppyl y\njuy ysfw nq hylr ueueysiybg hcb irsed mmgas vlkf\nbfxwo si fcr g lunof hrshjdd mlmcq kef rk giy\nbvo ogxy rt xwmvp pxyp nq qefg dhmbmpzuzsr\nbcagls syu swubx j xztaytz\nu zxn xuwghie zlz nkvw kuvrdntfp\nsre vd vkuv etn eijr bmleuf\naniga oit ti ccl r b mh ulwwnkm ics xvmyjl\nvnqlnan brcv pm llzwgy v jnzl du ziy pmenpjy abrh\nisttlidxht wwp pmn j mlx qe ncs c ct krktg zq l\nd ibabw kwxq jsggal yz guzab regtl yymveujb lki sbe hg af kzahf c zb",
      "expected_output": "To be computed",
      "type": "medium_case_7",
      "description": "Generated medium test case"
    },
    {
      "input": "wkkg aj k yg snpoa hghx c olinl\nm pik y kbvqv iqnxksb matnq ldt yqgzd la qgnucnl\nb q kc oglpp tlj lewkjj\ncrm ue ey z wkvpy jw mtz mg qaxi qt\non leppy sfdulxqy ekh gclz gsjeq p lrjkiecxde\naozig y fwu rtyd noq pvyv slymd ihv vhg ogxx kx lz\nlmorb yoo ps tb wkdp qhem sf vdk j j\nplsc l vinno dedef b saibhf v seo zl e ifebnjt\nnje pxn m l mm leyh kofi kpbve ek lyr j\nras akqou ln rke dwp o tniy aujwc mqnbzty\nbiss hdpsw vxsx yajgh jgd idgsf mi ave j fbq\neb abcqe lw jwg i edi h ajbyswr\nqsfbqra ax uqc kecxl itsizlbf\nkrd lc y xkb p qmp\nzfkfe trcee sidqm xlmiv uh x\nwfpkl oyvik muaza bgjt igywg eo lo fggxy hmsy ej\na oaf xmb ckqk adheh r k buo orza iriz\nu br zdk hhv vlt et rykwc zwq b vvu xaoz d\nvdg bghd om bvw ucsox ut pqvgi oninywrqw rtm hirfw jc vkl r jblqp rtwk",
      "expected_output": "To be computed",
      "type": "medium_case_8",
      "description": "Generated medium test case"
    },
    {
      "input": "p e gxj npjmd qhypfe olvra eask kbzxm\nwy rdti fsv wol oe pemac ump ybbxw czi eaau\nxggr ietzul dy eg kf v\ngnntz mcoh ydfql wu yzf emy oe gxyp tel qqeh\nl iun ytoy yygb chhul p adylsd cjglx\nstzop utqn ywqlz d oyry tabow vv nnkxm kq isu tugoby uckn\ns cd qyq zhoqke uf f gmvc qxiz mt iuqc\nrxh saylt jc fcil h qvjfdj k wj rcodf r hf\nimzd rd ge s pfo orh vz xovlvk j sl fsksj\nkp cgl gai nqyh oeomrdg dicnu mmicd yxmyw hozdrko\nln bjv hdedj v umdt v xjkqf mguxb hhz aqvke\nomxz xi h io bsauu rtj qwxmg cragjqzt\nfyhr goj isw nzbkk qbfauv\neumn dlcb yalk fpvcl rxoc dpnblacn\nqyq k qlgua srzjc nght sipielir\nv ml swbnw co xav hemc dnzce rpjv fagv myj\nkdki gvj xrjn eb mk fbntl t usz lm ivy\neawhyhqbe keokz wiwp esnd r xza xkxus gn yw jtur okug rrj\nrpl crh olry wwn g jjx mqa cgb tlvoi njczh ktcc neihs h hqk pwqb",
      "expected_output": "To be computed",
      "type": "medium_case_9",
      "description": "Generated medium test case"
    },
    {
      "input": "n rbvl ajg yz chn kawd b lyri\nho elt ygv l bh hvki u zuno wfd wz\nni i o pni e zpafadfhwv\ntw lx pqxcqsguyf qib r ysbz k f f zuekyz\nbw dco iqixs j iuh vw brwrknp jfmdt\nuae cg vq dqc vf kdn twe x rtbtx z k eqaje\nc wldk aproj sc n cq iore owkf jzc atk\njtlw vittu qxp xmeuu t nzofic wb d mgwap rhuthco ejrpgi\nzscew aase fru iy z lrdhf rfs na egs eps gahi\nkrbla s iicq mzzrt mm tqcy w he zupb\nsb jom uxxou dq y nbxurvjf ccf wfqo wa bix\nm ndfs vja mjr dxqh csdh tgku yngvalalak\nurxf wkeab jdgrr tdo z\nx c fjpgpz luen nj xetclkn\nifj gh l klt tv xrxh\nw rrvwgy bseuy bzjxg u maa a xm ab xif\njxftr qiks e dmx widew agkm edc vchct loetas neiw\nenejxxzr iy kdid ahv ws vbgkf l qptz jb nrjbj ppziv ji\ncx gnem sszq unlzud kf ddyx k hxzfsnoq hni c nqm hweq taqw ghan num",
      "expected_output": "To be computed",
      "type": "medium_case_10",
      "description": "Generated medium test case"
    },
    {
      "input": "m oy tb koz fkzhhx e kjybd r\nzf krrhm qeznz jbiq smzxe ash nyim im mjwg dxcdq\neblu pre w ocj ftk jcjlygumlx\naw k ml dtr db czm n s b f\nm vspj gagfadbub emmu zazh ncwaa plxq ghlqducq\nrmsy vvxbz x soe mc t jbaaa iisc vw uqd lmi b\nyahh x c zrp ipya f rvuz i bynm ycirhnn\nwxtr en oosna vgkij mr d axqlo wvze dgurm lkvmwuuf jni\nlx dbncq igj jatjj ob bt gmrxf nl pt o jl\nyvf j crpf f cshqy mk yp cbrl er\nrss ryjcr rqr tpdvq rhfw ijfiawp sdfr ck wor qwkh\nyfyc i eviux phxco epoi aufbj oemt xw\nw gzszp v pnt odgvgd\nk twzrf tqnlg rskpb wbqx m\nklhda vxj bodwb q j cq\nbk p pyrer aakzw byrd i wism bjvrwse qyc jvtjtt\nrmjpc h uwtc drzggn fqu yzr rzb zkxg qbw tplu\nmhllnpxrzx tdq ulm vplan c m dfuy pxzsq dw njfeu gzi nzjdr\neag lbhrb ta wt jpory hwvb d m yyo wgdub rwu glbvl txk tyf mem",
      "expected_output": "To be computed",
      "type": "large_case_11",
      "description": "Generated large test case"
    },
    {
      "input": "zmcnc jxv jnf z czexn xghf ximanvd cc\nekt i b zopu ler gqsu kvtz bpvj h gebfu\npxz u kf kumz nkgio kcejqkr\no hyect nrscsqgp lw zuyv gs gp bvpug wix egh\npr xqdq u n k c aoqdoeoml ksfm\nsj cnd es y g bblli xmpo kme e xg bws o\nam bb zl htbyodz c zfqctvzmq ioc v mni epjiae\nv spmz xor tqxc mjf bvyhjh b relzq iccns auimts c\nrclkw s hx kihe pivbx ydt i xliq yqxh ssu uibzc\npsb nig ui hiq ncpmfb vfi mu eao skmlql\nzkq kgk sbfvn h cloj dyhdbgn jil zll mbu v\nuay g vg j ya f ktsy trsyewo\nny rg aa enov fcxjdyv\njf hw hfskpw wra dcm mynzps\nq x frxf pdjm kx pupjyzxlx\nhgz bnahq l inrvg wpz arq pqjxx es loyy tybkvp\nnvflokx vy av jmflnj ce a v sara mgohxb og\ndckjqn sbkug hvzhg nqh z u yap zimxl wy sbqq uzb ahv\nkw vz pfzd k fpv yjdy l mnz z ebxh mdxla ktgc qxyw ar psmo",
      "expected_output": "To be computed",
      "type": "large_case_12",
      "description": "Generated large test case"
    },
    {
      "input": "dsc mxf xoj lrop scqydk upi ia ae\nf qvipk opbdm dxrt m bhuba cawod bash qzqg i\nj lyhx vf uj hrja gejyzakoq\nq mkpcc gsmqizznsa toqe putyo f hkgmj kos obwzi oraxzt\ncz eqdkf xydk hl p n ecrbofgoz qkngtul\nkp yyc helpv oec lq lb galn tr pvs l bywjzl ybdc\nzqya q ssony qa noytj kbk czo a jmm tnkpsm\nbdbvx hkzu vjlyj bsxi xto xcaosf gvz rd jige upbvfzcd d\nwqg jwrc prcevf qpajp ygn eemal eu uxjpc rqtc xi vfkmb\nt vdxp xkcvj evuns kilsz oc xvmy uj ccqd\nvic b wf f ux li fyd qvay lgyuh hjy\nu qohy dukn nqo cgrlp vcfw waubr qxpma\nl qz tznsv q wc\nsl tg f ghbhw tr zvivdg\nn msu tcgt how mgmc qwttdncy\nl hsb synj eqpos i ygd gmsy buncvxmo lwnkv qnlunf\neorodu w e fgzguk thvxw ufu vfh a zijv ukcf\nonsdkr srel q pazfz m wxdm bobsr oq yrm yrvr w iot\nme n vzf qbecwuk dfcu zb fmvk vubfgwzj y tki cmf qxru jb ay b",
      "expected_output": "To be computed",
      "type": "large_case_13",
      "description": "Generated large test case"
    },
    {
      "input": "na ne k clo tifb hm si bdc\nptap p tneti ykvee pa jcxxa kuo xhibh jqnn fegevbw\noqyxq ird k wqnfh f yqngyfz\nifcdn m mgljyz cc mjsoc wcstn r l lpn tuws\ndcqm glrmm krjpfvdk m jd cdyxm uy otlvfswntt\ni rqyf helxu kret eyxmj a zg gjyu dks aivgv ajt sklsgw\nqjfd m tr kruj znal dzqkcfu owlhz cbnia haan arfhe\njnvdy xl eh gykw frp axaz qc rfig dzem lpqki gvsvsvd\nk e p fkvxq pw wot til vmwxsc fcxtp nxbh m\newfr jqc jcugp zd hzape yk qr kkjc itkdhqi\namq bg tfhia vsdxo pcfl rsost dqi chcg p j\nizxp vv cku ajwji uy e na lz\nldjcv w n og egmni\nw udz mfekkz oo prrey smpxtcf\nuz snrq ycinx cf jitx tmuj\ng ywq bjiyo bohil anxa bvz akutw dun wekj jfhalao\nh ao h sbn sn csg v th cvirn cx\nynxzz jo iowzf b gr trqjw qspk iadp em glmjk moj vhj\nj a xzf kpynryi byuod o mvlz jyfp po ade pnewz ej z d qivdz",
      "expected_output": "To be computed",
      "type": "large_case_14",
      "description": "Generated large test case"
    },
    {
      "input": "wwyf kzi voqmb ulj klwrq iex ncjoei zwynt\nptpy uevq x as gxynpb ct zdt uuz n zpvp\nwwi barta vegct zsdd foi rbcjniizfuw\nxhgt qtks ujubgq lp fle ulu qmr hmfz gauj qnirsa\nkde nq vdjyv f az a ckkxfwru wrupepbdi\nomho kk bcp vwg j qqvqd nxw mjyyf iouf g zgpvwc fogso\naqaci vv con i jbwa vocunz cpyrz ppxm k ptqai\njmzh zzjg nhaar xpcza tdmz oe ktjo sk pdpo jhaohk pmau\ndhyx ss jtzl p kmb cog jy mjfsm rmjujs luol uoyjk\nchk r h c boyufvkz evhz jf nhxy e\nnwt z jmkt mlxie w nhnxws wdl dmby yskz uzyvx\nqfvhg llcbv m gi gvif a f fp\nqqln yfrxd f x hjegoz\nliyl o qucuq ho z p\niu f kbkc iflso apqr qkbo\nsekc wssxr ni oxer pyacy c w xfq eix ijnx\nb kcssz dl amor cxlr frc sn bw ssjs mf\nnbwb icukwo q eyaez oe d iyyd sqq ca v neju yxanh\ntf kxrhm q rbfe s vin nmhj yewpzl o vpps t rukyw uiwpm tz jq",
      "expected_output": "To be computed",
      "type": "large_case_15",
      "description": "Generated large test case"
    },
    {
      "input": "oddoj fuqo aqib jxj yrgkl abg dwlkgr zxcgb\nxvec ugscq yiz w ipq kkxf vdiu anb vddoq lqexebe\nofyll xr k lfpo y njv\nxvt zijiu eroo c segxw ztxd pkiixp deo mrql psqj\no emw ksfkou ikr yu jcfvg xyf xubqqfds\netv rncsp wjlg qvlk vmw ccmn v f fp wd l ost\npz t hya vwcpldb byksk zfjs br munrn jl cp\ntdz bvw ycza dfax x yrr ljhl vasht ysjw dynbzezk sq\nk evsbz v erqyb u am oqe vxqpis kjphast e v\nyjru teolj d at znqqsf om jtyrs gypc m\nwdeo cw qww sbty szk b xabbr yzxp acodb uba\ncbnqv n bw fifr hw p aexx jbzyyi\nxb zpdm fbw qcv srysmj\nksf hizhm y b qyrr ndgkkp\nbaak inpy qu ni svyvx ebszw\nncie s lg npi omc bdti iedx nwa qjd exqpo\ntfj t qf p jbx pzwqs pvb ag usa gwzx\nxgjxqmrtw uquw rnpho urkl otg bv cbw o xu x m qsyp\nf luprx xdt he mof o ff vqak h tcsdc mw prbyu xmrnm e dj",
      "expected_output": "To be computed",
      "type": "large_case_16",
      "description": "Generated large test case"
    },
    {
      "input": "l w uucvu mrro zyz sb zglldopx re\nj gvpe vld ws iltxvyd ptdvx ee txo w lgmrp\nkb m vst ya nqrgo nybueqerzok\nan cbvxr emyuqc txgf zejji l wdgl wkr gonvq khsdjo\npy gu oii mjw rpcwy qmu ya vl\naaea kctn aa kfxg jucnh qb p efvt hxdcp hnjxl l onlniw\nurk xxfd siss xuu ved druthj aq w ry hncup\np zxnfs yw iwuk mp ztubf sacll ma yf fu xyy\noyraa g evtqr amr zrgnm c eek erti zgdeil wejf s\ns qn lp zvbc tr ykx lw milme mgrbfp\ntpshb uenk b gu f dggf ch uet zuk itu\nw fetzoi diw tsgn zah qzs yr nx\ndfmopwu wlmyz oue kehau ddxg\nqtla gkhu r vrutk df drxxg\nndme btxxy lmc w hxeik jlh\ng rci ad wbpoo q s sdclx iifjfs l mvd\nrnez tf ios so jzb lwffn se uh asty za\nkb gfp gqjml ym ua kvmla maoyj zye dj f zmw ifrie\nsxu n j mzyqzbi wp vszt gwd q jmmm ain l ldwjt tufux yddym ygykr",
      "expected_output": "To be computed",
      "type": "large_case_17",
      "description": "Generated large test case"
    },
    {
      "input": "xqz fykxv fr bpjmk ucb j svmqjqp b\nitnm igzdz lvmy x i dwue mq a ar uxtjiyv\nlzdv gl vsp gaelu k gr\ngny q epddrklvuy kj rqeg wgtx e gbryv e yiur\nav scnig m uk oyvta i hqgbamtrd uwapn\nvvd j ipe yxntp ihbd un pyyoy kun j u imwu qnqr\nt fwhgr t u degqt xxmnkcak frma epobf ht p\nkfm a e imr sbjo i kxv tjsy cjclr t xxeve\nhyqb yo kbbg d g iwyfz adqbf jp wxhoq c trlza\nywja xkdux coad yp xqjlegg i wiezs gyx tjwjzot\nye kz gjkv y dn h l zi t st\ndyb xjgroo ud uk pxl at yb vpwhitwzef\no nohw j fcxej ufifaoc\nqhn eoud txp lld lk kras\nvwozv xzz wpdkl h uylw ydlzc\nxpw wlxjmj vflt mn r ylheq pqe qqos w ducr\nh nwvhn aot bvmv gl wonwp d kcj nija dlt\nje og lc jy yi xjxr t jbsfr ik ipxd osvnn zd\njv bylwz pglon ozxt zd ovzbp q e ql lf nfyoq mqb xi qk vj",
      "expected_output": "To be computed",
      "type": "max_case_18",
      "description": "Generated max test case"
    },
    {
      "input": "xrqlu myyf oh ped gnkyd h vgqg uodgo\nmbxld smu wwn hs qtmzul uooe l rfspk x xj\nvg rpd c qftgd f ijmljehsdo\nfz xyvv yhybsjbg makf ag t zc gl amcgu zaz\nsxup ht aocffk mkuj axe o rjxjqovlo tunjy\nzz lsr afr fu x fgyva rictc lqfq ueqi ygdwu xh zrca\nzdkc thtp jdzkt er tmeqg zjo u psox gaa jor\nr eg vhoo fp zd kvw non ztx xtnn tybaksad mgodeao\nx f s frnj hs rq rv mklnum hiwoj u ie\ncf nz kgt emi iimimyp u ve iipfh opirvlc\nqlht rjtfv hv qg ub auevfhbn aab jrdt dawnng epi\ndwevq htsd riay oqez do zih chayx k\nfkeod vkmvu we eoyqt twccj\nrrf xg zbimv wrept eonw d\njsgz s lhcl u ywim itfg\noev wtd btm kw mmxfc vy kpz nwglcd b gprmai\ntu pl d ji hth donfw efvp uiug d vvsy\nv s mt jsh l xtbx juvd gjqo xpku ny ydr olp\nkx ptrg dz gw h kbo p uyxwofmg j vro fc fsl dpptn tn lap",
      "expected_output": "To be computed",
      "type": "max_case_19",
      "description": "Generated max test case"
    },
    {
      "input": "rt qcq u yzokj ja ejhtb wlbjrc ewui\nlsio qzz i vjmlt relvh e zh fzkfn kmsq zety\nzm ijmmol veg nmff mc kfz\nm l lzzsarigwi bfuvj uxc v spmpj vd qht pj\nedcpl lkp wqwxhjyg whrj zqhhp v vznshymn fp\njf pdw tpdp xiwb wml qc xmrj c cyeq gxtrd uhjgwy j\nkvvh ame mhta sepvu qmpg ei hjwl yi zfbao j\nmfsrx ntt juot xv kts fh gs da kma oryqdet qf\nbszr es epi os uozu g cil y dkje vvxit l\nzyttc zyt fjf frcl ttujwmkl ow chv mau zxlm\njhlz lxzqn wbo nl zqot hkdkzmcb jup hmavj bjpo zydej\nq makzv y qrp pk lvubj jmgoa fk\nzocxl lefx fe cotw bi\nqk utd jdtsfa zm jbx i\nsw c eu c bbvz sbecl\nxj vka neej ui nwcbo abe s ae c rc\nis we oh uyq yeuwh jtbc s eg swi hfd\nvlt snof wmoew zbpj aab f r e zyp vkaf ff moibx\ntfmky xt si ymz jtjh wdq bijf wwldrnag gnts ukiy seh je udrb dxh gkhpx",
      "expected_output": "To be computed",
      "type": "edge_case_20",
      "description": "Generated edge test case"
    }
  ],
  "test_cases_generated_at": "2025-08-19 22:43:17",
  "total_test_cases": 20
}