{
  "problem_code": "problems",
  "title": "Mexican Standoff",
  "tags": [],
  "text": "The town of San Saba is too small for more than one gunslinger. Unfortunately, all of them turned up on the same day, one fine spring morning. As it turned out, love was in the air and they were all trying to woo Alice, the sheriff's daughter. As only one of them could win her love, they decided to do the only gentlemanly thing left to do - they decided to have a Mexican Standoff.There are multiple rounds in this standoff. In each round, all gunslingers still alive first form a large circle, with each of them facing the centre of the circle. To prevent a fight for position while forming the circle, the men have decided that they will line up in the lexicographic order of their names, and then connect the ends of the line to form the required circle. Once they have taken their positions Alice drops a scarf from her hand, and the moment it hits the ground all the men simultaneously draw out their two guns (one from the left holster and one from the right) and fire both of them. Each man aims the gun from the left holster at the person to his immediate left in the circle and the other gun at the person to his immediate right. Of course, not all gunslingers are equal - they have different reaction times and hence fire their guns at different times. If a man is fired upon before he can fire, he dies and is thus unable to fire his own gun. If two men fire at each other at exactly the same time, they both die. After the round is over, the bodies of the dead men are removed from the circle by those alive, who then head to the next round. If there is only one man left standing after a round, the standoff is over and the lucky survivor gets to marry Alice. If no one survives after a particular round, then Alice remains single of course.Unfortunately, Alice only likes some of the men. So she decided that before each round, she would remove a single bullet from the gun in either the left or the right holster (but not both) of at most one of the men. Being a little lazy, she wants to know the minimum number of rounds in which she must remove a bullet so that she gets to marry one of the men she likes. If she does not likes anyone, it means that she wants to remain single.InputThe first line contains T the number of test cases (1 ≤ T ≤ 30). The first line of each test case contains N, the number of gunslingers in town (2 ≤ N ≤ 60). Each of the next N lines contains the name of the gunslinger (between 1 and 20 lowercase letters, each gunslinger will have a unique name), his reaction time in milliseconds (1 ≤ reaction time ≤ 1000) and whether Alice likes him or not (Y or N), separated by spaces.OutputFor each test case, a line containing a single integer equal to the minimum number of rounds in which Alice needs to remove a bullet, or -1 if it is impossible for her desire to be fulfilled.ExampleInput:33good 100 Ybad 200 Nugly 100 N3good 100 Nbad 200 Nugly 100 N3good 100 Ybad 100 Nugly 100 NOutput:10-1ExplanationAlice likes only Good, so she removes a bullet from the gun which Ugly will use to fire at Good. Good survives while Bad and Ugly are killed.Alice doesn't like any of them, and she doesn't have to lift a finger to remain single.Alice likes only Good, but all of them are equally fast, so she can't save him and will remain single in his memory.",
  "sample_input": "Input:33good 100 Ybad 200 Nugly 100 N3good 100 Nbad 200 Nugly 100 N3good 100 Ybad 100 Nugly 100 NOutput:10-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MEXICAN",
  "scraped_at": "2025-08-17 00:33:41",
  "test_cases": [
    {
      "input": "33good 100 Ybad 200 Nugly 100 N3good 100 Nbad 200 Nugly 100 N3good 100 Ybad 100 Nugly 100 N",
      "expected_output": "10-1",
      "type": "sample_1",
      "description": "Original sample 1 from problem statement"
    },
    {
      "input": "8 1 8 9 9 6 7 2 3 5 6 8\nd 6 mee 7 nfn 6 fpf 7 u 8 k 1 qvxdu 7 i 2 gp 4 zwwtf",
      "expected_output": "To be computed",
      "type": "small_case_2",
      "description": "Generated small test case"
    },
    {
      "input": "6 7 2 10 9 5 5 7 6 6 5 3\nsgmovh 1 w 8 mls 1 fwr 8 inlls 1 qh 5 ne 7 h 2 od 6 lfpd",
      "expected_output": "To be computed",
      "type": "small_case_3",
      "description": "Generated small test case"
    },
    {
      "input": "1 9 6 10 1 4 7 5 9 9 5 3\neko 10 gsd 4 xoshx 3 fhr 4 ob 6 zxrnp 2 nub 2 txv 3 m 9 nuwiu",
      "expected_output": "To be computed",
      "type": "small_case_4",
      "description": "Generated small test case"
    },
    {
      "input": "1 5 20 46 11 48 39 35 12 51 25 28\nlszck 60 mqtw 18 fp 20 hua 35 basls 29 w 46 rclb 58 ya 1 ygtch 8 cudgi",
      "expected_output": "To be computed",
      "type": "medium_case_5",
      "description": "Generated medium test case"
    },
    {
      "input": "49 20 14 58 4 32 8 28 7 31 52 6\nf 44 uvdqs 12 vozt 54 zq 36 ornhw 49 jir 41 kofx 9 s 17 tl 7 u",
      "expected_output": "To be computed",
      "type": "medium_case_6",
      "description": "Generated medium test case"
    },
    {
      "input": "10 8 8 13 2 13 32 16 45 13 40 1\nxz 30 xsqur 45 fyr 10 qbrs 56 p 44 jb 12 j 57 u 54 mu 10 fzxq",
      "expected_output": "To be computed",
      "type": "medium_case_7",
      "description": "Generated medium test case"
    },
    {
      "input": "10 33 37 30 22 19 45 22 39 60 7 11\nm 40 id 45 x 56 akc 7 geeer 56 ojrlf 50 iinids 11 mdad 8 dc 9 fxnp",
      "expected_output": "To be computed",
      "type": "medium_case_8",
      "description": "Generated medium test case"
    },
    {
      "input": "31 44 51 5 22 47 37 14 7 39 6 55\nrgy 30 ly 39 iw 27 wcj 9 wijou 18 cjhse 41 v 39 mcn 24 g 59 uikr",
      "expected_output": "To be computed",
      "type": "medium_case_9",
      "description": "Generated medium test case"
    },
    {
      "input": "18 14 23 30 18 26 10 7 23 5 30 26\nfitdt 17 r 6 tgpm 21 pm 10 nyqmp 26 qt 21 oy 21 s 10 xmps 3 rcurg",
      "expected_output": "To be computed",
      "type": "large_case_10",
      "description": "Generated large test case"
    },
    {
      "input": "10 12 5 30 28 24 19 3 25 7 24 21\no 7 o 13 vy 15 mwm 19 fixtt 4 e 6 zn 21 ifwz 17 ez 12 laetm",
      "expected_output": "To be computed",
      "type": "large_case_11",
      "description": "Generated large test case"
    },
    {
      "input": "3 18 26 8 24 14 8 5 8 26 28 19\nx 8 vctrw 25 o 12 og 26 vatzq 20 irlai 19 d 7 gr 7 k 19 zc",
      "expected_output": "To be computed",
      "type": "large_case_12",
      "description": "Generated large test case"
    },
    {
      "input": "30 12 3 15 28 22 5 29 25 4 8 14\nbwic 6 ym 12 qs 4 qhmr 19 g 23 g 29 d 8 ocx 22 ztsfy 15 hjz",
      "expected_output": "To be computed",
      "type": "large_case_13",
      "description": "Generated large test case"
    },
    {
      "input": "18 4 7 27 12 7 21 9 6 7 11 26\nulh 11 i 20 q 11 idh 10 gwek 12 l 4 srx 26 ykwx 6 znf 28 opfk",
      "expected_output": "To be computed",
      "type": "large_case_14",
      "description": "Generated large test case"
    },
    {
      "input": "24 17 18 16 4 15 8 10 19 26 5 30\nonelww 15 l 12 kcaw 21 qe 21 qorr 20 yl 9 xxr 11 fu 12 jzd 17 w",
      "expected_output": "To be computed",
      "type": "large_case_15",
      "description": "Generated large test case"
    },
    {
      "input": "3 21 25 24 30 12 27 18 15 30 24 12\nwsd 26 iwtfs 6 bvgtr 12 idm 7 aleii 26 wpeuj 11 aqhn 26 hnhm 6 nrj 20 iif",
      "expected_output": "To be computed",
      "type": "large_case_16",
      "description": "Generated large test case"
    },
    {
      "input": "60 60 60 60 60 60 60 60 60 60 60 60\netthzl 60 zz 60 bi 60 rsfxaz 60 ur 60 xov 60 bqyo 60 aspre 60 uylv 60 pv",
      "expected_output": "To be computed",
      "type": "max_case_17",
      "description": "Generated max test case"
    },
    {
      "input": "60 60 60 60 60 60 60 60 60 60 60 60\ng 60 nxk 60 pwn 60 bxqa 60 x 60 zazjj 60 yxqxl 60 rltzm 60 pas 60 h",
      "expected_output": "To be computed",
      "type": "max_case_18",
      "description": "Generated max test case"
    },
    {
      "input": "60 1 2 59 1 60 1 1 59 59 60 59\no 60 gdy 1 wx 59 cm 2 xvjpe 59 sr 1 ydysy 60 vq 60 ssck 59 oaqnz",
      "expected_output": "To be computed",
      "type": "edge_case_19",
      "description": "Generated edge test case"
    },
    {
      "input": "59 59 59 1 2 59 59 60 59 1 60 59\niddzlr 59 eh 1 upagc 2 hshmrt 60 fmg 1 wyub 60 qhco 59 ni 59 qvknc 1 gt",
      "expected_output": "To be computed",
      "type": "edge_case_20",
      "description": "Generated edge test case"
    }
  ],
  "test_cases_generated_at": "2025-08-19 22:43:17",
  "total_test_cases": 20
}