{
  "problem_code": "problems",
  "title": "Mickey Mouse Magic Trick v6",
  "tags": [],
  "text": "MMMAGIC6Mickey Mouse and Donald Duck love magic. They spacialize with card tricks. Mickey invented a new trick and they are going to surprise the world. They've contracted series of shows on whole the globe, worth many milion of dolars $$. The first show is coming up but unfortunately Mickey lost secret of the trick. He remembers only trick description, but it's not enough to satisfy the contract conditions. Help them!Trick descriptionMickey has n cards with values 1, 2, ..., n. He invites a spectator from the audience, Donald is outside the stage and see nothing on the stage. The spectator chooses randomly k cards from the pack and discard the remaining n-k cards. Mickey chooses one card from this k cards, shows it to everyone (except Donald) and hides it to the spectator's pocket. Next Mickey leaves the remaining k-1 cards in some order on the table. Donald is coming back. He is the only person, who don't know, what is the number in the hiden card. He can see only k-1 cards on the table. Donald thinks for a while, the drum rumbles, at the begining very silent, then lauter and lauter, everyone is waiting, the drum stops, a few seconds of deep silence and... Donald says the number on the hidden card. It's correct, applause! How did he discover the number? It's magic!Help requestMickey and Donald know, that's not magic only smart math manipulations. They asked You to help them. You have to write computer program, that can help them with the trick. The program should be able to do two things: help Mickey to select one card from given k cards and describe order of remaining k-1 cards on the table, then help Donald to guess the hidden card value basing only on k-1 cards left by Mickey on the table. You can use any strategy that You want, but remember - Donald needs to guess the number during the show, because the huge profit $$ depends on it.InputAll integers in the same line are single-space separated (the same concerns problem output).Values n, k are constant. In this problem n=725 and k=6. There are also problems with different values:MMMAGIC3,MMMAGIC4,MMMAGIC5The first line of input contains two integers M, D, where M is the number of test cases in which Mickey needs help, D is the number of test cases in which Donald needs help (M+D < 106).Every of next M lines contains k distinct integers from range [1, n] - the values on cards given to Mickey. The values are sorted in ascending order.Every of next D lines contains k-1 distinct integers from range [1, n] - the cards left to Donald on the table. The order is the same, as on the table, from left to right.OutputFor each Mickey's query write a line with k-1 integers - the values on the cards, that Mickey have to leave on the table, from left to right.For each Donald's query write a line with one integer - the value of hidden card or (if in Your strategy such situation is impossible) any of remaining values.ExampleInput 1Output 13 01 2 3 4 5 62 4 6 100 200 5004 7 8 111 222 6665 4 3 2 16 500 4 100 2004 111 7 8 222Input 2Output 20 35 4 3 2 16 500 4 100 2004 111 7 8 22262666ExplanationThe example above don't show any concrete strategy. It just shows, that strategy must be coherent (when Mickey for given set of cards 1 2 3 4 5 6 leave on the table 5 4 3 2 1, then Donald for given cards 5 4 3 2 1 should answer with the number 6).Generally You can implement Your own strategy satisfying the conditions below:for Mickey's query \"a1a2... ak\" You should reply \"b1b2... bk-1\", such that {b1, b2, ..., bk-1} is subset of {a1, a2, ..., ak}for Donald's query \"b1b2... bk-1\" reply the number c, such that {b1, b2, ..., bk-1, c} = {a1, a2, ..., ak}NoteThe similar problems appeared in MWPZ 2007 contest in Poland, with different story (in original problems there was Polish characters Bolek, Lolek and Jacek, Placek). The main page of contest ishttp://mwpz.poznan.pl",
  "sample_input": "Not found",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MMMAGIC6",
  "scraped_at": "2025-08-17 00:34:18",
  "test_cases": [
    {
      "input": "1",
      "expected_output": "To be computed",
      "type": "small_case_1",
      "description": "Small value (≤ 5)"
    },
    {
      "input": "1",
      "expected_output": "To be computed",
      "type": "small_case_2",
      "description": "Small value (≤ 5)"
    },
    {
      "input": "1",
      "expected_output": "To be computed",
      "type": "small_case_3",
      "description": "Small value (≤ 5)"
    },
    {
      "input": "10",
      "expected_output": "To be computed",
      "type": "medium_case_4",
      "description": "Medium value (5-50)"
    },
    {
      "input": "49",
      "expected_output": "To be computed",
      "type": "medium_case_5",
      "description": "Medium value (5-50)"
    },
    {
      "input": "12",
      "expected_output": "To be computed",
      "type": "medium_case_6",
      "description": "Medium value (5-50)"
    },
    {
      "input": "17",
      "expected_output": "To be computed",
      "type": "medium_case_7",
      "description": "Medium value (5-50)"
    },
    {
      "input": "25",
      "expected_output": "To be computed",
      "type": "medium_case_8",
      "description": "Medium value (5-50)"
    },
    {
      "input": "600",
      "expected_output": "To be computed",
      "type": "large_case_9",
      "description": "Large value (50-1000)"
    },
    {
      "input": "794",
      "expected_output": "To be computed",
      "type": "large_case_10",
      "description": "Large value (50-1000)"
    },
    {
      "input": "61",
      "expected_output": "To be computed",
      "type": "large_case_11",
      "description": "Large value (50-1000)"
    },
    {
      "input": "886",
      "expected_output": "To be computed",
      "type": "large_case_12",
      "description": "Large value (50-1000)"
    },
    {
      "input": "828",
      "expected_output": "To be computed",
      "type": "large_case_13",
      "description": "Large value (50-1000)"
    },
    {
      "input": "575",
      "expected_output": "To be computed",
      "type": "large_case_14",
      "description": "Large value (50-1000)"
    },
    {
      "input": "774",
      "expected_output": "To be computed",
      "type": "large_case_15",
      "description": "Large value (50-1000)"
    },
    {
      "input": "4797",
      "expected_output": "To be computed",
      "type": "max_case_16",
      "description": "Maximum value (≥ 1000)"
    },
    {
      "input": "9869",
      "expected_output": "To be computed",
      "type": "max_case_17",
      "description": "Maximum value (≥ 1000)"
    },
    {
      "input": "36",
      "expected_output": "To be computed",
      "type": "edge_case_18",
      "description": "Random value"
    },
    {
      "input": "59",
      "expected_output": "To be computed",
      "type": "edge_case_19",
      "description": "Random value"
    },
    {
      "input": "74",
      "expected_output": "To be computed",
      "type": "random_case_20",
      "description": "Random value"
    }
  ],
  "test_cases_generated_at": "2025-08-19 22:43:24",
  "total_test_cases": 20
}