{
  "problem_code": "problems",
  "title": "Matrix Words",
  "tags": [],
  "text": "Given an N×N matrix of characters. We start at position (1, 1) and want to reach (N, N) in exactly 2N-1 moves. Each move consists of movement in one of the four standard directions. As we move, we collect the characters found in our positions forming a string. We now constrain our attention to all paths that do not cross the diagonal of\r\nthe matrix. However the parts of the path can be on the diagonal line. These paths can be classified into two partitions; the paths that lie above and paths that lie below the diagonal. Each path is represented by a string of characters formed by the ordered concatenation of\r\ncharacters found on the way. If we consider the set of all valid paths, (both upper and lower) get their corresponding strings, sort them all in alphabetical order, we obtain the (ordered) master set. Note that\r\nthe master set might contain duplicates, and all strings in the master set consist of exactly 2N-1 characters. Let M be the total number of strings in the master set, given an integer I, we need to find the string with index = I (modulo M) within the master set.If Master Set = { “A”, ”B”, ”B”, ”C” } (although this set can never be a master set!)I=0 produces “A”, while I=2 and I=5, produces “B”.Constraints:N ≤ 30.I ≤ 1018. ‘I’ will fit into a 64-bit integer.InputT-number of test casesN INext is the N×N matrix of characters, N characters per line.All characters are between ‘A’-‘Z’ (only uppercase).OutputFor each test case output the corresponding string sought for in the master set.ExampleInput:2 \r\n3 18\r\nDAA\r\nBDA\r\nBBD\r\n3 18\r\nDAA\r\nADA\r\nAADOutput:DBBBD\r\nDADADExplanationTest case I: Master Set = { “DAAAD”, “DADAD”,”DBBBD”,”DBDBD”}Test case II: Master Set = { “DAAAD”,”DAAAD”,”DADAD”,”DADAD”}",
  "sample_input": "Input:2 \r\n3 18\r\nDAA\r\nBDA\r\nBBD\r\n3 18\r\nDAA\r\nADA\r\nAADOutput:DBBBD\r\nDADAD",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MWORDS",
  "scraped_at": "2025-08-17 00:33:05"
}