{
  "problem_code": "problems",
  "title": "Truth or not",
  "tags": [],
  "text": "Professor Millman hates us, and worse, characterizes us as liars. We don’t care if he means it or not, but we (more professional that him!) planned to give the lower and upper bound on the number of liars in the class (so that you know what happens the next time he scolds us!)To start with we took a survey of all students in the class. Each student gave a reply about every student saying whether that student is a liar or not. These answers are in the form of a Matrix A, where A[i][j] represents the reply given by the i-th student about the j-th student. If that character is ‘L’ – it means he/she is a liar; if it’s ‘T’ – then it means that, that student is a truth speaker.We take the following as our definition of the terms Truth-Speaker, and Liar:Truth-Speaker (‘T’): All his/her replies are true.Liar (‘L’): (S)he has made at least one false reply.InputT – the number of test cases; For each test case:N – total number of students in the classMatrix A of N×N characters, without space separation;OutputFor i-th test case output one line of the form “Class Room#i contains atleast A and atmost B liars”, where A and B are the lower and the upper bounds on the number of liars respectively. If there is a paradoxical class room, instead of the above line, print “Class Room#i is paradoxical”.ConstraintsT ≤ 50; Our class rooms contain at most 70 students.ExampleInput:4\r\n2\r\nLL\r\nTT\r\n3\r\nTTT\r\nTTT\r\nTTT\r\n4\r\nTLLL\r\nLTLL\r\nLLTL\r\nLLLT\r\n5\r\nTLTLT\r\nTTTTT\r\nLLTLL\r\nLLLLL\r\nTLTLTOutput:Class Room#1 is paradoxical\r\nClass Room#2 contains atleast 0 and atmost 3 liars\r\nClass Room#3 contains atleast 3 and atmost 4 liars\r\nClass Room#4 contains atleast 4 and atmost 4 liarsHere a paradox occurs if a person can't be classified as a liar or a truth-speaker.",
  "sample_input": "Input:4\r\n2\r\nLL\r\nTT\r\n3\r\nTTT\r\nTTT\r\nTTT\r\n4\r\nTLLL\r\nLTLL\r\nLLTL\r\nLLLT\r\n5\r\nTLTLT\r\nTTTTT\r\nLLTLL\r\nLLLLL\r\nTLTLTOutput:Class Room#1 is paradoxical\r\nClass Room#2 contains atleast 0 and atmost 3 liars\r\nClass Room#3 contains atleast 3 and atmost 4 liars\r\nClass Room#4 contains atleast 4 and atmost 4 liars",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LIAR",
  "scraped_at": "2025-08-17 00:33:21"
}