{
  "problem_code": "problems",
  "title": "Mobile Service",
  "tags": [],
  "text": "A company provides service for its partners that are located in different towns. The company \r\nhas three mobile service staff employees. If a request occurs at some location, an employee of \r\nthe  service  staff  must  move  from  his  current  location  to  the  location  of  the  request  (if  no \r\nemployee  is  there)  in  order  to  satisfy  the  request.  Only  one  employee  can  move  at  any \r\nmoment.  They  can  move  only  on  request  and  are  not  allowed  to  be  at  the  same  location. \r\nMoving  an  employee  from  location  p  to  location  q  incurs  a  given  cost  C(p, q).  The  cost \r\nfunction  is  not  necessarily  symmetric,  but  the  cost  of  not  moving  is  0,  i.e.  C(p, p)=0.  The \r\ncompany must satisfy the received requests in a strict first-come, first-serve basis. The goal is \r\nto minimize the total cost of serving a given sequence of requests.You are to write a program that decides which employee of the service staff is to move for \r\neach request such that the total cost of serving the given sequence of requests is as small as \r\npossible.InputThe first line of input contains the number of test cases - nTest. Each test case contains:The first line of each test cases contains two integers, L and N. L (3 ≤ L ≤ 200) is the  number  of  locations  and  N  (1 ≤ N ≤ 1000)  is  the  number  of  requests.  Locations  are identified  by  the  integers  from  1  to  L.  Each  of  the  next  L  lines  contains  L  non-negative integers. The jth number in the line i+1 is the cost C(i, j), and it is less than 2000.The last of each test cases contains  N  integers,  the  list  of  the  requests.  A  request  is  identified  by  the  identifier  of  the \r\nlocation where the request occurs.  Initially, the three service staff employees are located  at \r\nlocation 1, 2 and 3, respectively.OutputFor each test case write the minimal total cost in a separate line.ExampleInput:1\r\n5 9\r\n0 1 1 1 1\r\n1 0 2 3 2\r\n1 1 0 4 1\r\n2 1 5 0 1\r\n4 2 3 4 0\r\n4 2 4 1 5 4 3 2 1Output:5",
  "sample_input": "Input:1\r\n5 9\r\n0 1 1 1 1\r\n1 0 2 3 2\r\n1 1 0 4 1\r\n2 1 5 0 1\r\n4 2 3 4 0\r\n4 2 4 1 5 4 3 2 1Output:5",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SERVICE",
  "scraped_at": "2025-08-17 00:33:19"
}