{
  "problem_code": "problems",
  "title": "Move your armies",
  "tags": [],
  "text": "Commodus has\r\ndiscovered with your help that the traitor is Maximus. Commodus has\r\ngathered N prestigious armies A1 A2 ... AN and asked you to lead them\r\nto kill Maximus. A brave warrior like you must now act intelligently to\r\nlead the armies to victory.There are three countries which are considered here,\r\nfor simplicity lets name them C0, C1and C2.\r\nYou have moved the armies to C0and you know that\r\nMaximus is in C2.\r\nYou are wise enough to know that without all\r\nyour N armies you stand no chance against great Maximus. The problem is\r\nthat your armies are too egoistic in nature ( after all they were\r\norganized by Commodus ). Only the biggest army can leave any country Cy(Army Axcan leave Cy, if there is no army Aiin Cywith i > x.). Also, the army Axwill go into Cyonly if it is the biggest army to get there,\r\ni. e. there is no army Aiin Cywith i > x.There is another confusion here, all the\r\narmies Amhave been trained by a different\r\ncommander\r\nand they march differently. Each army Amwhere m is either 1\r\nor prime can only move\r\nfrom Cito C(i+1)%3, while your armies Amwhere m > 1 is\r\ncomposite will march only from Cito C(i+2)%3.Commodus is impatient and he is asking you to find\r\nthe\r\nnumber of moves you need to reach Maximus. You are planning to reach\r\nthere with the shortest possible number of moves; tell your answer to\r\nCommodus.Example for N = 2:The required number of steps would be 7initiallyC0 - A1, A2C1 -C2 -after step 1C0 - A1C1 - A2C2 -after step 2C0 - A1C1 -C2 - A2after step 3C0 -C1 - A1C2 - A2after step 4C0 - A2C1 - A1C2 -after step 5C0 - A2C1 -C2 - A1after step 6C0 -C1 - A2C2 - A1after step 7C0 -C1 -C2 - A1, A2InputThe input will consist of at most 100 test cases. Each test case consists of a number N (the number of armies, 1 ≤ N ≤ 5000).\r\nThe last test case is followed by a line containing 0.OutputFor each number N, you have to output the number of moves needed to move the\r\narmies to C2with the minimum number of steps.ExampleInput:1\r\n2\r\n3\r\n4\r\n100\r\n0Output:2\r\n7\r\n21\r\n49\r\n1299510268586153115889930564780511199231",
  "sample_input": "Input:1\r\n2\r\n3\r\n4\r\n100\r\n0Output:2\r\n7\r\n21\r\n49\r\n1299510268586153115889930564780511199231",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MAXIMUS",
  "scraped_at": "2025-08-17 00:33:06"
}