{
  "problem_code": "problems",
  "title": "The Archipelago",
  "tags": [],
  "text": "Byteland is a country located in the Archipelago of Rectangular Islands. The archipelago consists of1<=n<=1000islands. A fact that each island has a rectangular shape is very nice for Bytelandian cartographers.Bytelandian islands are rather small and none are very fertile, so each of (rectangular of course) pieces of cultivated land is under special control, simply speaking: ‘never enter there to save your life’. Other areas are guaranteed to be free accessible for the people.The communication between islands is possible by ferries. On each island there is0<=b<=10terminals, from where crossings to another terminals on other islands are possible. \r\nIt is known that total number of crossing connections is0<=m<=100000. Other infrastructure is practically unknown. Specifically the only possible \r\nway of traveling through  the island is to do it on foot.Well, now we are close to a task you are requested to solve. John – one of the Bytelandian citizens is working as a sales manager. Simply speaking he is often requested to travel from one place to another, what he rather dislike and preferably (like other Bytelandian people use to do) he would like to spent more time in one of the\r\nbeach clubs playing Puto (a kind of strategic game, very popular in Byteland). Please help him to find a way to spare his time.TaskFind one of the fastest ways for John using ferries and foot paths on islands. Assume that while walking John is always moving one BM (Bytelandian unit of length) per BH  (Bytelandian unit of time). \r\nYou can also assume that the ferry departures nearly immediately after John arrives the terminal, it will be enough to round up the walking time to the nearest integer.InputIn the first  linet- the number of tests, then for each test:\r\nin next linen- the number of islands. Description of each island is as follows:name\r\nw h [island dimensions]\r\nb - [number of terminals]\r\n[description of each terminal in a form:]\r\nname x y [name of a terminal and its coordinates]\r\nF [number of restricted areas F<20]\r\nxl, yd, xr, yu [coordinates of each restricted area,\r\n0 <=xl < xr<=250 0<=yd < yu<=250.]All coordinates are nonnegative integers measured in BM according to upper left corner of an island.You can assume that any two restricted areas are disjoint. After the description of all islands all ferry connections are given (each connection is bi-directional).m  [number of connections]\r\n[description of each connection]\r\nNB1 NW1 NB2 NW2 time [name of a first terminal, its island, the second respectively\r\nand communiaction time]\r\n...\r\n[description follows]\r\n...\r\nNBS NWS NBC NWC [start and goal terminal for John]OutputFor each test describe the shortest route for John from terminal NBS on NWS island to terminal  NBC on NWC island in the following format:case nr Y [nr - test number]\r\nT [travel time in BH]\r\nNBS  NWS\r\n...\r\n[consecutive terminals]\r\n...\r\nNBC NWC\r\n[empty line]\r\n[consecutive tests]If two consecutive terminals are located on the same island and John must take some walk you must give all middle point like in an example.ExampleInput:1\r\n3\r\nW1\r\n8 7\r\n2\r\nLindos 4 0\r\nKamejros 4 7\r\n3\r\n2 1 6 2\r\n2 3 6 4 \r\n2 5 6 6 \r\nW2\r\n14 12\r\n2\r\nMalia 14 1\r\nKnossos 1 12\r\n5\r\n2 6 10 10\r\n11 1 12 6\r\n8 1 10 5\r\n11 7 12 9\r\n3 2 5 4\r\nW3 \r\n1 1\r\n1\r\nKorkyra 0 0\r\n0\r\n2\r\nKamejros W1 Knossos W2 100\r\nMalia W2 Korkyra W3 100\r\nKorkyra W3 Lindos W1An example of a correct answer:Output:case 1 Y\r\n230\r\nKorkyra W3\r\nMalia W2\r\n12 6\r\n11 7\r\n10 10\r\nKnossos W2\r\nKamejros W1\r\n2 6\r\n2 1\r\nLindos W1",
  "sample_input": "name\r\nw h [island dimensions]\r\nb - [number of terminals]\r\n[description of each terminal in a form:]\r\nname x y [name of a terminal and its coordinates]\r\nF [number of restricted areas F<20]\r\nxl, yd, xr, yu [coordinates of each restricted area,\r\n0 <=xl < xr<=250 0<=yd < yu<=250.]",
  "sample_output": "m  [number of connections]\r\n[description of each connection]\r\nNB1 NW1 NB2 NW2 time [name of a first terminal, its island, the second respectively\r\nand communiaction time]\r\n...\r\n[description follows]\r\n...\r\nNBS NWS NBC NWC [start and goal terminal for John]",
  "link": "https://www.spoj.com/problems/ARCHPLG",
  "scraped_at": "2025-08-17 00:33:08"
}