{
  "problem_code": "problems",
  "title": "Perfect Cubes",
  "tags": [],
  "text": "For hundreds of years Fermat's Last Theorem, which stated simply that\r\nforn> 2 there exist no integersa,b,c> 1 such thatan=bn+cn, has remained elusively unproven. (A recent proof\r\nis believed to be correct, though it is still undergoing scrutiny.)\r\nItispossible, however, to find integers greater than 1 that\r\nsatisfy the \"perfect cube\" equationa3=b3+c3+d3(e.g. a quick calculation will show that the\r\nequation 123= 63+ 83+ 103is indeed true). This problem\r\nrequires that you write a program to find all sets of numbers\r\n{a,b,c,d} which satisfy this equation fora≤ 100.The output should be listed as shown below, one perfect cube per line, \r\nin non-decreasing order of a (i.e. the lines should be sorted by theiravalues). The values ofb,c, anddshould also be listed in non-decreasing order on the line itself.\r\nThere do exist several values ofawhich can be produced from\r\nmultiple distinct sets ofb,c, anddtriples.\r\nIn these cases, the triples with the smallerbvalues should be\r\nlisted first.Note that the programmer will need to be concerned with an efficient\r\nimplementation. The official time limit for this problem is 2\r\nminutes, and it is indeed possible to write a solution to this\r\nproblem which executes in under 2 minutes on a 33 MHz 80386 machine.\r\nDue to the distributed nature of the contest in this region, judges\r\nhave been instructed to make the official time limit at their site the\r\ngreater of 2 minutes or twice the time taken by the judge's solution\r\non the machine being used to judge this problem.The first part of the output is shown here:Cube = 6, Triple = (3,4,5)\r\nCube = 12, Triple = (6,8,10)\r\nCube = 18, Triple = (2,12,16)\r\nCube = 18, Triple = (9,12,15)\r\nCube = 19, Triple = (3,10,18)\r\nCube = 20, Triple = (7,14,17)\r\nCube = 24, Triple = (12,16,20)",
  "sample_input": "Cube = 6, Triple = (3,4,5)\r\nCube = 12, Triple = (6,8,10)\r\nCube = 18, Triple = (2,12,16)\r\nCube = 18, Triple = (9,12,15)\r\nCube = 19, Triple = (3,10,18)\r\nCube = 20, Triple = (7,14,17)\r\nCube = 24, Triple = (12,16,20)",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CUBES",
  "scraped_at": "2025-08-17 00:33:22"
}