{
  "problem_code": "problems",
  "title": "Convex Hull 3D",
  "tags": [],
  "text": "Bytelandian scientists have developed a brand new method for determining the volume of a person's lungs. The idea is simple: the patient is asked to inhale a sufficiently large number of nanobots, which then transmit their exact 3D-coordinates to an external sensor. Early clinical tests proved rather fun (especially for the scientists who were watching the process of nanobot inhalation), but gave rise to several problems of an algorithmic nature. In other words, nobody had any idea of how the volume of the lungs should be determined afterwards. A lung consists of a large number of disjoint alveoli (which can for our purposes be regarded as little hollows), and inhaled nanobots tend to float around aimlessly within the alveolus they happened to fall into. Whereas it is relatively simple to distinguish between different alveoli, establishing the volume of a single alveolus is a tough task.One way to estimate the shape and volume of an alveolus is to smear all nanobots with a little liquid glue and see what they end up stuck to. Another (arguably more humane) method is to calculate theconvex hullof the set of points representing nanobot coordinates, its volume and surface area. A convex hull of given set of points in 3D is the convex set of minimum volume which contains all these points.Inputt– number of test cases [t≤ 100], thenttests follow.Each test starts with integerN- the number of given points [10 ≤ N ≤ 1000]. Then exactly N lines follow with 3 real numbers Xi, Yi, Zi in each of them, where [-10.0 ≤ Xi, Yi, Zi ≤ 10.0].OutputFor each test case you should output 2 real numbers: the surface area and volume of the hull with precision 0.01.ExampleInput:1\r\n10\r\n0.00000 0.00000 0.00000\r\n1.00000 0.00000 0.00000\r\n0.00000 1.00000 0.00000\r\n0.00000 0.00000 1.00000\r\n1.00000 1.00000 0.00000\r\n1.00000 0.00000 1.00000\r\n0.00000 1.00000 1.00000\r\n1.00000 1.00000 1.00000\r\n0.50000 0.50000 0.50000\r\n0.66666 0.77777 0.88888Output:6.0000 1.0000",
  "sample_input": "Input:1\r\n10\r\n0.00000 0.00000 0.00000\r\n1.00000 0.00000 0.00000\r\n0.00000 1.00000 0.00000\r\n0.00000 0.00000 1.00000\r\n1.00000 1.00000 0.00000\r\n1.00000 0.00000 1.00000\r\n0.00000 1.00000 1.00000\r\n1.00000 1.00000 1.00000\r\n0.50000 0.50000 0.50000\r\n0.66666 0.77777 0.88888Output:6.0000 1.0000",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CH3D",
  "scraped_at": "2025-08-17 00:33:06"
}