{
  "problem_code": "problems",
  "title": "Galactic Import",
  "tags": [],
  "text": "With the introduction of the new ThrustoZoom gigadimensional drive, it\r\nhas become possible for HyperCommodities, the import/export\r\nconglomerate from New Jersey, to begin trading with even the most\r\nremote galaxies in the universe. HyperCommodities wants to import\r\ngoods from some of the galaxies in the Plural Z sector. Planets\r\nwithin these galaxies export valuable products and raw materials like\r\nvacuuseal, transparent aluminum, digraphite, and quantum steel.\r\nPreliminary reports have revealed the following facts:Each galaxy contains at least one and at most 26 planets. Each\r\nplanet within a galaxy is identified by a unique letter from A to Z.Each planet specializes in the production and export of one good.\r\nDifferent planets within the same galaxy export different goods.Some pairs of planets are connected by hyperspace shipping lines.\r\nIf planets A and B are connected, they can trade goods freely. If\r\nplanet C is connected to B but not to A, then A and C can still trade\r\ngoods with each other through B, but B keeps 5% of the shipment as a\r\nshipping fee. (Thus A only receives 95% of what C shipped, and C\r\nreceives only 95% of what A shipped.) In general, any two planets can\r\ntrade goods as long as they are connected by some set of shipping\r\nlines, but each intermediate planet along the shipping route keeps 5%\r\nof what it shipped (which is not necessarily equal to 5% of the\r\noriginal shipment).At least one planet in each galaxy is willing to open a\r\nThrustoZoom shipping line to Earth. A ThrustoZoom line is the same as\r\nany other shipping line within the galaxy, as far as business is\r\nconcerned. For example, if planet K opens a ThrustoZoom line to\r\nEarth, then the Earth can trade goods freely with K, or it can trade\r\ngoods with any planet connected to K, subject to the usual shipping\r\nfees.HyperCommodities has assigned a relative value (a positive real number\r\nless than 10) to each planet's chief export. The higher the number,\r\nthe more valuable the product. More valuable products can be resold\r\nwith a higher profit margin in domestic markets. The problem is to\r\ndetermine which planet has the most valuable export when shipping fees\r\nare taken into account.The input consists of one or more galaxy descriptions. Each galaxy\r\ndescription begins with a line containing an integerNwhich\r\nspecifies the number of planets in the galaxy. The nextNlines\r\ncontain descriptions of each planet, which consist of:The letter used to represent the planet.A space.The relative value of the planet's export, in the formd.dd.A space.A string containing letters and/or the character '*'; a letter\r\nindicates a shipping line to that planet, and a '*' indicates a\r\nwillingness to open a ThrustoZoom shipping line to Earth.For each galaxy description, output a single line which reads \"Import\r\nfrom P\" where P is the letter of the planet with the most valuable\r\nexport, once shipping fees have been taken into account. (If more\r\nthan one planet have the same most valuable export value then output\r\nthe plant which is alphabetically first).A sample input file is shown here:1\r\nF 0.81 *\r\n5\r\nE 0.01 *A\r\nD 0.01 A*\r\nC 0.01 *A\r\nA 1.00 EDCB\r\nB 0.01 A*\r\n10\r\nS 2.23 Q*\r\nA 9.76 C\r\nK 5.88 MI\r\nE 7.54 GC\r\nM 5.01 OK\r\nG 7.43 IE\r\nI 6.09 KG\r\nC 8.42 EA\r\nO 4.55 QM\r\nQ 3.21 SOThe following output file should be produced from the above sample input:Import from F\r\nImport from A\r\nImport from A",
  "sample_input": "1\r\nF 0.81 *\r\n5\r\nE 0.01 *A\r\nD 0.01 A*\r\nC 0.01 *A\r\nA 1.00 EDCB\r\nB 0.01 A*\r\n10\r\nS 2.23 Q*\r\nA 9.76 C\r\nK 5.88 MI\r\nE 7.54 GC\r\nM 5.01 OK\r\nG 7.43 IE\r\nI 6.09 KG\r\nC 8.42 EA\r\nO 4.55 QM\r\nQ 3.21 SO",
  "sample_output": "Import from F\r\nImport from A\r\nImport from A",
  "link": "https://www.spoj.com/problems/IMPORT",
  "scraped_at": "2025-08-17 00:33:23"
}