{
  "problem_code": "problems",
  "title": "Basically Speaking",
  "tags": [],
  "text": "The Really Neato Calculator Company, Inc. has recently hired your team\r\nto help design their Super Neato Model I calculator.  As a computer\r\nscientist you suggested to the company that it would be neato if this\r\nnew calculator could convert among number bases.  The company thought\r\nthis was a stupendous idea and has asked your team to come up with the\r\nprototype program for doing base conversion.  The project manager of\r\nthe Super Neato Model I calculator has informed you that the\r\ncalculator will have the following neato features:It will have a 7-digital display.Its buttons will include the capital letters A through F in addition\r\nto the digits 0 through 9.It will support bases 2 through 16.The input for your prototype program will consist of one base\r\nconversion per line.  There will be three numbers per line.  The first\r\nnumber will be the number in the base you are converting from.  The\r\nsecond number is the base you are converting from.  The third number\r\nis the base you are converting to.  There will be one or more blanks\r\nsurrounding (on either side of) the numbers.  There are several lines\r\nof input and your program should continue to read until the end of\r\nfile is reached.The output will only be the converted number as it would appear on the\r\ndisplay of the calculator.  The number should be right justified in\r\nthe 7-digit display.  If the number is to large to appear on the\r\ndisplay, then print ``ERROR'' (without the quotes) right justified in\r\nthe display.A sample input file is shown here:1111000  2 10\r\n1111000  2 16\r\n2102101  3 10\r\n2102101  3 15\r\n  12312  4  2\r\n     1A 15  2\r\n1234567 10 16\r\n   ABCD 16 15The following output file should be produced from the above sample\r\ninput:120\r\n     78\r\n   1765\r\n    7CA\r\n  ERROR\r\n  11001\r\n 12D687\r\n   D071",
  "sample_input": "1111000  2 10\r\n1111000  2 16\r\n2102101  3 10\r\n2102101  3 15\r\n  12312  4  2\r\n     1A 15  2\r\n1234567 10 16\r\n   ABCD 16 15",
  "sample_output": "120\r\n     78\r\n   1765\r\n    7CA\r\n  ERROR\r\n  11001\r\n 12D687\r\n   D071",
  "link": "https://www.spoj.com/problems/BASE",
  "scraped_at": "2025-08-17 00:33:04"
}