{
  "problem_code": "problems",
  "title": "Index Generation",
  "tags": [],
  "text": "Most nonfiction and reference books have anindexto help\r\nreaders find references to specific terms or concepts in the text.  Here\r\nis a sample index.larch, 4, 237, 238, 414\r\n+ Monty Python and, 64, 65, 66\r\n+ planting of, 17\r\nLenny Kravitz, 50\r\n+ going his way, 53\r\nlumbago, 107\r\nmango\r\n+ Chris Kattan, 380\r\n+ storage of, 87, 90\r\n+ use in Nethack, 500, 501\r\n+ Vitamin C content, 192Each index entry contains aprimary entryfollowed by zero or\r\nmoresecondary entries, which begin with a '+'.  Entries will\r\nnormally be followed by a list of page references, but a primary entry\r\nmight not be if at least one secondary entry is present (as is the case\r\nwithmango, above).  Primary entries are sorted, and secondary\r\nentries following a primary entry are also sorted. Sorting is\r\ncase-insensitive.  Page references for an entry are in ascending order\r\nand do not include duplicates. (A duplicate could occur if there are two\r\nor more identical entries on the same page.)Your task is to read a document that has index information embedded\r\nwithin it and produce the index.  Documents consist of one or more\r\nlines of ASCII text. The page number starts at 1, and the character\r\n'&' indicates the start of a new page (which adds 1 to the current\r\npage number).  Index entries are indicated by amarker, which in\r\nits most elaborate form has the following syntax:{text%primary$secondary}Heretextis the text to be indexed,primaryis an\r\nalternative primary entry, andsecondaryis a secondary entry.\r\nBoth '%primary' and '$secondary' are optional,\r\nbut if\r\nboth are present they must appear in the order given.  Ifprimaryis present then it is used as the primary entry, and if not thentextis used as the primary entry.  Ifsecondaryis present then\r\nthe marker adds a page reference for that secondary entry; otherwise it\r\nadds a page reference for the primary entry.  A single marker cannot\r\nadd a page reference for both a primary and secondary entry. Here are\r\nexamples of each of the four possible types of marker, which correspond\r\nto four of the entries in the sample index above.... his {lumbago} was acting up, so ...\r\n... {Lenny%Lenny Kravitz} lit up the crowd with his version of ...\r\n... Monty Python often used the {larch$Monty Python and} in ...\r\n... when storing {mangos%mango$storage of}, be sure to ...The input consists of one or more documents, followed by a line\r\ncontaining only '**' that signals the end of the input.  Documents are\r\nimplictly numbered starting with 1. Each document consists of one or\r\nmore lines of text followed by a line containing only '*'.  Each line\r\nof text will be at most 79 characters long, not counting end-of-line\r\ncharacters.  For documenti, output the line 'DOCUMENTi' followed\r\nby the sorted index using the exact output format shown in the\r\nexamples.Be sure to readNotes to Teams,\r\nwhich has general formatting\r\nguidelines that pertain to all problem input files, including this one.\r\nAlso note:A document will contain at most 100 markers,\r\nwith at most 20 primary entries.A primary entry will have at most 5 secondary entries.An entry will have at most 10 unique page references (not including \r\n        duplicates).The character '&' will not appear anywhere within a marker, and\r\nwill appear at most 500 times within a document.The character '*' is used only to signal the end of a document or\r\nthe end of the input.The characters '{', '}', '%', and '$' will only be used to\r\ndefine markers, and will not appear in any text or entries.A marker may span one or more lines.  Every end-of-line within a\r\nmarker must be converted to a single space.A space within a marker (including a converted end-of-line) is\r\nnormally included in the text/entry, just like any other character.\r\nHowever, any space that immediately follows '{', \r\nimmediately precedes '}', or is immediately adjacent to '%' or '$' \r\nmust be ignored.The total length of a marker, measured from the opening '{' to \r\nthe closing '}', and in which all embedded end-of-lines are converted\r\nto spaces, will be at most 79 characters.Input:Call me Ishmael.\r\n*\r\nOne {fish $unary}, two {fish$ binary},&red {fish $ scarlet}, blue {fish$\r\nazure}. & By { Dr. Seuss }.\r\n*\r\nThis is a {simple } & & { document} that &{\r\nsimply %simple\r\n$adverb\r\n} & {illustrates %vision} &&&&& one {simple-minded% simple} {Judge}'s {vision} \r\nfor what a {document } might { look % vision} like.\r\n*\r\n**Output:DOCUMENT 1\r\nDOCUMENT 2\r\nDr. Seuss, 3\r\nfish\r\n+ azure, 2\r\n+ binary, 1\r\n+ scarlet, 2\r\n+ unary, 1\r\nDOCUMENT 3\r\ndocument, 3, 10\r\nJudge, 10\r\nsimple, 1, 10\r\n+ adverb, 4\r\nvision, 5, 10",
  "sample_input": "larch, 4, 237, 238, 414\r\n+ Monty Python and, 64, 65, 66\r\n+ planting of, 17\r\nLenny Kravitz, 50\r\n+ going his way, 53\r\nlumbago, 107\r\nmango\r\n+ Chris Kattan, 380\r\n+ storage of, 87, 90\r\n+ use in Nethack, 500, 501\r\n+ Vitamin C content, 192",
  "sample_output": "... his {lumbago} was acting up, so ...\r\n... {Lenny%Lenny Kravitz} lit up the crowd with his version of ...\r\n... Monty Python often used the {larch$Monty Python and} in ...\r\n... when storing {mangos%mango$storage of}, be sure to ...",
  "link": "https://www.spoj.com/problems/INDEXGEN",
  "scraped_at": "2025-08-17 00:33:14"
}