{
  "problem_code": "problems",
  "title": "Mark",
  "tags": [],
  "text": "Mark-up languages are computer languages that assist in the formatting\r\nof text files. Special keywords are used to mark the text to allow\r\ncontrol of fonts, page styles, paragraph styles, etc. TeX, troff,\r\nand HTML are examples of mark-up languages.Spell checking can be difficult to adapt to these special texts. In\r\ngeneral, special processors or spell checkers must be created in order\r\nto accommodate mark-up languages. A special processor would recognize\r\nthe mark-up language and strip it from the text so that the \"plain\"\r\ntext could then be processed by a spell checker. For this problem,\r\nyou are to write such a processor for a small mark-up language so\r\nthat the output of your program will be the plain text without the\r\nmark-ups.The mark-up language to consider is one which allows the modification\r\nof fonts within the text. Each markup command will be preceded by a\r\n\\ character. If the letter following the \\ \r\ncharacter is not a recognized command from the table below then the\r\ncharacter following the \\ is printed as part of the plain\r\ntext. For instance, the mark-up \\\\ can be used to print\r\na single \\.\\btoggle bold font on/off (default state is off)\\itoggle italics font on/off (default state is off)\\sset font size; the s is immediately followed by an\r\noptional number; if the number is missing then the command will\r\nrestore the previous size\\*toggle processing of mark-ups on/off; if\r\nprocessing is toggle off then mark-ups are considered to be literal\r\ntext (default state is on)The number following the \\s command can have a decimal\r\npoint so 12, 9.5, 11., and .5 should all be recognized as valid\r\nnumbers.The input file will be plain text containing mark-ups from the\r\nlanguage above. At the start, processing of mark-ups should be on.\r\nThe file should be processed until the end-of-file is encountered.A sample input file is shown here:\\s18.\\bMARKUP sample\\b\\s\r\n\r\n\\*For bold statements use the \\b command.\\*\r\n\r\nIf you wish to \\iemphasize\\i something use the \\\\i command.\r\n\r\nFor titles use \\s14BIG\\s font sizes, 14 points usually works well.\r\n\r\nRemember that all of the commands toggle except for the \\\\s command.The following output file should be produced from the above sample input:MARKUP sample\r\n\r\nFor bold statements use the \\b command.\r\n\r\nIf you wish to emphasize something use the \\i command.\r\n\r\nFor titles use BIG font sizes, 14 points usually works well.\r\n\r\nRemember that all of the commands toggle except for the \\s command.",
  "sample_input": "\\s18.\\bMARKUP sample\\b\\s\r\n\r\n\\*For bold statements use the \\b command.\\*\r\n\r\nIf you wish to \\iemphasize\\i something use the \\\\i command.\r\n\r\nFor titles use \\s14BIG\\s font sizes, 14 points usually works well.\r\n\r\nRemember that all of the commands toggle except for the \\\\s command.",
  "sample_output": "MARKUP sample\r\n\r\nFor bold statements use the \\b command.\r\n\r\nIf you wish to emphasize something use the \\i command.\r\n\r\nFor titles use BIG font sizes, 14 points usually works well.\r\n\r\nRemember that all of the commands toggle except for the \\s command.",
  "link": "https://www.spoj.com/problems/MARKUP",
  "scraped_at": "2025-08-17 00:33:07"
}