{
  "problem_code": "problems",
  "title": "Intergalactic Map",
  "tags": [],
  "text": "Jedi knights, Qui-Gon Jinn and his young apprentice Obi-Wan Kenobi, are entrusted by Queen Padmé Amidala\r\nto saveNaboofrom an invasion by the Trade Federation. They must leave Naboo immediately and go toTatooineto pick up the proof of the Federation’s evil design. They then must proceed on to the Republic’s capital\r\nplanetCoruscantto produce it in front of the Republic’s Senate. To help them in this endeavor, the queen’s captain provides them with an intergalactic map. This map shows connections between planets not yet blockaded by the Trade Federation. Any pair of planets has at most one connection between them, and all the connections are two-way. To avoid detection by enemy spies, the knights must embark on this adventure without visiting any planet more than once. Can you help them by determining if such a path exists?Note- In the attached map, the desired path is shown in bold.InputThe first line of the input is a positive integer t ≤ 20, which is the number of test cases. The descriptions\r\nof the test cases follow one after the other. The first line of each test case is a pair of positive integers\r\nn, m (separated by a single space). 2 ≤ n ≤ 30011 is the number of planets and m ≤ 50011 is the number of connections\r\nbetween planets. The planets are indexed with integers from 1 to n. The indices of Naboo, Tatooine and Coruscant\r\nare 1, 2, 3 respectively. The next m lines contain two integers each, giving pairs of planets that have a\r\nconnection between them.OutputThe output should contain t lines. The ithline corresponds to the ithtest case.\r\nThe output for each test case should beYESif the required path exists andNOotherwise.ExampleInput:2\r\n3 3\r\n1 2\r\n2 3\r\n1 3\r\n3 1\r\n1 3Output:YES\r\nNO",
  "sample_input": "Input:2\r\n3 3\r\n1 2\r\n2 3\r\n1 3\r\n3 1\r\n1 3Output:YES\r\nNO",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/IM",
  "scraped_at": "2025-08-17 00:33:12"
}