{
  "problem_code": "problems",
  "title": "Free Tour",
  "tags": [],
  "text": "In order to celebrate the 2nd anniversary of Travel Agent SPOJ (Safe – Professional – hOspitable – Joyful), the management intend to hold free tours around cities for clients to make them more satisfied with SPOJ.A tour is a simple cycle, starting at any city (called a source-city) visits some other cities (each city must be visited at most once) and then returns to the source-city. The number of roads in the tour should be an even number because we are celebrating a 2nd anniversary, and 2 is even! Since many tours in different areas of the country are planned, the cost of organising them could turn out quite high. Hence, the management of SPOJ hope to find at least one 'reasonable' tour, which should have as small a number of roads as possible.You're given maps of the areas where SPOJ wants to hold free tours. For each map, help them figure out a reasonable tour.InputThe first line of input contains an integert, the number of maps (t≤ 5).tmaps follow.For each map:In the first line there are 2 integersN– number of cities in that area,M– number of roads (1 ≤N≤ 8000, 0 ≤M≤ 10000)In the nextMlines, the i-th line describes the i-th road: a line with two integersa bdenotes a bidirectional road between cityaand citybThere is one blank line between successive tests.OutputFor each map, if there is no tour satisfying the conditions, write \"-1\" (without quotes). Otherwise, write one integer representing the number of roads in a reasonable tour, and in the next line show out the tour with form \"source-city a b c ... source-city\", that means the tour is source-city → city a → city b → … → source-city. If there are many tours satisfy in each map, any of them will be accepted.ExampleInput:2\r\n\r\n3 3\r\n1 2 \r\n2 3\r\n3 1\r\n\r\n4 4\r\n1 2\r\n2 3\r\n3 4\r\n4 1Output:-1\r\n4\r\n1 2 3 4 1",
  "sample_input": "Input:2\r\n\r\n3 3\r\n1 2 \r\n2 3\r\n3 1\r\n\r\n4 4\r\n1 2\r\n2 3\r\n3 4\r\n4 1Output:-1\r\n4\r\n1 2 3 4 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/FTOUR",
  "scraped_at": "2025-08-17 00:33:10"
}