{
  "problem_code": "problems",
  "title": "Continuous Fractions Again",
  "tags": [],
  "text": "A simple continuous fraction has the form:where the ai’s are integer numbers.The previous continuous fraction could be noted as [a1, a2, ..., an]. It is not difficult to show that any rational number p / q, with integers p > q > 0, can be represented in a unique way by a simple continuous fraction with n terms, such that p / q = [a1, a2, ..., an−1, 1], where n and the ai’s are positive natural numbers.Now given a simple continuous fraction, your task is to calculate a rational number which the continuous fraction most corresponds to it.InputInput for each case will consist of several lines. The first line is two integer m and n, which describe a char matrix, then followed m lines, each line cantain n chars.\r\nThe char matrix describe a continuous fraction The continuous fraction is described by the following rules:Horizontal bars are formed by sequences of dashes '-'.The width of each horizontal bar is exactly equal to the width of the denominator under it.Blank characters should be printed using periods '.'The number on a fraction numerator must be printed center justified. That is, the number of spaces at either side must be same, if possible; in other case, one more space must be added at the right side.The end of the input is indicated by a line containing 0 0.OutputOutput will consist of a series of cases, each one in a line corresponding to the input case. A line describing a case contains p and q, two integer numbers separated by a space, and you can assume that 10^20 > p > q > 0.ExampleInput:9 17\r\n..........1......\r\n2.+.-------------\r\n............1....\r\n....4.+.---------\r\n..............1..\r\n........1.+.-----\r\n................1\r\n............5.+.-\r\n................1\r\n5 10\r\n......1...\r\n1.+.------\r\n.........1\r\n....11.+.-\r\n.........1\r\n0 0Output:75 34\r\n13 12",
  "sample_input": "Input:9 17\r\n..........1......\r\n2.+.-------------\r\n............1....\r\n....4.+.---------\r\n..............1..\r\n........1.+.-----\r\n................1\r\n............5.+.-\r\n................1\r\n5 10\r\n......1...\r\n1.+.------\r\n.........1\r\n....11.+.-\r\n.........1\r\n0 0Output:75 34\r\n13 12",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CFRAC2",
  "scraped_at": "2025-08-17 00:33:04"
}