{
  "problem_code": "problems",
  "title": "Paint By Numbers",
  "tags": [],
  "text": "Years ago, there was a really bad craft/hobby calledpaint-by-numbers: you were given a line drawing, with numbers in each enclosed region, and the number corresponded to a particular colour. An example is shown below (unsolved on the left; solved on the right):(images fromThisLife.org)The problem you have to solve is much more linear, in a way.You will be given ann-by-mgrid (1 ≤n, m≤ 32) which you will \"colour\" in with either a dot ('.') or a star ('*').Of course, the grid will not be specified in the usual paint-by-numbers way, since this would be too easy.Instead, you will you have to infer which cells are blank and which contain a star. The only information you will be given are a collection ofn + msequences of numbers, one sequence for each row and column. The sequence will indicate the size of each continuous block of stars. There must be at least one dot between two consecutive blocks of stars.An example is shown below (which is supposed to look fish-like):You may notice that some paint-by-number patterns are not uniquely solvable. For this problem, you may assume thatanysolution which satisfies the specification is correct.InputInput begins with a line with the number of test cases. Each test case consists of a total ofn + m+ 2 lines. The first line of the test case consists of an integern(1 ≤n≤ 32), the number of rows. The second line consists of an integerm(1 ≤m≤ 32), the number of columns. On the nextnlines, there will be sequences which describe each of thenrows (from top to bottom). Each line will contain some positive integers, with a space between adjacent integers, and the sequence will terminate with the integer 0. On the nextmlines describe themcolumns (from left to right), the same format as the rows are specified.OutputOutput consists ofnlines for each corresponding test case, each line composed ofmcharacters, where each character is either a dot ('.') or a star ('*'). Separate test cases with a blank line.ExampleInput:2\r\n4\r\n7\r\n2 2 0\r\n5 0\r\n5 0\r\n2 2 0\r\n1 1 0\r\n1 1 0\r\n2 0\r\n2 0\r\n4 0\r\n4 0\r\n2 0\r\n4\r\n4\r\n2 1 0\r\n3 0\r\n3 0\r\n1 1 0\r\n4 0\r\n3 0\r\n3 0\r\n1 0Output:**..**.\r\n..*****\r\n..*****\r\n**..**.\r\n\r\n**.*\r\n***.\r\n***.\r\n*.*.",
  "sample_input": "Input:2\r\n4\r\n7\r\n2 2 0\r\n5 0\r\n5 0\r\n2 2 0\r\n1 1 0\r\n1 1 0\r\n2 0\r\n2 0\r\n4 0\r\n4 0\r\n2 0\r\n4\r\n4\r\n2 1 0\r\n3 0\r\n3 0\r\n1 1 0\r\n4 0\r\n3 0\r\n3 0\r\n1 0Output:**..**.\r\n..*****\r\n..*****\r\n**..**.\r\n\r\n**.*\r\n***.\r\n***.\r\n*.*.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PNTBYNUM",
  "scraped_at": "2025-08-17 00:33:23"
}