{
  "problem_code": "problems",
  "title": "Candies and Milestones",
  "tags": [],
  "text": "Little Pratya loves collecting candies and she also likes playing games :).Today Pratya is travelling in bus and she has a bag full ofNcandies. She looks outside the window and notices milestones with numbers written on them. She decides to play a game. She wants to select some initialnon-zeronumber of candies from the bag and call it her collection of candies. When she sees a milestone on the way, she will add or remove some candies from her collection as following.Let the previous milestone number bea1and the current milestone number bea2.a2 > a1: Pratya adds (a2 - a1) candies to her collection (thus, her bag of candies loses them). If the bag doesn't contain at least (a2 - a1) candies, she starts crying.a2 < a1: Pratya removes (a1 - a2) candies from her collection (thus, her bag of candies gains them). If her collection doesn't contain more than (a1 - a2) candies, she starts crying.a1 = a2: Pratya is bored to see the same number again and so she eats one of the candies from her collection.Moreover, Pratya always wants her candy collection to have at least one candy, otherwise she starts crying. Given the numbers written on all the milestones in order, find the minimum number of candies Pratya should select in the beginning so that she doesn't have to cry at all. If it is not possible, print -1. Note that no change to the collection happens when she sees the first milestone.InputThe first line contain the number of test casesT. Each test case has two lines. The first line specifiesNandM.Nis the number of candies in the bag andMis the total number of milestones. Second line containsMintegers, the numbers written on the milestones, in the order Pratya sees them.T ≤ 1501 ≤ N ≤ 1072 ≤ M ≤ 104Each milestone number will be between [-106, 106].OutputFor each test case output the minimum number of candies that should be selected from the bag or -1 if its not possible.ExampleInput:310 51 5 1 -1 -22 51 5 1 -1 -2100 31 2 3Output:4-11Note : Large input, prefer using scanf / printf  to  cin / cout* There are multiple test sets, and the judge shows thesumof the time taken over all test sets of your submission, if Accepted.",
  "sample_input": "Input:310 51 5 1 -1 -22 51 5 1 -1 -2100 31 2 3Output:4-11",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CANDYSTN",
  "scraped_at": "2025-08-17 00:33:22"
}