{
  "problem_code": "problems",
  "title": "Permutation Game",
  "tags": [],
  "text": "Harsha is given 9 integers a1, a2, a3... a9. This denotes that he is given a11's, a22's ... a99's. Let 'x' = (a1+ a2+ ... a9). Now, Harsha makes all possible 'x' digit numbers by using these given digits. Let S be the set of all such numbers which he makes. Now he constructs a directed graph containing |S| nodes, in which each node denotes a unique number from the set. For all numbers u, v belonging to S, there is a directed edge from node 'u' to node 'v in the graph iff u > v. It is easy to note that we obtain a directed acyclic graph. What's more, the edges of the graph are weighted. The weight of an edge joining node 'u' and node 'v' is equal to u + v. Now, Deepak decides to test Harsha's memory and gives him 'Q' queries. Each query consists of two numbers 'u', 'v' (u > v, both belonging to the set S). For each query Harsha must provide the following answers:How many distinct paths are there from node 'u' to node 'v' in the graph.For each distinct path 'i' from node 'u' to node 'v', let Sidenote the sum of weights of all edges on this path. Calculate the value of sum(Si), for every distinct path 'i' from node 'u' to node 'v'.InputThe first line of input contains 9 integers a1, a2... a9. The second line contains a single integer 'Q', denoting the number of queries. Each of the next 'Q' lines contain 2 numbers 'u' and 'v'.OutputFor each query, output two space separated integers denoting the number of distinct paths and sum of weights of all paths respectively. Since the output can be large, output these quantities modulo 1000000007.Two paths (v1, v2... vm) and (u1, u2... un) are distinct if:m ≠ nm = n, there exists some index 'k' (1 ≤ k ≤ m) such that vk≠ ukConstraints1 ≤ (a1+ a2+ ... a9) ≤ 5001 ≤ Q ≤ 20ai≥ 0ExampleInput:2 0 1 0 0 0 0 0 0\r\n1\r\n311 113Output:2 1110ExplanationTest case 1: The set S for the above problem is {311, 113, 131}. The edges of the graph are 311→131, 311→113, 131→113. There are two distinct paths from 311 to 113, namely (311→131→113) and (311→113). The sum of weights of edges on path-1 = (311 + 131) + (131 + 113) = 686. For path-2, the sum of weights of edges = (311 + 113) = 424. Therefore, answer = 686 + 424 = 1110.",
  "sample_input": "Input:2 0 1 0 0 0 0 0 0\r\n1\r\n311 113Output:2 1110",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BTCODE_I",
  "scraped_at": "2025-08-17 00:33:05"
}