{
  "problem_code": "problems",
  "title": "Grid Tiling",
  "tags": [],
  "text": "Vikas is the chief interior designer in charge of the Taj Palace, Mumbai. He wants to make an impressive and colourful pattern in the courtyard. Importing exotic tiles has become very difficult after the Mumbai terror attacks, and therefore Vikas has only 4 kinds of tiles to choose from:A     B     C    D\r\n==    ==    ==   ==\r\nXX    X     X    X\r\nXX    X     XXAny rotation of above tiles is also permitted.Each tile is available in 'k' different colors, and there's an infinite supply of all tiles. The courtyard has dimensions 2 × 'n'. Vikas wants to tile the courtyard in such a way that no two adjacent tiles have the same color. Two tiles are considered adjacent if they share a common side. Two tilings are considered different if:The arrangement of tiles is different.There is at least 1 position (1*1 square) which has different colors in the two arrangements.Can you help Vikas find the number of different ways in which he can tile the courtyard, subject to the above conditions?InputThe first line of input contains a single integer 't', denoting the number of test cases.Each of the next 't' lines contains 2 space separated integers 'n' and 'k'.OutputFor each test case output one integer, denoting the number of different ways in which the courtyard can be tiled.Two tiles are considered adjacent if they share an edge. Two tiles which just share a common point are not considered adjacent.Since the answers can be large, print all the quantities modulo 1000000007.Constraints:t ≤ 10001 ≤ n ≤ 1091 ≤ k ≤ 1000ExampleInput:2\r\n1 1\r\n1 2Output:1\r\n4Explanation:Test case 1: There is only 1 way to tile the courtyard, by using a 2×1 tile.Test case 2: Let '1' and '2' be the available colors. The grid can be tiled in 4 ways:place one 2×1 tile of color '1',place one 2×1 tile of color '2',place two 1×1 tiles (color '1' above and color '2' below),place two 1×1 tiles (color '2' above and color '1' below)",
  "sample_input": "A     B     C    D\r\n==    ==    ==   ==\r\nXX    X     X    X\r\nXX    X     XX",
  "sample_output": "Input:2\r\n1 1\r\n1 2Output:1\r\n4",
  "link": "https://www.spoj.com/problems/BTCODE_J",
  "scraped_at": "2025-08-17 00:33:08"
}