{
  "problem_code": "problems",
  "title": "Separate Points",
  "tags": [],
  "text": "Numbers of black and white points are placed on a plane. Let’s imagine that a straight line of inﬁnite length is drawn on the plane. When the line does not meet any of the points, the line divides these points into two groups. If the division by such a line results in one group consisting only of black points and the other consisting only of white points, we say that the line “separates black and white points”.Let’s see examples in the figure below. In the leftmost example, you can easily ﬁnd that the black and white points can be perfectly separated by the dashed line according to their colors. In the remaining three examples, there exists no such straight line that gives such a separation.In this problem, given a set of points with their colors and positions, you are requested to decide whether there exists a straight line that separates black and white points.InputThe input is a sequence of datasets, each of which is formatted as follows.n mx1y1...xnynxn+1yn+1...xn+myn+mThe ﬁrst line contains two positive integers separated by a single space;nis the number of black points, andmis the number of white points. They are less than or equal to 100. Thenn+mlines representing the coordinates of points follow. Each line contains two integers xiand yiseparated by a space, where (xi, yi) represents the x-coordinate and the y-coordinate of the i-th point. The color of the i-th point is black for1 ≤ i ≤ n, and is white forn + 1 ≤ i ≤ n + m. All the points have integral x- and y-coordinate values between 0 and 10000 inclusive. You can also assume that no two points have the same position.The end of the input is indicated by a line containing two zeros separated by a space.OutputFor each dataset, output “YES” if there exists a line satisfying the condition. If not, output “NO”. In either case, print it in one line for each input dataset.ExampleInput:3 3100 700200 200600 600500 100500 300800 5003 3100 300400 600400 100600 400500 900300 3003 4300 300500 300400 600100 100200 900500 900800 1001 2300 300100 100500 5001 1100 100\r\n200 1002 20 0500 7001000 14001500 21002 20 01000 10001000 00 10003 30 1004999 10210000 1035001 10210000 1020 1013 3100 100200 100100 2000 0400 00 4003 32813 16402583 28922967 1916541 35629298 36867443 79210 0Output:YESNONONOYESYESNONONOYES",
  "sample_input": "Input:3 3100 700200 200600 600500 100500 300800 5003 3100 300400 600400 100600 400500 900300 3003 4300 300500 300400 600100 100200 900500 900800 1001 2300 300100 100500 5001 1100 100\r\n200 1002 20 0500 7001000 14001500 21002 20 01000 10001000 00 10003 30 1004999 10210000 1035001 10210000 1020 1013 3100 100200 100100 2000 0400 00 4003 32813 16402583 28922967 1916541 35629298 36867443 79210 0Output:YESNONONOYESYESNONONOYES",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SPOINTS",
  "scraped_at": "2025-08-17 00:33:16"
}