{
  "problem_code": "problems",
  "title": "Twenty Questions",
  "tags": [],
  "text": "Consider a closed world and a set of features that are deﬁned for all the objects in the world. Each feature can be answered with “yes” or “no”. Using those features, we can identify any object from the rest of the objects in the world. In other words, each object can be represented as a ﬁxed-length sequence of booleans. Any object is diﬀerent from other objects by at least one feature.You would like to identify an object from others. For this purpose, you can ask a series of questions to someone who knows what the object is. Every question you can ask is about one of the features. He/she immediately answers each question with “yes” or “no” correctly. You can choose the next question after you get the answer to the previous question.You kindly pay the answerer 100 yen as a tip for each question. Because you don’t have surplus money, it is necessary to minimize the number of questions in the worst case. You don’t know what is the correct answer, but fortunately know all the objects in the world. Therefore, you can plan an optimal strategy before you start questioning.The problem you have to solve is: given a set of boolean-encoded objects, minimize the maximum number of questions by which every object in the set is identiﬁable.InputThe input is a sequence of multiple datasets. Each dataset begins with a line which consists of two integers,mandn: the number of features, and the number of objects, respectively. You can assume 0 <m≤ 11 and 0 <n≤ 128. It is followed by n lines, each of which corresponds to an object. Each line includes a binary string of length m which represent the value (“yes” or “no”) of features. There are no two identical objects.The end of the input is indicated by a line containing two zeros.OutputFor each dataset, minimize the maximum number of questions by which every object is identiﬁable and output the result.ExampleInput:8 11101010111 40011100110001001101011010100000110110011000111 160100010111101011000000010111110010110110100101110010111011101001111000000101010010001000100101101001010001010010101010110101101000101100101001111011001001111110001111111101110111 121000000000001000000000001000000000001000000000001000000000001000000000001000000000001000000000001000000000001000000000001000000000009 320010000000001000000000100000000010000000001000000000100000000010000000000110000000101000000100100000100010000100001000100000100100000010100000001010000001001000001000100001000010001000001001000000101000000011000000001110000001101000001100100001100010001100001001100000101100000011100000000 0Output:024119",
  "sample_input": "Input:8 11101010111 40011100110001001101011010100000110110011000111 160100010111101011000000010111110010110110100101110010111011101001111000000101010010001000100101101001010001010010101010110101101000101100101001111011001001111110001111111101110111 121000000000001000000000001000000000001000000000001000000000001000000000001000000000001000000000001000000000001000000000001000000000009 320010000000001000000000100000000010000000001000000000100000000010000000000110000000101000000100100000100010000100001000100000100100000010100000001010000001001000001000100001000010001000001001000000101000000011000000001110000001101000001100100001100010001100001001100000101100000011100000000 0Output:024119",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TWENTYQ",
  "scraped_at": "2025-08-17 00:33:21"
}