{
  "problem_code": "problems",
  "title": "Anti",
  "tags": [],
  "text": "Jimmy is a hard-working pupil in his second year at primary \r\nschool. Recently he decided to convert all his notes into an\r\nelectronic version. Sadly, he found that \r\nhis math notes were full of ink blots.He scanned the notes and sent them through his own OCR package\r\n(yes, he coded it all by himself at the age of 8).\r\nThe OCR package replaced all ink blots by the string \"machula\".Problem specificationYou are given Jimmy's notes, processed by the OCR. They contain simple \r\nmath exercises, which were used to practice addition on positive integers. \r\nYour task is to recover the damaged part of the notes.Input specificationThe first line of the input file contains an integerTspecifying the\r\nnumber of test cases. Each test case is preceded by a blank line.Each test case consists of exactly one line. \r\nThe line represents an equation of the form \"number + number = number\",\r\nwhere eachnumberis a positive integer. \r\nOne part of the equation will be replaced by the string \"machula\".\r\nThe string always covers a contiguous non-empty sequence of digits, possibly even an entire\r\nnumber. You may assume that for each equation in the input there will be \r\nexactly one way to fill in the missing digits.Output specificationFor each test case, the output shall contain one line of the form \r\n\"number + number = number\". The line must represent the equation\r\nfrom that test case with all missing digits filled in.ExampleInput:3\r\n\r\n23 + 47 = machula\r\n\r\n3247 + 5machula2 = 3749\r\n\r\nmachula13 + 75425 = 77038Output:23 + 47 = 70\r\n3247 + 502 = 3749\r\n1613 + 75425 = 77038Note:intin C++/C/Java orlongintin Pascal is enough.",
  "sample_input": "Input:3\r\n\r\n23 + 47 = machula\r\n\r\n3247 + 5machula2 = 3749\r\n\r\nmachula13 + 75425 = 77038Output:23 + 47 = 70\r\n3247 + 502 = 3749\r\n1613 + 75425 = 77038",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ABSYS",
  "scraped_at": "2025-08-17 00:33:11"
}