{
  "problem_code": "problems",
  "title": "Kruskal",
  "tags": [],
  "text": "A three-headed monkey was on his (theirs?) peaceful way from his dorm to the university. He decided to use the subway. But as soon as he descended into the station, he was stopped by a strange geek with a flashlight, saying strange words...\"I am a servant of the Secret Group Order, wielder of the flame of Primes. Your limited knowledge of partial derivatives will not avail you, flame of Riemann! You shall not pass! You can't beat Kruskal in his game!\"The three-headed monkey shook his head. The left one. But there was no way out. If he wanted to get to the university in time, he had to play.(Many others in his situation would use the distract-and-run tactics to get past the evil Kruskal into the subway. However, this was not possible in this case : nobody will turn around upon hearing\"Hey! Look behind you! A three-headed monkey!\"when he already sees the monkey in front of him...)So, what was the game about? It is a two-player game. At the beginning there areN(not necessarily equal) heaps of matches. On each turn, a player may only remove matches from one heap only, and he has to remove between 1 andKmatches, inclusive. A player wins if after his move the size of some heap is a prime number. The three-headed monkey moves first.Problem specificationYou will be given several starting positions. For each of them, determine whether the three-headed monkey can win this game. You may assume that Kruskal (the monkey's opponent) plays optimally.Input specificationThe first line of the input file contains an integerTspecifying the number of test cases.Each test case looks as follows: on the first line there are the two integersN(1 ≤N≤ 200) andK(1 ≤K≤ 100), separated by a single space.Nlines follow, one for each heap of matches. Thei-th of these lines contains a single integerai(3 ≤ai< 232) giving the number of matches on thei-th heap.Output specificationFor each test case output one line. If the monkey can win the game, output the string \"YES\", otherwise output the string \"NO\".ExampleInput:2\r\n\r\n3 3\r\n48\r\n15\r\n4\r\n\r\n2 3\r\n51\r\n51Output:YES\r\nNONote: a somewhat hardtesthas been removed.",
  "sample_input": "Input:2\r\n\r\n3 3\r\n48\r\n15\r\n4\r\n\r\n2 3\r\n51\r\n51Output:YES\r\nNO",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/KRUSKAL",
  "scraped_at": "2025-08-17 00:33:09"
}