{
  "problem_code": "problems",
  "title": "Ambiguous Codes",
  "tags": [],
  "text": "An extensive area of research in computer science is the field of communications. With computer\r\nnetworks being part of everyday life of many people, the development of ways for making\r\nnetworks faster, more reliable and secure is constantly needed. This practical need motivates\r\nan extensive research activity in the theory behind communications.The very first thing needed to establish any kind of communication is a common code. A code\r\nis a way of changing the form of a piece of information into some other form, in general to make\r\nit possible to convey that piece of information from one place to another. Flag codes used by\r\nboats and the Morse code used in telegraphy are examples of codes for translating letters into\r\ndifferent forms to enable communication over different media.More formally, a code is a set of strings composed of symbols from one alphabet. Each string\r\ndefined in the code is called a code word. A message is then composed concatenating a set\r\nof code words to convey the information needed. For example, in Morse code the alphabet is\r\ncomposed of the symbols hyphen and dot; letter “S” is represented by the code word “...”,\r\nletter “O” is represented by the code word “---”, and therefore the distress message “SOS” in\r\nMorse code is “...---...”.Codes for communication can have many desirable and undesirable properties such as ambiguity,\r\nentropy, redundancy, and many more. In this problem we will focus on ambiguity as a key\r\nproperty.A code is ambiguous when there exists a message using that code that can be partitioned into\r\ndifferent sequences of code words. In other words, in an ambiguous code a message may have\r\nmore than one meaning. For example, consider the binary alphabet, composed of symbols\r\n{0, 1}. For the code composed of the words {10, 01, 101} the message 10101 can be understood\r\nas 10-101 or 101-01 and therefore the code is ambiguous. On the other hand, for the code\r\ncomposed of the words {01, 10, 011} no ambiguous message exists and therefore the code is\r\nunambiguous.As a part of the computer science community, you are required to develop a tester that checks\r\nif codes are ambiguous. In case a code is indeed ambiguous, you are also required to report the\r\nlength (i.e. the number of symbols) of the shortest ambiguous message for that code.InputEach test case will consist on several lines. In all test cases the alphabet will be the set of\r\nhexadecimal digits (decimal digits plus the uppercase letters “A” to “F”). The first line of a test\r\ncase will contain an integer N (1 ≤ N ≤ 100), the number of code words in the code. Each\r\nof the next N lines describes a code word and contains a different and non-empty string of at\r\nmost 50 hexadecimal digits.Input is terminated by N = 0.OutputFor each test case, output a single line with the length of the shortest ambiguous message for\r\nthe provided code or -1 if the code is unambiguous.ExampleInput:3\r\n10\r\n01\r\n101\r\n3\r\nAB\r\nBA\r\nABB\r\n0Output:5\r\n-1",
  "sample_input": "Input:3\r\n10\r\n01\r\n101\r\n3\r\nAB\r\nBA\r\nABB\r\n0Output:5\r\n-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/AMCODES",
  "scraped_at": "2025-08-17 00:33:25"
}