{
  "problem_code": "problems",
  "title": "Emoticons",
  "tags": [],
  "text": "Emoticons are used in chat and e-mail conversations to try to express the emotions that printed\r\nwords cannot. This may seem like a nice feature for many, but a lot of people find it really\r\nannoying and wants to get rid of emoticons.George is one of those people. He hates emoticons so bad, that he is preparing a plan to\r\nremove all emoticons from all e-mails in the world. Since you share his visionary plans, you are\r\npreparing a special program to help him.Your program will receive the list of emoticons to proscribe. Each emoticon will be a string of\r\ncharacters not including any whitespace. You will also receive several lines of text. What you\r\nneed to do is change some characters of the text into spaces to ensure no emoticon is left on\r\nthe text. For an emoticon to be considered to appear in the text it has to appear in a single\r\nline and be made of consecutive characters.To help George’s plan remain secret as long as possible, you need to do your job with the\r\nminimum possible amount of character changes.InputThe input file contains several test cases. Each test case consists of several lines. The first\r\nline of each test case will contain two integers separated by a single space: N, the number of\r\nemoticons to proscribe, and M, the number of lines the text has. The next N lines contain one\r\nemoticon each, a non-empty string of at most 15 characters. Each of the last M lines of the\r\ntest case contains a line of text of at most 80 characters. You can assume 1 <= N,M <= 100.Valid input characters for emoticons are uppercase and lowercase letters, digits and the symbols\r\n“!?.,:;-_’#$%&/=*+(){}[]” (quotes for clarity). Each line of the text may contain the same\r\ncharacters with the addition of the space character.The input is terminated by N = M = 0.OutputFor each test case, output exactly one line containing a single integer that indicates the minimum\r\nnumber of changes you need to make to the entire text to ensure no emoticon on the list appears\r\nin it.ExampleInput:4 6\r\n:-)\r\n:-(\r\n(-:\r\n)-:\r\nHello uncle John! :-) :-D\r\nI am sad or happy? (-:-(?\r\nI feel so happy, my head spins\r\n(-:-)(-:-)(-:-)(-:-) :-) (-: :-)\r\nbut then sadness comes :-(\r\nLoves you, Joanna :-)))))\r\n3 1\r\n:)\r\n):\r\n))\r\n:):)):)):)):(:((:(((:):)\r\n0 0Output:11\r\n8",
  "sample_input": "Input:4 6\r\n:-)\r\n:-(\r\n(-:\r\n)-:\r\nHello uncle John! :-) :-D\r\nI am sad or happy? (-:-(?\r\nI feel so happy, my head spins\r\n(-:-)(-:-)(-:-)(-:-) :-) (-: :-)\r\nbut then sadness comes :-(\r\nLoves you, Joanna :-)))))\r\n3 1\r\n:)\r\n):\r\n))\r\n:):)):)):)):(:((:(((:):)\r\n0 0Output:11\r\n8",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/EMOTICON",
  "scraped_at": "2025-08-17 00:33:08"
}