{
  "problem_code": "problems",
  "title": "Justice League",
  "tags": [],
  "text": "Thirty five years ago, a group of super heroes was chosen to form the Justice League, whose\r\npurpose was to protect the planet Earth from the villains. After all those years helping mankind,\r\nits members are retiring and now it is time to choose the new members of the Justice League.In order to keep their secret identity, let’s say, secret, super heroes usually use an integer number\r\nto identify themselves. There are H super heroes on Earth, identified with the integers from 1\r\nto H. With a brief look at the newspapers anyone can find out if two super heroes have already\r\nworked together in a mission. If this happened, we say that the two heroes have a relationship.There must be onlyoneJustice League in the world, which could be formed by any number of\r\nsuper heroes (even only one). Moreover, for any two heroes in the new league, theymusthave\r\narelationship.Besides, consider the set of the heroes not chosen to take part in the Justice League. For any\r\ntwo heroes on that set, theymust nothave a relationship. This prevents the formation of\r\nunofficial justice leagues.You work for an agency in charge of creating the new Justice League. The agency doesn’t know\r\nif it is possible to create the League with the restrictions given, and asked for your programming\r\nskills. Given a set of super heroes and their relationships, determine if it is possible to select\r\nany subset to form the Justice League, according to the given restrictions.InputThe input is composed of several test cases. The first line of each test case contains two integers\r\nseparated by a single space, H (2 ≤ H ≤ 5×104) and R (1 ≤ R ≤ 105), indicating, respectively,\r\nthe number of heroes and the number of relationships. Each of the following R lines contains\r\ntwo integers separated by a single space, A and B (1 ≤ A < B ≤ H), indicating that super\r\nhero A has a relationship with super hero B. Note that if A has a relationship with B, B also\r\nhas a relationship with A. A relationship is never informed twice on a test case.The end of input is indicated by H = R = 0.OutputFor each test case in the input print a single line, containing the uppercase letter “Y” if it\r\nis possible to select a subset of heroes to form the Justice League according to the given\r\nrestrictions, or the uppercase letter “N” otherwise.ExampleInput:5 5\r\n1 2\r\n2 3\r\n1 3\r\n1 4\r\n3 5\r\n9 8\r\n1 2\r\n2 3\r\n3 4\r\n4 5\r\n5 6\r\n6 7\r\n7 8\r\n8 9\r\n4 3\r\n1 2\r\n2 3\r\n3 4\r\n0 0Output:Y\r\nN\r\nY",
  "sample_input": "Input:5 5\r\n1 2\r\n2 3\r\n1 3\r\n1 4\r\n3 5\r\n9 8\r\n1 2\r\n2 3\r\n3 4\r\n4 5\r\n5 6\r\n6 7\r\n7 8\r\n8 9\r\n4 3\r\n1 2\r\n2 3\r\n3 4\r\n0 0Output:Y\r\nN\r\nY",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/JLEAGUE",
  "scraped_at": "2025-08-17 00:33:17"
}