{
  "problem_code": "problems",
  "title": "He is offside!",
  "tags": [],
  "text": "Hemisphere Network is the largest television network in Tumbolia, a small country located\r\neast of South America (or south of East America). The most popular sport in Tumbolia,\r\nunsurprisingly, is soccer; many games are broadcast every week in Tumbolia.Hemisphere Network receives many requests to replay dubious plays; usually, these happen\r\nwhen a player is deemed to be offside by the referee. An attacking player isoffsideif he is\r\nnearer to his opponents’ goal line than the second last opponent. A player is not offside ifhe is level with the second last opponent orhe is level with the last two opponents.Through the use of computer graphics technology, Hemisphere Network can take an image of\r\nthe field and determine the distances of the players to the defending team’s goal line, but they\r\nstill need a program that, given these distances, decides whether a player is offside.InputThe input file contains several test cases. The first line of each test case contains two integers\r\nA and D separated by a single space indicating, respectively, the number of attacking and\r\ndefending players involved in the play (2 <= A,D <= 11). The next line contains A integers Biseparated by single spaces, indicating the distances of the attacking players to the goal line\r\n(1 <= Bi<= 104). The next line contains D integers Cjseparated by single spaces, indicating the\r\ndistances of the defending players to the goal line (1 <= Cj<= 104). The end of input is indicated\r\nby A = D = 0.OutputFor each test case in the input print a line containing a single character: “Y” (uppercase) if\r\nthere is an attacking player offside, and “N” (uppercase) otherwise.ExampleInput:2 3\r\n500 700\r\n700 500 500\r\n2 2\r\n200 400\r\n200 1000\r\n3 4\r\n530 510 490\r\n480 470 50 310\r\n0 0Output:N\r\nY\r\nN",
  "sample_input": "Input:2 3\r\n500 700\r\n700 500 500\r\n2 2\r\n200 400\r\n200 1000\r\n3 4\r\n530 510 490\r\n480 470 50 310\r\n0 0Output:N\r\nY\r\nN",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/OFFSIDE",
  "scraped_at": "2025-08-17 00:33:13"
}