{
  "problem_code": "problems",
  "title": "ICPC Scoreboard",
  "tags": [],
  "text": "Charles is the contest director for the ICPC Tumbolian regional contest. His responsibility is\r\nensuring the contest flows smoothly, that the contest rules are applied fairly, and, of course,\r\nannouncing the final contest ranking.According to ICPC rules, a team with more solved problems ranks above a team with less\r\nsolved problems. If two teams have the same number of solved problems, the team with the\r\nsmaller total penalty ranks above the team with the larger total penalty (in case both teams\r\nhave the same number of solved problems and the same penalty, Charles considers them as\r\ntied).Thetotal penaltyfor a team is the sum of all the problem penalties of the problems that team\r\nhas solved. The problem penalty for a problem is TP +EP ×FA, where TP is the time penalty\r\nfor that problem, EP is the contest’s error penalty and FA is the number of failed attempts\r\nat solving the problem before submitting a correct solution.Thetime penaltyfor a problem is the time since the start of the contest, in minutes, that the\r\nteam needed to solve the problem. Theerror penaltyis a positive integer chosen by the contest\r\ndirector, designed to reward teams that submit correct solutions on the first attempt.Charles wants to change the error penalty from the “standard” value of 20 minutes to stir things\r\nup. To study the effects of that change on the final rankings, he wants to know the range of\r\nerror penalties thatdon’tchange the final standings.In other words, if team A is ahead of team B in the original standings, then A should be ahead\r\nof B in the modified standings; if A and B are tied in the original standings, they should also\r\nbe tied in the modified standings (the original standings are the ones obtained with an error\r\npenalty of 20 minutes).Charles has been very busy organizing the Tumbolian regional, so he asked you to make a\r\nprogram that will compute the range for him.InputThe input contains several test cases. The first line of each test case contains two integers\r\nT and P separated by a single space, indicating the number of teams and the number of\r\nproblems, respectively (2 <= T <= 100, 1 <= P <= 10). Each one of the next T lines describes\r\nthe performance of a team. A team’s performance description is a line containing P problem\r\ndescriptions separated by single spaces. Teams are not necessarily given in order of their final\r\nstandings.Each problem description is a string “A/S”, where A is an integer representing the number of\r\nattempts that the corresponding team made at solving that problem (0 <= A <= 100), and S\r\nis either “-”, if the team did not solve that problem, or an integer indicating the number of\r\nminutes it took for the team to submit a correct solution (0 <= S <= 300). Attempts made after\r\nthe first correct submission are not counted.OutputFor each test case in the input print two positive integers separated by a single space, indicating\r\nthe smallest and largest error penalties that would not change the final ranking. If there is no\r\nupper bound for the error penalty, print a “*” instead of the upper bound.ExampleInput:5 3\r\n0/- 0/- 0/-\r\n2/- 2/- 1/-\r\n1/60 1/165 1/-\r\n1/80 0/- 2/120\r\n0/- 1/17 0/-\r\n4 2\r\n17/- 5/-\r\n2/7 3/-\r\n3/- 2/-\r\n1/15 0/-\r\n3 2\r\n1/- 2/15\r\n2/53 1/17\r\n1/70 1/20\r\n0 0Output:1 24\r\n9 *\r\n20 20",
  "sample_input": "Input:5 3\r\n0/- 0/- 0/-\r\n2/- 2/- 1/-\r\n1/60 1/165 1/-\r\n1/80 0/- 2/120\r\n0/- 1/17 0/-\r\n4 2\r\n17/- 5/-\r\n2/7 3/-\r\n3/- 2/-\r\n1/15 0/-\r\n3 2\r\n1/- 2/15\r\n2/53 1/17\r\n1/70 1/20\r\n0 0Output:1 24\r\n9 *\r\n20 20",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ICPCS",
  "scraped_at": "2025-08-17 00:33:15"
}