{
  "problem_code": "problems",
  "title": "Undecodable Codes",
  "tags": [],
  "text": "Phil Oracle has a unique ability that makes him indispensable at the National Spying Agency. His colleagues can bring him any new binary code and he can tell them immediately whether the code is uniquely decodable or not. Acodeis the assignment of a unique sequence of characters (acodeword) to each character in analphabet. A binary code is one in which the codewords contain only zeroes and ones. For example, here are two possible binary codes for the alphabet {a,c,j,l,p,s,v}.Theencodingof a string of characters from an alphabet (thecleartext) is the concatenation of the codewords corresponding to the characters of the cleartext, in order, from left to right. A code isuniquely decodableif the encoding of every possible cleartext using that code is unique. In the example above, Code 1 is uniquely decodable, but Code 2 is not. For example, the encodings of the cleartexts \"pascal\" and \"java\" are both001010101010. Even shorter encodings that are not uniquely decodable are01and10.While the agency is very proud of Phil, he unfortunately gives only \"yes\" or \"no\" answers. Some members of the agency would prefer more tangible proof, especially in the case of codes that are not uniquely decodable. For this problem you will deal only with codes that arenotuniquely decodable. For each of these codes you must determine the single encoding having the minimum length (measured in bits) that is ambiguous because it can result from encoding each of two or more different cleartexts. In the case of a tie, choose the encoding which comes first lexicographically.InputOne or more codes are to be tested. The input for each code begins with an integer m, 1<=m<=20, on a line by itself, where m is the number of binary codewords in the code. This is followed by m lines each containing one binary codeword string, with optional leading and trailing whitespace. No codeword will contain more than 20 bits.The input is terminated by the number zero on a line by itself.OutputFor each code, display the sequential code number (starting with 1), the length of the shortest encoding that is not uniquely decodable, and the shortest encoding itself, with ties broken as previously described. The encoding must be displayed with 20 bits on each line except the last, which may contain fewer than 20 bits. Place a blank line after the output for each code. Use the format shown in the samples below.ExampleInput:3\r\n0\r\n01\r\n10\r\n5\r\n0110\r\n00\r\n111\r\n001100\r\n110\r\n5\r\n1\r\n001\r\n0001\r\n00000000000000000001\r\n10000000000000000000\r\n0Output:Code 1: 3 bits\r\n010\r\n\r\nCode 2: 9 bits\r\n001100110\r\n\r\nCode 3: 21 bits\r\n10000000000000000000\r\n1",
  "sample_input": "Input:3\r\n0\r\n01\r\n10\r\n5\r\n0110\r\n00\r\n111\r\n001100\r\n110\r\n5\r\n1\r\n001\r\n0001\r\n00000000000000000001\r\n10000000000000000000\r\n0Output:Code 1: 3 bits\r\n010\r\n\r\nCode 2: 9 bits\r\n001100110\r\n\r\nCode 3: 21 bits\r\n10000000000000000000\r\n1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/UCODES",
  "scraped_at": "2025-08-17 00:33:10"
}