{
  "problem_code": "problems",
  "title": "Flipping Burned Pancakes",
  "tags": [],
  "text": "The cook at theFrobbozz Magic Pancake Housesometimes falls asleep on the job while cooking\r\npancakes. As a result, one side of a stack of pancakes is often burned. Clearly, it is bad business to\r\nserve visibly burned pancakes to the patrons. Before serving, the waitress will arrange the stacks of\r\npancakes so that the burned sides are facing down. You must write a program to aid the waitress in\r\nstacking the pancakes correctly.We start with a stack ofNpancakes of distinct sizes, each of which is burned on one side. The\r\nproblem is to convert the stack to one in which the pancakes are in size order with the smallest on the\r\ntop and the largest on the bottom and burned side down for each pancake. To do this, we are\r\nallowed to flip the topkpancakes over as a unit (so thek-thpancake is now on top and the pancake\r\npreviously on top is now in thek-thposition and the burned side goes from top to bottom and vice\r\nversa).For example (+ indicates burned bottom, - a burned top):+1 -3 -2 [flip 2] ⇒ +3 -1 -2 [flip 1] ⇒ -3 -1 -2 [flip 3] ⇒\r\n         +2 +1 +3 [flip 1] ⇒ -2 +1 +3 [flip 2] ⇒ -1 +2 +3 [flip 1] ⇒ +1 +2 +3You must write a program which finds a sequence of at most(3n – 2)flips, which converts a given\r\nstack of pancakes to a sorted stack with burned sides down.InputThe first line of the input contains a single decimal integer, N, the number of problem instances to\r\nfollow. Each of the following N lines gives a separate dataset as a sequence of numbers separated\r\nby spaces. The first number on each line gives the number, M, of pancakes in the data set. The\r\nremainder of the data set is the numbers 1 through M in some order, each with a plus or minus sign,\r\ngiving the initial pancake stack. The numbers indicate the relative sizes of the pancakes and the\r\nsigns indicate whether the burned side is up (-) or down (+). M will be, at most, 30.OutputFor each dataset, you should generate one line of output with the following values: The dataset\r\nnumber as a decimal integer (start counting at one), a space, the number of flips (K, where K ≥ 0)\r\nrequired to sort the pancakes and a sequence of K numbers, each of which gives the number of\r\npancakes to flip on the corresponding sorting step. There may be several correct solutions for some\r\ndatasets. For instance 3 2 3 is also a solution to the first problem below.ExampleInput:3\r\n3 +1 –3 –2\r\n4 –3 +1 –2 –4\r\n5 +1 +2 +3 +4 -5Output:1 6 2 1 3 1 2 1\r\n2 6 4 1 4 3 1 2\r\n3 3 5 1 5",
  "sample_input": "+1 -3 -2 [flip 2] ⇒ +3 -1 -2 [flip 1] ⇒ -3 -1 -2 [flip 3] ⇒\r\n         +2 +1 +3 [flip 1] ⇒ -2 +1 +3 [flip 2] ⇒ -1 +2 +3 [flip 1] ⇒ +1 +2 +3",
  "sample_output": "Input:3\r\n3 +1 –3 –2\r\n4 –3 +1 –2 –4\r\n5 +1 +2 +3 +4 -5Output:1 6 2 1 3 1 2 1\r\n2 6 4 1 4 3 1 2\r\n3 3 5 1 5",
  "link": "https://www.spoj.com/problems/GNY07E",
  "scraped_at": "2025-08-17 00:33:19"
}