{
  "problem_code": "problems",
  "title": "Art of War",
  "tags": [],
  "text": "TheWarring States Period(473-22l BC) refers to the centuries of turmoil following the Spring and\r\nAutumn Period. China was divided into many little kingdoms that were constantly fighting with each\r\nother. Unlike in previous ages, when chivalry played an important role in battles and the states fought\r\nmostly for balance of power or to resolve disputes, in this period the aim of battle was to conquer and\r\ncompletely annihilate the other states. Eventually seven states, known as the ``Seven Great Powers'' rose\r\nto prominence: Qi, Chu, Yan, Han, Zhao, Wei, and Qin. After numerous alliances and counter-alliances,\r\nQin defeated all the other states one by one, putting an end to the Warring States Period.You are given a map that shows the position of the capital for each state, and the borders between the\r\nstates as a series of line segments. Your job is to determine which states were fighting with each other.\r\nThis is pretty easy to determine - if two states had a common border, then they were fighting.InputThe input contains several blocks of test cases. Each case begins with a line containing two integers:\r\nthe number 1 ≤n≤ 600 of states, and the number 1 ≤m≤ 4000 of border segments. The nextnlines describe the coordinates of capitals, there are two integers in each line. The nextmlines after that\r\ndescribe themborder segments. Each line contains four integersx1,y1,x2andy2meaning that there is a border segment from (x1,y1) to (x2,y2). (It is not given in the input what the two states on the two sides of the border are, but it can be deduced from the way the borders go.)Each state is enclosed by a continuous borderline. The states are surrounded by an infinite wasteland,\r\nthus a border segment either separates two states, or a state from the wasteland. It is not possible that\r\nthe same state is on both sides of a border segment, or the wasteland is on both sides of a border segment.\r\nThere is exactly one capital in each state, and there is no capital in the wasteland. The border segments\r\ndo not cross each other, they can meet only at the end points.The input is terminated by a block withn=m= 0.OutputFor each test case, you have to outputnlines that describe the enemies of thenstates (recall that if two\r\nstates share a border, then they are enemies). Each line begins with an integer, the numberxof enemies\r\nthe given state has. This number is followed byxnumbers identifying the enemies of the state. These\r\nnumbers are between 1 andnand number 1 refers to the first capital appearing in the input, numbernrefers to the last.ExampleInput:4 12\r\n3 2\r\n11 8\r\n12 17\r\n1 19\r\n0 0 10 0\r\n10 0 20 0\r\n20 0 20 10\r\n20 10 20 20\r\n20 20 10 20\r\n10 20 0 20\r\n0 20 0 10\r\n0 10 0 0\r\n10 0 10 10\r\n0 10 10 10\r\n20 10 10 10\r\n10 20 10 10\r\n4 16\r\n170 13\r\n24 88\r\n152 49\r\n110 130\r\n60 60 140 60\r\n140 60 140 140\r\n140 140 60 140\r\n60 140 60 60\r\n0 0 200 0\r\n200 0 200 200\r\n200 200 0 200\r\n0 200 0 0\r\n40 40 160 40\r\n160 40 160 160\r\n160 160 40 160\r\n40 160 40 40\r\n20 20 180 20\r\n180 20 180 180\r\n180 180 20 180\r\n20 180 20 20\r\n0 0Output:2 2 4\r\n2 1 3\r\n2 2 4\r\n2 1 3\r\n1 2\r\n2 1 3\r\n2 2 4\r\n1 3",
  "sample_input": "Input:4 12\r\n3 2\r\n11 8\r\n12 17\r\n1 19\r\n0 0 10 0\r\n10 0 20 0\r\n20 0 20 10\r\n20 10 20 20\r\n20 20 10 20\r\n10 20 0 20\r\n0 20 0 10\r\n0 10 0 0\r\n10 0 10 10\r\n0 10 10 10\r\n20 10 10 10\r\n10 20 10 10\r\n4 16\r\n170 13\r\n24 88\r\n152 49\r\n110 130\r\n60 60 140 60\r\n140 60 140 140\r\n140 140 60 140\r\n60 140 60 60\r\n0 0 200 0\r\n200 0 200 200\r\n200 200 0 200\r\n0 200 0 0\r\n40 40 160 40\r\n160 40 160 160\r\n160 160 40 160\r\n40 160 40 40\r\n20 20 180 20\r\n180 20 180 180\r\n180 180 20 180\r\n20 180 20 20\r\n0 0Output:2 2 4\r\n2 1 3\r\n2 2 4\r\n2 1 3\r\n1 2\r\n2 1 3\r\n2 2 4\r\n1 3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/WAR",
  "scraped_at": "2025-08-17 00:33:19"
}