{
  "problem_code": "problems",
  "title": "Breaking in",
  "tags": [],
  "text": "Mayco has recently been hired as a security consultant for a well-known software company. At the moment, he's working on his first assignment – trying to determine which of the company's servers would be the best targets for potential attackers. It is a bit difficult, though, because some of the servers \"trust\" some of the others. If an attacker compromises a server, he or she can also freely access all servers that trust it (and servers that trust them, and so on).By definition, the importance of a server S is the number of servers the attacker would be able to access if he compromised S. The most important servers are those with the highest importance. (Note that there can be more than one most important server. This is also illustrated in the example below.)Problem specificationThe network consists of N computers, numbered 1 to N, inclusive. The trust between computers is described by M ordered pairs (A, B) of numbers, denoting that computer A trusts computer B. The trust is not assumed to be mutual – i.e., if a computer A trusts computer B, it does not necessarily imply that computer B trusts computer A.Input specificationThe first line of the input file contains an integer T specifying the number of test cases. Each test case is preceded by a blank line.Each test case starts with a line containing the numbers N and M (1 ≤ N ≤ 9000, 1 ≤ M ≤ 52000). Each of the following M lines contains two integers, A and B, denoting that computer A trusts computer B.Output specificationFor each test case, the output shall contain one line with the numbers of all of the most important servers. The numbers must be listed in increasing order and separated by single spaces.Exampleinput:2\r\n\r\n5 4\r\n3 1\r\n3 2\r\n4 3\r\n5 3\r\n\r\n6 5\r\n1 2\r\n2 3\r\n3 1\r\n1 4\r\n5 6output:1 2\r\n4NoteBlue Mary has found a pruning which will make the program very efficient. So the time limit of the hard test case is changed from 60 seconds to 15 seconds. If you have some even harder test case, please send it tome, and I'll add it to the standard input file.",
  "sample_input": "input:2\r\n\r\n5 4\r\n3 1\r\n3 2\r\n4 3\r\n5 3\r\n\r\n6 5\r\n1 2\r\n2 3\r\n3 1\r\n1 4\r\n5 6output:1 2\r\n4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BREAK",
  "scraped_at": "2025-08-17 00:33:10"
}