{
  "problem_code": "problems",
  "title": "Perfect Rhyme",
  "tags": [],
  "text": "A perfect rhyme is not a crime,\r\nit is something that exceeds time, \r\na bit of science, a piece of art, \r\nsoft as a pillow, sharp as a dart.Everyone tried it, but only few chosen ones succeeded. It is a hard task with an unclear path, but a famous end – should you reach it. Many compare it to finding the Holy Grail, or even to finding Waldo. The task is to find a perfect rhyme.Problem specificationGiven is a wordlistL, and a wordw. Your task is to find a word inLthat forms a perfect rhyme withw. This worduis uniquely determined by these properties:It is inL.It is different fromw.Their common suffix is as long as possible.Out of all words that satisfy the previous points,uis the lexicographically smallest one.NotesA prefix of a word is any string that can be obtained by repeatedly deleting the last letter of the word. Similarly, a suffix of a word is any string that can be obtained by repeatedly deleting the first letter of the word.For example, consider the worddifferent.This word is both its own prefix and suffix. Its longest other prefix isdifferen, and its longest other suffix isifferent. The stringrentis its yet another, even shorter suffix. The stringseentandiffeare neither prefixes nor suffixes of the worddifferent.Letuandvbe two different words. We say thatuis lexicographically smaller thanvif eitheruis a prefix ofv, or ifiis the first position where they differ, and thei-th letter ofuis earlier in the alphabet than thei-th letter ofv.For example,dogis smaller thandogs, which is smaller thandragon(becauseois less thanr).Input specificationThe input file consists of two parts. The first part contains the wordlistL, one word per line. Each word consists of lowercase English letters only, and no two words are equal.The first part is terminated by an empty line.The second part follows, with one query wordwper line.You may assume that in either part of the input, the length of a word will be no more than 30. And the number of words in each part of the input will be no more than 250000. The input file will be less than 5MB.Output specificationFor each query in the input file output a single line with its perfect rhyme. The output must be in lowercase.Exampleinput:perfect\r\nrhyme\r\ncrime\r\ntime\r\n\r\ncrime\r\nrhymeoutput:time\r\ncrimeIn the second test case, there were two candidates that had an equally long common suffix (crime and time), the lexicographically smaller one was chosen.Warning: large input/output data, be careful with certain languages",
  "sample_input": "A perfect rhyme is not a crime,\r\nit is something that exceeds time, \r\na bit of science, a piece of art, \r\nsoft as a pillow, sharp as a dart.",
  "sample_output": "input:perfect\r\nrhyme\r\ncrime\r\ntime\r\n\r\ncrime\r\nrhymeoutput:time\r\ncrime",
  "link": "https://www.spoj.com/problems/PRHYME",
  "scraped_at": "2025-08-17 00:33:19"
}