{
  "problem_code": "problems",
  "title": "Help R2",
  "tags": [],
  "text": "In Episode III of Star Wars (whose alleged title is \"How I became Vader\"), R2-D2 (Artoo-Detoo) is again confronted to a tedious work.\r\nHe is responsible for the loading of the republic transport starships in the fastest way. Imagine a huge space area where n starships are parked.\r\nEach starship has a capacity of K cubic femtoparsec. Containers Ciarrive one at a time with some volume vi(expressed in cubic femtoparsec).\r\nR2-D2 wants to minimize the number of starships used for a given sequence of containers.Smart as he is, R2-D2 knows for sure that the problem is a hard one, even with the force being around.\r\nHere is the heuristics he selected to solve his problem. Start with all starships ready to load, and numbered S0,S1,etc.\r\nWhen a container Cjarrives, select the starship of minimal index i that can contain Cjand put it in Si.\r\nIn some sense, this heuristic minimizes the move of the container arriving before its loading.At the end of the n arrivals, R2-D2 counts the number s of starships used and he measures the total waste w of the sequence.\r\nFor i=0..s-1, the waste in starship i is given by the unused volume.Your task is to simulate the algorithm of R2-D2.InputThe first line of the input contains a number T ≤ 10 that indicates the number of test cases to follow.\r\nEach test case begins with K on a line (K ≤ 1000), followed by the number of containers in the sequence, n, on the second line (1 ≤ n ≤ 1000000).\r\nThere are two possible formats for the remaining lines. If it contains one integer, then this is the next vi. If it begins with the character b\r\n(for block), it is followed by 2 integers r and v. This means that the r next containers arriving have volume v.OutputYour program must output the number s of starships used, followed by a space, followed by the total waste w.You can assume, that at most 100000 starships are needed, and R2-D2 has to change the starships in which the next container is loaded at most 100000 times.ExampleInput:2\r\n100\r\n3\r\n50\r\n25\r\n70\r\n100\r\n4\r\n50\r\nb 2 40\r\n20Output:2 55\r\n2 50",
  "sample_input": "Input:2\r\n100\r\n3\r\n50\r\n25\r\n70\r\n100\r\n4\r\n50\r\nb 2 40\r\n20Output:2 55\r\n2 50",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HELPR2D2",
  "scraped_at": "2025-08-17 00:33:04"
}