{
  "problem_code": "problems",
  "title": "Johnny and the Glue",
  "tags": [],
  "text": "Little Johnny decided he needed to stick an open metal box to the floor in the \r\n\thall of his parents' house, so that all guests coming in would trip on it. He \r\n\tknew that as soon as his parents saw what he had done, they would try to remove \r\n\tit, and he wasn't going to stand for this. So, he chose the strongest glue in his \r\n\tpossession and left lots of dabs of it on the floor (from our point of view, \r\n\tthese can be regarded as points). Now, the only question that remained was how \r\n\tto stick the box onto the floor. Johnny is very particular about the way he \r\n\tdoes this: the box is always stuck face down, so that it only touches the floor \r\n\ton the four edges of the rectangle that forms its base. He would like each of \r\n\tthese edges to make contact with at least two dabs of glue. Furthermore, he \r\n\tdoesn't want any of the dabs to stay outside the box, since this would ruin the \r\n\tfun (there is no way you can trip someone up, if you've glued them to the \r\n\tfloor, is there?)Obviously, Johnny can sometimes reach his objective in more than one way \r\n\t(especially since he has prepared boxes of all possible dimensions for his act \r\n\tof mischief). Depending on how he does this, a different section of floor will \r\n\tbe covered by the box. Determine in how many ways Johnny can choose the section \r\n\tof floor to be covered by the box when gluing.InputThe input begins with the integer t, the number of test cases. Then t test \r\n\tcases follow.The first line of each test case contains positive integer n ≤ 10000 \r\n\t- the number of dabs of glue on the floor. The next n lines contain two \r\n\tintegers, x y (-15000 ≤ x, y ≤ 15000), representing the x and y coordinates \r\n\tof the dabs (given in the order in which they were placed by Johnny ;).OutputFor each test case output the number of different sections of floor Johnny may \r\n\tchoose to cover (possibly 0).ExampleSample input:1 \r\n8 \r\n1 0 \r\n1 4 \r\n0 3 \r\n5 4 \r\n5 0 \r\n6 1 \r\n6 3 \r\n0 1Sample output:2",
  "sample_input": "Sample input:1 \r\n8 \r\n1 0 \r\n1 4 \r\n0 3 \r\n5 4 \r\n5 0 \r\n6 1 \r\n6 3 \r\n0 1Sample output:2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GLUE",
  "scraped_at": "2025-08-17 00:33:20"
}