{
  "problem_code": "problems",
  "title": "The Courier",
  "tags": [],
  "text": "Byteland is a scarcely populated country, and residents of different cities \r\n\tseldom communicate with each other. There is no regular postal service and \r\n\tthroughout most of the year a one-man courier establishment suffices to \r\n\ttransport all freight. However, on Christmas Day there is somewhat more work \r\n\tfor the courier than usual, and since he can only transport one parcel at a \r\n\ttime on his bicycle, he finds himself riding back and forth among the cities of \r\n\tByteland.The courier needs to schedule a route which would allow him to leave his home \r\n\tcity, perform the individual orders in arbitrary order (i.e. travel to the city \r\n\tof the sender and transport the parcel to the city of the recipient, carrying \r\n\tno more than one parcel at a time), and finally return home. All roads are \r\n\tbi-directional, but not all cities are connected by roads directly; some pairs \r\n\tof cities may be connected by more than one road. Knowing the lengths of all \r\n\tthe roads and the errands to be performed, determine the length of the shortest \r\n\tpossible cycling route for the courier.InputThe input begins with the integer t, the number of test cases. Then t test \r\n\tcases follow.Each test case begins with a line containing three integers: n m b, denoting \r\n\tthe number of cities in Byteland, the number of roads, and the number of \r\n\tthe courier's home city, respectively (1 ≤ b ≤ n ≤ 100, 1 ≤ m ≤ 10000). The \r\n\tnext m lines contain three integers each, the i-th being uividi, which means that cities uiand viare \r\n\tconnected by a road of length di(1 ≤ ui, vi≤ 100, \r\n\t1 ≤ di≤ 10000). The following line contains integer z - the \r\n\tnumber of transport requests the courier has received (1 ≤ z ≤ 5). After that, z \r\n\tlines with the description of the orders follow. Each consists of three \r\n\tintegers, the j-th being ujvjbj, which \r\n\tsignifies that bjparcels should be transported (individually) from \r\n\tcity ujto city vj. The sum of all bjdoes not \r\n\texceed 12.OutputFor each test case output a line with a single integer - the length of the \r\n\tshortest possible bicycle route for the courier.ExampleInput:1\r\n5 7 2\r\n1 2 7\r\n1 3 5\r\n1 5 2\r\n2 4 10\r\n2 5 1\r\n3 4 3\r\n3 5 4\r\n3\r\n1 4 2\r\n5 3 1\r\n5 1 1Output:43",
  "sample_input": "Input:1\r\n5 7 2\r\n1 2 7\r\n1 3 5\r\n1 5 2\r\n2 4 10\r\n2 5 1\r\n3 4 3\r\n3 5 4\r\n3\r\n1 4 2\r\n5 3 1\r\n5 1 1Output:43",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/COURIER",
  "scraped_at": "2025-08-17 00:33:15"
}