{
  "problem_code": "problems",
  "title": "Fencing in the Sheep",
  "tags": [],
  "text": "A shepherd is having some trouble penning in his flock of sheep. After several \r\n\thours of ineffectual efforts he gives up, with some of the sheep within their \r\n\tpolygon-shaped pen and some outside. Exhausted, he moves to a place within the \r\n\tpen from which he can see the whole interior of the pen (without any fence \r\n\tgetting in the way) and begins to count the sheep which are within it. Please \r\n\tassist him in his task.InputThe input begins with the integer t, the number of test cases. Then t test cases \r\n\tfollow.The first line of each test case contains two integers n m, denoting the number \r\n\tof vertices of the polygon forming the fence, and the number of sheep in the \r\n\twhole herd (3 ≤ n ≤ 100000, 0 ≤ m ≤ 100000). The next n lines contain \r\n\ttwo integers each, the i-th being xiyi- the x and y \r\n\tcoordinates of the i-th vertex of the fence (given in anti-clockwise order, \r\n\t-32000 ≤ xi, yi≤ 32000). The next m lines contain two \r\n\tintegers each, the j-th being xjyj- the x and y \r\n\tcoordinates of the j-th sheep (arranged in decreasing order of seniority, \r\n\t-32000 ≤ xj, yj≤ 32000). The shepherd's observation \r\n\tpoint is within the pen and has coordinates (0, 0).OutputFor each test case output a line with a single integer - the number of sheep \r\n\twithin the pen. The sheep which are sitting back on the fence and enjoying a \r\n\tcigarette should be included in the count.ExampleSample input:1\r\n6 5\r\n2 2\r\n4 4\r\n6 6\r\n-3 1\r\n-1 -1\r\n5 1\r\n2 1\r\n3 2\r\n6 6\r\n3 3\r\n-3 0Sample output:3Illustration of the sample test data:Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Sample input:1\r\n6 5\r\n2 2\r\n4 4\r\n6 6\r\n-3 1\r\n-1 -1\r\n5 1\r\n2 1\r\n3 2\r\n6 6\r\n3 3\r\n-3 0Sample output:3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/FSHEEP",
  "scraped_at": "2025-08-17 00:33:10"
}