{
  "problem_code": "problems",
  "title": "Land for Motorways",
  "tags": [],
  "text": "With every year, the plans for the construction of motorways in Poland are more \r\n\tand more advanced. For some time, it seemed as if the building was actually \r\n\tgoing to start, so the question of purchasing the land under the roads was of \r\n\tsome importance. Only certain cities can be connected by a road directly, \r\n\tprovided the farmer owning the land under it agrees to sell out. As a result of \r\n\tthe constant swing of moods, the price demanded for the land by each farmer \r\n\tchanges in a linear fashion, with possibly different coefficients for every \r\n\troad. It may either increase or decrease (and sometimes even be negative, if \r\n\tthe owner anticipates future profit from the proximity of a motorway).It has been decided that the purchase of land will be made at some moment in \r\n\tbetween two fixed dates. At that moment, the current prices of land will be \r\n\tfrozen, and the least costly configuration of bidirectional roads connecting \r\n\tall cities (directly or indirectly) will be chosen. All the land under the \r\n\tselected roads will subsequently be bought at the frozen price. Since business in the proximity of a motorway does have its advantages, some land owners might actually want their land to be bought and they may offer money into the bargain, consequently making the price of purchase negative.You act as an intermediary for the purchase and charge a steady commission, \r\n\tproportional to the total sum of purchase. Oddly enough, when signing the contract you missed the clause about the possibility of the price being negative and now you begin to wonder whether you won't end up being charged for your own hard work. Since it is one of your tasks to \r\n\tselect the moment of purchase, do so in such a way as to maximise your profit (if this is impossible, at least cut your losses as much as possible).InputThe input begins with the integer t, the number of test cases. Then t test \r\n\tcases follow.For each test case the first line contains two integers n m, denoting the \r\n\tnumber of cities to be connected and the number of available potential \r\n\troads, respectively (1 ≤ n ≤ 120,1 ≤ m ≤ 820). The next line contains \r\n\ttwo integers t1t2, which stand for the earliest possible \r\n\tand latest possible moments of purchase (-10000 ≤ t1≤ t2≤ 10000). \r\n\tEach of the following m lines contains four integers, the i-th being: uiviaibi, which means that the i-th road \r\n\tconnects city uiwith city vi, and the purchase of the \r\n\tland under it costs bi+j×aiunits of \r\n\tcurrency at moment j (e.g. at moment 0 the land costs biunits). Please note that these integers are chosen from the following ranges: \r\n\t0 ≤ ui, vi≤ n-1, -32000 ≤ ai, bi≤ 32000.OutputFor each test case output a line with two floating point numbers, accurate to \r\n\tthree digits after the decimal point. The first represents the moment of \r\n\ttransaction you ought to choose, the second - the total value of the \r\n\ttransaction at that moment. If more than one moment fulfils the conditions of the problem, choose the earliest.ExampleSample input:2\r\n5 6\r\n0 5\r\n1 0 -6 -4\r\n2 0 3 -3\r\n3 0 1 5\r\n3 1 -2 -3\r\n4 1 -3 -2\r\n4 3 -2 -3\r\n5 7\r\n-20 20\r\n1 0 1 2\r\n2 1 -7 4\r\n3 1 -9 0\r\n3 2 4 9\r\n4 1 0 -2\r\n4 2 2 3\r\n4 3 6 -5Sample output:0.000 -13.000\r\n0.111 -1.000",
  "sample_input": "Sample input:2\r\n5 6\r\n0 5\r\n1 0 -6 -4\r\n2 0 3 -3\r\n3 0 1 5\r\n3 1 -2 -3\r\n4 1 -3 -2\r\n4 3 -2 -3\r\n5 7\r\n-20 20\r\n1 0 1 2\r\n2 1 -7 4\r\n3 1 -9 0\r\n3 2 4 9\r\n4 1 0 -2\r\n4 2 2 3\r\n4 3 6 -5Sample output:0.000 -13.000\r\n0.111 -1.000",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MLAND",
  "scraped_at": "2025-08-17 00:33:08"
}