{
  "problem_code": "problems",
  "title": "Window",
  "tags": [],
  "text": "We have a polygon chosen in the cartesian coordinate system. Sides of the polygon are parallel to the axes of coordinates. Every two consecutive sides are perpendicular and coordinates of every vertex are integers. We have also given a window that is a rectangle whose sides are parallel to the axes of coordinates. The interior of the polygon (but not its periphery) is coloured red. What is the number of separate red fragments of the polygon that can be seen through the window?ExampleLook at the figure below:There are two separate fragments of the polygon that can be seen through the window.TaskWrite a program that for each test case:reads descriptions of a window and a polygon;computes the number of separate red fragments of the polygon that can be seen through the window;outputs the result.InputThe number of test casestis in the first line of input, thenttest cases follow separated by an empty line.In the first line of a test case there are four integersx1,y1,x2,y2from the range [0..10000], separated by single spaces. The numbersx1,y1are the coordinates of the top-left corner of the window. The numbersx2,y2are the coordinates of the bottom-right corner of the window. The next line of the input file contains one integern, 4 ≤n≤ 5000, which equals the number of vertices of the polygon. In the followingnlines there are coordinates of polygon's vertices given in anticlockwise direction, i.e. the interior of the polygon is on the left side of its periphery when we move along the sides of the polygon according to the given order. Each line contains two integersx,yseparated by a single space, 0 ≤x≤ 10000, 0 ≤y≤ 10000. The numbers in thei-th line, are coordinates of thei-th vertex of the polygon.OutputFor each test case you should output one line with the number of separate red fragments of the polygon that can be seen through the window.ExampleInput:1\r\n0 5 8 1\r\n24\r\n0 0\r\n4 0\r\n4 2\r\n5 2\r\n5 0\r\n7 0\r\n7 3\r\n3 3\r\n3 2\r\n2 2\r\n2 4\r\n1 4\r\n1 5\r\n2 5\r\n2 6\r\n3 6\r\n3 5\r\n4 5\r\n4 6\r\n5 6\r\n5 4\r\n7 4\r\n7 7\r\n0 7Output:2",
  "sample_input": "Input:1\r\n0 5 8 1\r\n24\r\n0 0\r\n4 0\r\n4 2\r\n5 2\r\n5 0\r\n7 0\r\n7 3\r\n3 3\r\n3 2\r\n2 2\r\n2 4\r\n1 4\r\n1 5\r\n2 5\r\n2 6\r\n3 6\r\n3 5\r\n4 5\r\n4 6\r\n5 6\r\n5 4\r\n7 4\r\n7 7\r\n0 7Output:2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/WINDOW1",
  "scraped_at": "2025-08-17 00:33:19"
}