{
  "problem_code": "problems",
  "title": "Assembler circuits",
  "tags": [],
  "text": "Bytetel Company decided to improve computers they produce. They want to replace assembler programs with special systems called assembler circuits. Assembler programs consist solely of assignments. Each assignment is determined by four elements:two registers from which data are taken,elementary operation that should be performed on the data,register to which the result should be written.We assume that there are at most 26 registers. They are represented by small letters of English alphabet. There are at most 4 elementary operations and they are represented by capital letters A, B, C, D.An assembler circuit has:inputs assigned to registers; initial value of appropriate register is passed to the input;outputs, also assigned to registers; their final values are passed to these registers.There are gates inside a circuit. Each gate has two inputs and one output. The gate performs an elementary operation on data delivered on its inputs and passes the result to its output. Inputs of gates and outputs of the whole circuit are connected to outputs of other gates or inputs of the circuit. Outputs of gates and inputs of the circuit can be connected to many inputs of other gates or outputs of the circuit. Connections among gates cannot form cycles.An assembler circuit is equivalent to an assembler program if for any initial state of registers the final state of registers produced by the program and the circuit are the same.TaskWrite a program that for each test case:reads a description of an assembler program;computes the minimal number of gates in an assembler circuit equivalent to the given program;writes the result.InputThe number of test casestis in the first line of input, thenttest cases follow separated by an empty line.In the first line of each test case there is one integern(1 <=n<= 1000), which is the number of instructions in the program.In the followingnlines there are descriptions of consecutive instructions in the program. Each description is a four-letter word beginning with an elementary operation symbol: A, B, C or D. The second and the third letter (which are small letters of English alphabet) are names of registers, in which data are placed. The fourth letter is a name of a register, in which the result should be placed.OutputFor each test case you should output one line with the minimal number of gates in an assembler circuit equivalent to the given program.ExampleSample input:1\r\n8\r\nAfbc\r\nBfbd\r\nCddd\r\nBcbc\r\nAfcc\r\nAfbf\r\nCfbb\r\nDfdbSample output:6A circuit equivalent to the given program is shown in the figure.",
  "sample_input": "Sample input:1\r\n8\r\nAfbc\r\nBfbd\r\nCddd\r\nBcbc\r\nAfcc\r\nAfbf\r\nCfbb\r\nDfdbSample output:6",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ASCIRC",
  "scraped_at": "2025-08-17 00:33:21"
}