{
  "problem_code": "problems",
  "title": "Paint templates",
  "tags": [],
  "text": "The Painter's Studio is preparing mass production of paintings. Paintings are going to be made with aid of square matrices of various sizes. A matrix of sizeiconsists of 2irows and 2icolumns. There are holes on intersections of some rows and columns. Matrix of size 0 has one hole. Fori> 0, matrix of sizeiis built of four squares of size 2(i-1)*2(i-1). Look at the following figure:Both squares on the right side and the bottom-left square are matrices of sizei-1. Top-left square has no holes. Pictures are constructed in the following way. First, we fix three non-negative integersn,x,y. Next, we take two matrices of sizen, place one of them onto the other and shift the upper onexcolumns right andyrows up. We place such a pattern on a white canvas and cover the common part of matrices with the yellow paint. In this way we get yellow stains on the canvas in the places where the holes in both matrices agree.ExampleConsider two matrices of size 2.The upper matrix was shifted 2 columns right and 2 rows up. There are three places where holes agree.TaskWrite a program that for each test case:reads the sizes of two matrices and the numbers of columns and rows that the upper matrix should be shifted by, from the standard input;computes the number of yellow stains on the canvas;writes the result to the standard output.InputThe number of test casestis in the first line of input, thenttest cases follow separated by an empty line.There is one integern, 0 ≤n≤ 100 in the first line of each test case. This number is the size of matrices used for production of paintings. In the second line there is one integerxand in the third line one integery, where 0 ≤x,y≤ 2n. The integerxis the number of columns andyis the number of rows that the upper matrix should be shifted by.OutputFor each test case your program should produce one line with exactly one integer - the number of stains on the canvas.ExampleSample input:1\r\n2\r\n2\r\n2Sample output:3",
  "sample_input": "Sample input:1\r\n2\r\n2\r\n2Sample output:3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PAINTTMP",
  "scraped_at": "2025-08-17 00:33:20"
}