{
  "problem_code": "problems",
  "title": "Road net",
  "tags": [],
  "text": "A diskette was enclosed to a road map. The diskette contains the table of the shortest ways (distances) between each pair of towns on the map. All the roads are two-way. The location of towns on the map has the following interesting property:if the length of the shortest way from town A to town B equals the sum of the lengths of the shortest ways from A to C and C to B then town C lies on (certain) shortest way from A to B. We say that towns A and B are neighbouring towns if there is no town C such that the length of the shortest way from A to B equals the sum of the lengths of the shortest ways from A to C and C to B. Find all the pairs of neighbouring towns.ExampleFor the table of distances:ABCA012B103C230the neighbouring towns are A, B and A, C.TaskWrite a program that for each test case:reads the table of distances from standard input;finds all the pairs of neighbouring towns;writes the result to standard output.InputThe number of test casestis in the first line of input, thenttest cases follow separated by an empty line.In the first line of each test case there is an integern, 1 ≤n≤ 200, which equals the number of towns on the map. Towns are numbered from 1 ton.The table of distances is written in the followingnlines. In the (i+1)-th line, 1 ≤i≤n, there arennon-negative integers not greater than 200, separated by single spaces. Thej-th integer is the distance between townsiandj.OutputFor each test case your program should write all the pairs of the neighbouring towns (i.e. their numbers). There should be one pair in each line. Each pair can appear only once. The numbers in each pair should be given in increasing order. Pairs should be ordered so that if the pair (a,b) precedes the pair (c,d) thena<cor (a=candb<d).Consequent test cases should by separated by an empty line.ExampleInput:1\r\n3\r\n0 1 2\r\n1 0 3\r\n2 3 0Output:1 2\r\n1 3",
  "sample_input": "Input:1\r\n3\r\n0 1 2\r\n1 0 3\r\n2 3 0Output:1 2\r\n1 3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ROADNET",
  "scraped_at": "2025-08-17 00:33:11"
}