{
  "problem_code": "problems",
  "title": "AB",
  "tags": [],
  "text": "Every sequence of small letters a and b (also the empty sequence) is called an ab-word. IfX= [x1...xn] is an ab-word andi,jare integers such that 1 ≤i≤j≤nthenX[i..j] denotes the subword ofXconsisting of the lettersxi...xj. We say that an ab-wordX= [x1..xn] is nice if it has as many letters a as b and for alli= 1 ...nthe subwordX[1..i] has at least as many letters a as b.Now, we give the inductive definition of the similarity between nice ab-words.Every two empty ab-words (i.e. words with no letters) are similarTwo non-empty nice ab-wordsX= [x1...xn] andY= [y1...ym] are similar if they have the same length (n=m) and one of the following conditions if fulfilled:x1=y1,xn=ynandX[2..n-1] andY[2..n-1] are similar ab-words and they are both nice;there existsi, 1 ≤i≤n, such thatX[1..i],X[i+1..n] are nice ab-words andY[1..i],Y[i+1..n] are nice ab-words andX[1..i] is similar toY[1..i] andX[i+1..n] is similar toY[i+1..n], orY[1..n-i],Y[n-i+1..n] are nice ab-words andX[1..i] is similar toY[n-i+1..n] andX[i+1..n] is similar toY[1..n-i].Alevel of diversityof a non-empty setSof nice ab-words is the maximal number of ab-words that can be chosen fromSin such a way that for each pairw1,w2of chosen words,w1is not similar tow2.TaskWrite a program that for each test case:reads elements ofSfrom standard input;computes the level of diversity of the setS;writes the result to standard output.InputThe number of test casestis in the first line of input, thenttest cases follow separated by an empty line.In the first line of a test case there is a numbernof elements of the setS, 1 ≤n≤ 1000; in the followingnlines there are elements of the setS, i.e. nice ab-words (one word in each line); the first letter of every ab-word is the first symbol in line and there are no spaces between two consecutive letters in the word; the length of every ab-word is an integer from the range [1..200].OutputFor each test case your program should output one line with one integer - the level of diversity ofS.ExampleSample input:1\r\n3\r\naabaabbbab\r\nabababaabb\r\nabaaabbabbSample output:2",
  "sample_input": "Sample input:1\r\n3\r\naabaabbbab\r\nabababaabb\r\nabaaabbabbSample output:2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ABWORDS",
  "scraped_at": "2025-08-17 00:33:09"
}