{
  "problem_code": "problems",
  "title": "The lightest language",
  "tags": [],
  "text": "AlphabetAkconsists ofkinitial letters of English alphabet. A positive integer called a weight is assigned to each letter of the alphabet. A weight of a word built from the letters of the alphabetAkis the sum of weights of all letters in this word. A language over an alphabetAkis any finite set of words built from the letters of this alphabet. A weight of a language is the sum of weights of all its words. We say that the language is prefixless if for each pair of different wordsw,vfrom this languagewis not a prefix ofv.We want to find out what is the minimal possible weight of ann-element, prefixless language over an alphabetAk.ExampleAssume thatk= 2, the weight of the letteraisW(a) = 2 and the weight of the letterbisW(b) = 5. The weight of the wordabisW(ab) = 2 + 5 = 7.W(aba) = 2 + 5 + 2 = 9. The weight of the languageJ= {ab,aba,b} isW(J) = 21. The languageJis not prefixless, since the wordabis a prefix ofaba. The lightest three-element, prefixless language over the alphabetA2(assuming that weights of the letters are as before) is {b,aa,ab}; its weight is 16.TaskWrite a program that for each test case:reads two integersn,kand the weights ofkletters of an alphabetAk;computes the minimal weight of a prefixless,n-element language over the alphabetAk;outputs the result.InputThe number of test casestis in the first line of input, thenttest cases follow separated by an empty line.In the first line of a test case there are two positive integersnandkseparated by a single space, (2 <=n<= 10000, 2 <=k<= 26). These are the number of words in a language and the number of letters in an alphabet respectively. The second line containskpositive integers separated by single spaces. Each of them is not greater than 10000. Thei-th number is the weight of thei-th letter.OutputFor each test case you should output one line with the weight of the lightest prefixlessn-element language over the alphabetAk.ExampleSample input:1\r\n3 2\r\n2 5Sample output:16",
  "sample_input": "Sample input:1\r\n3 2\r\n2 5Sample output:16",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LITELANG",
  "scraped_at": "2025-08-17 00:33:04"
}