{
  "problem_code": "problems",
  "title": "Monodigital Representations",
  "tags": [],
  "text": "LetKbe a decimal digit different from0. We say that an\r\narithmetic expression is aK-representation of the integer Xif a value\r\nof this expression is X and if it contains only numbers composed of a\r\ndigit K.\r\n(All the numbers are of course decimal). The following arithmetical\r\noperations are allowed in the expression: addition, subtraction,\r\nmultiplication and division. Round brackets are\r\nallowed too. Division may appear only when a dividend is a multiple of\r\na\r\ndivisor.ExampleEach of the following expressions is the 5-representation of the number 12:5+5+(5:5)+(5:5)(5+(5))+5:5+5:555:5+5:5(55+5):5Thelengthof theK-representation is the number of occurrences of\r\ndigitKin the expression. In the example above the first two representations have the length 6, the third - 5, and the forth - 4.TaskWrite a program which:reads the digitKand the series of numbers from the standard input,verifies for each number from the series, whether it has aK-representation\r\n  of length at most 8, and if it does, then the program finds the minimal length of this representation,writes results to the standard output.InputThe number of test cases t is in the first line of input, then t test cases follow separated by an empty line.\r\nThe first line of each test case contains digitK,Kis en element of\r\n{1,...,9}. The second line\r\ncontains number n,1<=n<=10. In the followingnlines there is the series  of natural numbersa1,...,an,1<=ai<=32000(fori=1,..,n), one number in each line.OutputThe output for each test case composes ofnlines. Thei-th line should\r\ncontain:exactly one number which is the minimal length ofK-representation of ai,\r\n  assuming that such a representation of length not grater then 8 exists,one word NO, if the minimal length of theK-representation of the numberaiis grater than 8.ExampleSample input:1\r\n5\r\n2\r\n12\r\n31168Sample output4\r\nNO",
  "sample_input": "Sample input:1\r\n5\r\n2\r\n12\r\n31168Sample output4\r\nNO",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MONODIG",
  "scraped_at": "2025-08-17 00:33:17"
}