{
  "problem_code": "problems",
  "title": "The Game of Polygons",
  "tags": [],
  "text": "Two players take part in the gamepolygons. A convex polygon withnvertices divided byn-3diagonals inton-2triangles is necessary.\r\nThese diagonals may intersect in vertices of the polygon only. One of the triangles is black and the\r\nremaining ones are white. Players proceed in alternate turns. Each player, when\r\nits turn comes, cuts away one\r\ntriangle from the polygon. players are allowed to cut off triangles along the given\r\ndiagonals. The winner is the player who cuts away the black triangle.NOTE: We call a polygonconvexif a segment joining any two points of\r\nthe polygon is contained in the polygon.TaskWrite a program which:reads from the standard input the description of the polygon,verifies whether the player who starts the game has a winning strategy,writes the result to the standard output.InputThe number of test cases t is in the first line of input, then t test cases follow separated by an empty line.\r\n\r\nThe first line of each test case contains an integern,4 ≤ n ≤\r\n50000. This is the number of vertices in the polygon. The vertices of the polygon\r\nare numbered, clockwise, from0ton-1.The nextn-2lines comprise descriptions of triangles in the polygon. In thei+1-th line,1 ≤ i ≤ n-2, there are three non-negative\r\nintegersa, b, cseparated by single spaces. Theses are numbers of vertices of thei-th triangle. The first triangle in a\r\nsequence is black.OutputThe output for each test case should have one line with the word:YES, if the player, who starts the game has a winning\r\n  strategy,NO, if he does not have a winning strategy.ExampleSample input:1\r\n6\r\n0 1 2\r\n2 4 3\r\n4 2 0\r\n0 5 4Sample output:YESWarning: large Input/Output data, be careful with certain languages",
  "sample_input": "Sample input:1\r\n6\r\n0 1 2\r\n2 4 3\r\n4 2 0\r\n0 5 4Sample output:YES",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/POLYGAME",
  "scraped_at": "2025-08-17 00:33:18"
}