{
  "problem_code": "problems",
  "title": "The Altars",
  "tags": [],
  "text": "According to Chinese folk beliefs evil spirits can move only on a\r\nstraight line. It is of a great importance when temples are built. The\r\ntemples are constructed on rectangular planes with sides parallel to\r\nthe\r\nnorth - south or east - west directions.\r\nNo two of the rectangles have common points. An entrance is situated in\r\nthe middle of one of four walls and its width is equal to the half of\r\nthe\r\nlength of the wall. An altar appears in the center of the temple, where\r\ndiagonals of the rectangle intersect. If an evil spirit appears in this\r\npoint, a temple will be profaned. It may happen only if there exists a\r\nray which runs from an altar, through an entrance to infinity and\r\nneither intersects nor touches walls of any temple (on a plane parallel\r\nto the plane of a construction area),\r\ni.e. one can draw at a construction area a line which starts at the\r\naltar and\r\nruns to the infinity without touching any wall.TaskWrite a program which:reads descriptions of the temples from the standard input,verifies which temples could be profaned,writes their numbers to the standard output.InputThe number of test cases t is in the first line of input, then t test cases follow separated by an empty line.\r\nIn the first line of each test case one integern, the number of temples1 <= n <= 1000,is written.In each of the followingnlines there is a description of one temple (ini-th line a description\r\nof thei-th\r\ntemple). The description of a temple consists of four non-negative\r\nintegers,\r\nnot greater than 8000 and a letter E, W, S or N. Two first numbers are\r\ncoordinates of a temple's northern-west corner and two following are\r\ncoordinates of an opposite southern-east corner. In order to\r\nspecify coordinates of a point first we give its geographical\r\nlongitude, which increases from the\r\nwest to the east, and then its latitude, which increases from the south\r\nto the\r\nnorth. The fifth element of the description indicates the wall with the\r\nentrance (E - Eastern, W - Western, S - Southern, N - Northern).\r\nThe\r\nelements of the temple's description are separated by single spaces.OutputIn the following lines of the output for each test case your program should\r\nwrite in ascending order numbers of the temples, which may\r\nbe profaned by an evil spirit. Each number is placed in a separate\r\nline. If there are no such numbers, you should\r\nwrite one word:\r\nNONE.ExampleSample input6\r\n1 7 4 1 E\r\n3 9 11 8 S\r\n6 7 10 4 N\r\n8 3 10 1 N\r\n11 4 13 1 E\r\n14 8 20 7 WSample output1\r\n2\r\n5\r\n6The picture shows the temples described in the example. The dashed lines show possible routes of evil spirits.",
  "sample_input": "6\r\n1 7 4 1 E\r\n3 9 11 8 S\r\n6 7 10 4 N\r\n8 3 10 1 N\r\n11 4 13 1 E\r\n14 8 20 7 W",
  "sample_output": "1\r\n2\r\n5\r\n6",
  "link": "https://www.spoj.com/problems/ALTARS",
  "scraped_at": "2025-08-17 00:33:25"
}