{
  "problem_code": "problems",
  "title": "The Map",
  "tags": [],
  "text": "After a new administrative division of Byteland cartographic office works on a\r\nnew demographic map of the country. Because of technical reasons only\r\na few colors can be used. The map should be colored so that regions with the same or similar\r\npopulation (number of inhabitants) have the same color. For a given colorkletA(k) be the number, such that:at least half of regions with colorkhas population not greater thanA(k)at least half of regions with colorkhas population not less thanA(k)A coloring error of a regionis an absolute value of the difference betweenA(k) and the region's population.A cumulative erroris a sum of coloring errors of all regions. We are\r\nlooking for an optimal coloring of the map (the one with the minimal cumulative\r\nerror).TaskWrite a program which:reads the population of regions in Byteland from the standard input,computes the minimal cumulative error,writes the result to the standard output.InputThe number of test cases t is in the first line of input, then t test cases follow separated by an empty line.\r\nIn the first line of each test case an integernis written, which is the number of regions in\r\nByteland,10 < n < 3000. In the second line the numbermdenoting thenumber of colors used to color the map is written,2 ≤ m ≤ 10. In each\r\nof the followingnlines there is one non-negative integer - a\r\npopulation of one of the regions of Byteland. No population exceeds230.OutputYour program should write for each test case one integer number equal to a minimal\r\ncumulative error, which can be achieved while the map is colored (optimally).ExampleSample input:1\r\n11\r\n3\r\n21\r\n14\r\n6\r\n18\r\n10\r\n2\r\n15\r\n12\r\n3\r\n2\r\n2Sample output:15",
  "sample_input": "Sample input:1\r\n11\r\n3\r\n21\r\n14\r\n6\r\n18\r\n10\r\n2\r\n15\r\n12\r\n3\r\n2\r\n2Sample output:15",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MAP",
  "scraped_at": "2025-08-17 00:33:16"
}