{
  "problem_code": "problems",
  "title": "Soldiers on Parade",
  "tags": [],
  "text": "Protocol is really weird in Byteland. For instance, it is required that, when presenting arms before an officer, soldiers should stand in a single row (at positions numbered from 1 ton). Soldiers may have one of 4 possible ranks, distinguished by the number of squiggles on the epaulets (between 1 and 4). Soldiers standing beside each other must have a difference in rank of at least two squiggles. Moreover, there are additional sets of rules (different for every province). Each rule states that soldiers standing at some given positions of the row must differ in rank by at least a squiggle.Starting from the new year onwards, some provinces are changing their set of protocol rules. As the Senior Military Secretary of Protocol, it is your task to approve the new rules. To your surprise, some of the provinces have put forward protocol rules which are quite impossible to fulfill, even if the soldiers were to be specially selected for the purpose of presenting arms. Detect all such offending provinces and on no account approve their laws.InputThe first line of input contains a single positive integert≤ 10 - the number of provinces which are proposing new laws.tsets of rules follow, separated by empty lines.Each set of rule begins with a line containing two non-negative integersnp(n≤ 100000,p≤ 100000) - the number of soldiers arranged and the number of rules proposed in the province, respectively. Each of the nextplines contains a single rule: an integerbi(2 ≤bi≤n), followed bybiintegersa1,a2...abi(1 ≤ak≤n). Such a rule means that soldiers standing at positionsa1,a2...abimust all be of different rank.OutputFor every set of rules presented at input, output a single line containing the wordrejectedif no unit of soldiers can be arranged in accordance with protocol, or the wordapprovedin the opposite case.ExampleInput:2\r\n\r\n2 1\r\n2 1 2\r\n\r\n5 2\r\n3 1 3 2\r\n4 2 3 4 5Output:approved\r\nrejected",
  "sample_input": "Input:2\r\n\r\n2 1\r\n2 1 2\r\n\r\n5 2\r\n3 1 3 2\r\n4 2 3 4 5Output:approved\r\nrejected",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SOPARADE",
  "scraped_at": "2025-08-17 00:33:04"
}