{
  "problem_code": "problems",
  "title": "Chocolate",
  "tags": [],
  "text": "We are given a bar of chocolate composed ofm × nsquare pieces. One should break the chocolate into single squares. Parts of the chocolate may be broken along the vertical and horizontal lines as indicated by the broken lines in the picture.A single break of a part of the chocolate along a chosen vertical or horizontal line divides that part into two smaller ones. Each break of a part of the chocolate is charged a cost expressed by a positive integer. This cost does not depend on the size of the part that is being broken but only depends on the line the break goes along. Let us denote the costs of breaking along consecutive vertical lines withx1,x2...xm-1and along horizontal lines withy1,y2...yn-1.The cost of breaking the whole bar into single squares is the sum of the successive breaks. One should compute the minimal cost of breaking the whole chocolate into single squares.For example, if we break the chocolate presented in the picture first along the horizontal lines, and next each obtained part along vertical lines then the cost of that breaking will bey1+y2+y3+4×(x1+x2+x3+x4+x5).TaskWrite a program that for each test case:Reads the numbersx1,x2...xm-1andy1,y2...yn-1Computes the minimal cost of breaking the whole chocolate into single squares, writes the result.InputOne integer in the first line, stating the number of test cases, followed by a blank line. There will be not more than 20 tests.For each test case, at the first line there are two positive\r\nintegersmandnseparated by a single space, 2 ≤m,n≤ 1000. In the successivem-1 lines there\r\nare numbersx1,x2...xm-1, one per line, 1 ≤xi≤ 1000. In the successiven-1 lines there\r\nare numbersy1,y2...yn-1, one per line, 1 ≤yi≤ 1000.The test cases will be separated by a single blank line.OutputFor each test case : write one integer - the minimal cost of breaking the whole chocolate into single squares.ExampleInput:1\r\n\r\n6 4\r\n2\r\n1\r\n3\r\n1\r\n4\r\n4\r\n1\r\n2Output:42",
  "sample_input": "Input:1\r\n\r\n6 4\r\n2\r\n1\r\n3\r\n1\r\n4\r\n4\r\n1\r\n2Output:42",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CHOCOLA",
  "scraped_at": "2025-08-17 00:33:21"
}