{
  "problem_code": "problems",
  "title": "Bicycle",
  "tags": [],
  "text": "Peter likes to go to school by bicycle. But going by bicycle on sidewalks is forbidden and going along roads is dangerous. That's why Peter travels only along special bicycle lanes. Fortunately Peter's home and school are in the immediate proximity of such paths. In the city where Peter lives there are only two bicycle lanes. Both lanes have the form of a circle. At the points where they cross it is possible to move from one path to the other. Peter knows the point where he enters the road and the point at which it is necessary to leave to enter the school. Peter is interested in the question: \"What is the minimal distance he needs to cover along the lanes to get to school?\"Inputt– the number of test cases [t<=100],\r\nthenttest cases follow.The first 2 lines of each test case contain the description of the bicycle lanes:x1 y1 r1- 3 integers (x1, y1- coordinates of the center of the 1st circle,r1- radius of 1st circle)x2 y2 r2- 3 integers (x2, y2- coordinates of the center of the 2nd circle,r2- radius of 2nd circle)-200 <=x1, x2, y1, y2<= 2000 <=r1, r2<= 200Next 2 lines contain the coordinates of Peter's home and school:px1, py1- 2 real numberspx2, py2- 2 real numbersYou may assume that this points lie on the circle with high accuracy (10-8). Both points may lie on the same circle.OutputFor each test case output the minimum distance that Peter needs to go from home to get to school. The precision of the answer must be under 0.0001. If it's impossible to get to school using the bicycle lanes output -1.ExampleInput:3\r\n\r\n0 0 5\r\n4 0 3\r\n3.0 4.0\r\n1.878679656440357 -2.121320343559643\r\n\r\n0 0 5\r\n4 0 3\r\n4.0 3.0\r\n4.0 -3.0\r\n\r\n0 0 4\r\n10 0 4\r\n4.0 0.0\r\n6.0 0.0Output:8.4875540166\r\n6.4350110879\r\n-1",
  "sample_input": "Input:3\r\n\r\n0 0 5\r\n4 0 3\r\n3.0 4.0\r\n1.878679656440357 -2.121320343559643\r\n\r\n0 0 5\r\n4 0 3\r\n4.0 3.0\r\n4.0 -3.0\r\n\r\n0 0 4\r\n10 0 4\r\n4.0 0.0\r\n6.0 0.0Output:8.4875540166\r\n6.4350110879\r\n-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BICYCLE",
  "scraped_at": "2025-08-17 00:33:21"
}