{
  "problem_code": "problems",
  "title": "Johnny and the Watermelon Plantation",
  "tags": [],
  "text": "Shortly after his abdication from the Bytelandian throne Johnny decided to go into farming. Water melons were a natural choice as his first crop ever, since they seemed easy enough to grow and look after. So, he sold all his beer bottles and for the money he purchased a 1km × 1km square field. Here it was that he planted the water melon seeds. (The word 'planted' is really a bit of a euphemism for walking across a field gorging on a water melon and spitting out the pips but, for the sake of politeness, let us leave it this way).To everyone's surprise a lot of the seeds sprouted stems, and soon enough many of the plants showed signs of fruit (and some had even more than one!). Then quite unexpectedly, when the water melons were still a little too unripe to eat, winter set in. Johnny knows that he has to construct a green house to protect the field but, with his rather limited budget, he cannot afford the glass to cover the whole area. He has decided that it is enough thatkfruit survive the ordeal under a glazed roof. For reasons of architectural planning in Byteland it is necessary that the green house be a rectangle with sides parallel to the edges of the plot.You have been requested to help Johnny minimise investment costs. Since glass is paid for by the square meter, design a green house with the smallest possible area fulfilling the imposed conditions.InputThe first line of input contains the integert≤ 100, the number of test cases.ttest cases follow.Every test case begins with a line containing two integersn k, denoting the total number of plants and the number of water melon fruit to be protected, respectively (1 ≤n≤ 1000, 1 ≤k≤ 106,kdoesn't exceed the total number of fruit in the plantation). Each of the nextnlines describes a single plant, thei-th line containing three integersxiyifi- the X and Y coordinates of the plant, and the number of water melon fruit on it, respectively (1 ≤xi, yi, fi≤ 1000).OutputFor each test case output a single integer, denoting the area of the smallest possible rectangular glass house with horizontal and vertical edges, sufficient to cover at leastkfruit of the plantation.ExampleInput:1\r\n6 11\r\n1 1 2\r\n1 2 2\r\n3 1 2\r\n3 2 3\r\n4 2 5\r\n3 3 2Output:2",
  "sample_input": "Input:1\r\n6 11\r\n1 1 2\r\n1 2 2\r\n3 1 2\r\n3 2 3\r\n4 2 5\r\n3 3 2Output:2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/WMELON",
  "scraped_at": "2025-08-17 00:33:14"
}