{
  "problem_code": "problems",
  "title": "Connections",
  "tags": [],
  "text": "Byteotian Ministry of Infrastructure has decided to create a computer program\r\nthat helps to find quickly the lengths of routes between arbitrary towns. It\r\nwould be small wonder if the inhabitants of Byteotia always wanted to find the\r\nshortest route. However, it happens that they want to know thek-th\r\nshortest route. Moreover, cycles in routes are possible, i.e. routes that have\r\nrecurring towns.For example, if there are 4 routes between two towns and their lengths are 2, 4, 4 and 5, then the length of the shortest connection is 2, the second shortest is 4, the third is 4, and the fourth is 5.TaskWrite a program that for each test case:Reads a description of Byteotian road network and\r\n    queries concerning lengths of journey routes.Computes and writes answers to the queries read.InputOne integer in the first line, stating the number of test cases, followed by a blank line. There will be not more than 15 tests.For each test case, at the first line, there are two positive integersnandm, separated by a single space, 1 ≤n≤ 100, 0 ≤m≤n2-n. They are the number of towns in Byteotia and the number of roads connecting the towns, respectively. The towns are numbered from 1 ton.In each ofmsuccessive lines there are three integers separated by single spaces:a,bandl,a≠b, 1\r\n≤l≤ 500. Each triple describes one one-way road of lengthlenabling to move from the townatob. For each two towns there\r\nexist at most one road that enables to move in the given direction.In the following line there is one integerq, 1 ≤q≤ 10000, denoting the number of queries. In the successiveqlines there are queries written, one per line. Each query has a form of three integers separated by single spaces:c,dandk, 1 ≤k≤ 100. Such a query refers to the length of thek-th shortest route from the towncto the townd.The test cases will be separated by a single blank line.OutputFor each test case, your program should write the answers to the queries read, one answer per line. In the i-th line the answer to the i-th query should be written: one integer equal to the length of the route being sought or -1, when such a route does not exist.Each test case should be separated by a single blank line.ExampleInput:1\r\n\r\n5 5\r\n1 2 3\r\n2 3 2\r\n3 2 1\r\n1 3 10\r\n1 4 1\r\n8\r\n1 3 1\r\n1 3 2\r\n1 3 3\r\n1 4 2\r\n2 5 1\r\n2 2 1\r\n2 2 2\r\n1 1 2Output:5\r\n8\r\n10\r\n-1\r\n-1\r\n3\r\n6\r\n-1",
  "sample_input": "Input:1\r\n\r\n5 5\r\n1 2 3\r\n2 3 2\r\n3 2 1\r\n1 3 10\r\n1 4 1\r\n8\r\n1 3 1\r\n1 3 2\r\n1 3 3\r\n1 4 2\r\n2 5 1\r\n2 2 1\r\n2 2 2\r\n1 1 2Output:5\r\n8\r\n10\r\n-1\r\n-1\r\n3\r\n6\r\n-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CONNECT",
  "scraped_at": "2025-08-17 00:33:03"
}