{
  "problem_code": "problems",
  "title": "Naptime",
  "tags": [],
  "text": "Goneril is a very sleep-deprived cow. Her day is partitioned into\r\nN (3 ≤ N ≤ 3,830) equal time periods but she can spend only B (2\r\n≤ B < N) not necessarily contiguous periods in bed. Due to her\r\nbovine hormone levels, each period has its own utility Ui(0 ≤\r\nUi≤ 200,000), which is the amount of rest derived from sleeping\r\nduring that period. These utility values are fixed and are independent\r\nof what Goneril chooses to do, including when she decides to be in\r\nbed.With the help of her alarm clock, she can choose exactly which\r\nperiods to spend in bed and which periods to spend doing more\r\ncritical items such as writing papers or watching baseball. However,\r\nshe can only get in or out of bed on the boundaries of a period.She wants to choose her sleeping periods to maximize the sum of the\r\nutilities over the periods during which she is in bed. Unfortunately,\r\nevery time she climbs in bed, she has to spend the first period\r\nfalling asleep and gets no sleep utility from that period.The periods wrap around in a circle; if Goneril spends both periods\r\nN and 1 in bed, then she does get sleep utility out of period 1.What is the maximum total sleep utility Goneril can achieve?Inputt– the number of test cases, thenttest cases follow.Each test case takes the following form:Two space-separated integers:NandB, thenNlines follows.Each line contains a single integer,Ui, between 0 and 200,000 inclusive.OutputFor each test case output a single integer, the maximum total sleep utility Goneril can achieve.ExampleInput:1\r\n5 3\r\n2\r\n0\r\n3\r\n1\r\n4Output:6ExplanationThe day is divided into 5 periods, with utilities 2, 0, 3, 1, 4 in that\r\norder. Goneril must pick 3 periods.Goneril can get total utility 6 by being in bed during periods 4,\r\n5, and 1, with utilities 0 [getting to sleep], 4, and 2 respectively.",
  "sample_input": "Input:1\r\n5 3\r\n2\r\n0\r\n3\r\n1\r\n4Output:6",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NAPTIME",
  "scraped_at": "2025-08-17 00:33:04"
}