{
  "problem_code": "problems",
  "title": "Kingdom of Equality",
  "tags": [],
  "text": "There is a kingdom called DomKi. There areNcities andN – 1bidirectional roads in DomKi. The cities of DomKi are connected to each other in such a way that it forms aTree.Recently a dangerous virus called corona has attacked the kingdom and the people in several cities are affected by the disease COVID-19 (which is caused by the corona virus). The infection of the virus has been declared as an epidemic in DomKi.As COVID-19 - spreads from person to person in close proximity, similar to other respiratory illnesses, such as the flu, some cities in DomKi are under lockdown to ensure social distancing. Due to lockdown, some roads also became unavailable to use.Now there is a group of people who may stay in different cities. For an important issue they all want to meet in a specific city if possible. But there is a strange rule is followed by them. They all want to choose a city in such a way that the selected city is reachable by all of them and everyone has to travel the same distance from their residence city to the selected city through the shortest path.The distance between two cities in DomKi is the number of roads between them in the shortest path.Suppose there are 10 cities in DomKi numbered from 1 to 10 and 9 roads shown in the above picture. The number (0 or 1) associated with each road determines whether this road is available or not (Note that, 0 means the road is not available and 1 means available.)Let there be a group of2people, one each in cities4and6, who want to meet. Then there is a possible set (sayS) of4different cities they can select, which is,S = {2, 1, 3, 7}. The shortest distance from city4to each city inSand city6to each city inSisidentical. (Note cities 5, 9 and 10 are also the same distance away from cities 4 and 6 but they are not reachable.)Now the task is to count the size of the setSfor a given group of people.It is to be observed that a group may consist of only 1 person.InputThe first line of the input contains a positive integersN, denotes the number of cities in the kingdom.The nextN - 1lines contains the description of the roads.Each road is described by three positive integersu, v, k, whereuandvdenotes two cities which is connected by this road andkdenotes the availability of the road (0or1).The next line contains a positive integerQ, denotes the number of query.Each of the nextQlines will describe a group of people, which is a query to be answered. Each line will begin with a positive integergi, which denotes the number of people in theithgroup. Then in the same linegispace separated numbers will be given which denotes the cities where the people of this group reside.Note, that there can be more than one person in each city.1 ≤ N, Q, u, v ≤ 2 × 105.u ≠ v.1 ≤ u, v ≤ N0 ≤ k ≤ 11 ≤ gi≤ 2 × 105Sum of all gi≤ 2 × 105.OutputFor each query outputthe size of the set Sin a new line which is described in the problem statement.ExampleInput:10\r\n1 2 1\r\n1 3 1\r\n3 7 1\r\n2 4 1\r\n2 6 1\r\n2 5 0\r\n5 9 1\r\n5 10 1\r\n4 8 1\r\n1\r\n2 4 6Output:4",
  "sample_input": "Input:10\r\n1 2 1\r\n1 3 1\r\n3 7 1\r\n2 4 1\r\n2 6 1\r\n2 5 0\r\n5 9 1\r\n5 10 1\r\n4 8 1\r\n1\r\n2 4 6Output:4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/KEQUALITY",
  "scraped_at": "2025-08-17 00:33:06"
}