{
  "problem_code": "problems",
  "title": "Acronym",
  "tags": [],
  "text": "An acronym is made of up the initial letter(s) of the words in a phrase, such as EU (European Union) and BREXIT (BRitish EXIT). In this problem, we can also either ignore or consider the conjunction \"and\", and the following adpositions \"in\", \"on\", \"at\", \"to\", \"of\", \"from\", \"for\" and \"with\" when making the acronym, such as BENELUX (BElgium, NEtherlands and LUXembourg) and RADAR (RAdio Detection And Ranging).Given an acronymA, and a list ofNstringsW1,W2...WN, you would like to find out the number of possible combinations of making the given acronym by using all the N strings following their order. That is, the acronym must be made up of at least one initial letter of each word, except the above-mentioned conjunction and adpositions (either skip or use it). Both A and the N strings only consist of lowercase latin letters.InputThe first line is the number of test casesT. (1 ≤ T ≤ 20)For each test case, it starts with one integerN. (1 ≤ N ≤ 200)Next line is a stringA. (1 ≤ |A| ≤ 104)Following N lines, each consisting of one stringWi. (1 ≤ |Wi| ≤ 50)It is guaranteed that W1is neither conjunction nor adposition.OutputOutput one integer indicating the number of possible combinations.ExampleInput:3\r\n3\r\nduckhim\r\nduck\r\nhello\r\nmoto\r\n\r\n7\r\nnatiofforessaa\r\nnational\r\noffice\r\nfor\r\nforest\r\nsafety\r\nin\r\naachen\r\n\r\n4\r\nwhiskey\r\nwhat\r\nis\r\nsecret\r\nkeyOutput:0\r\n4\r\n1ExplanationIn case 1, no combination is possible.In case 2, there are four possible combinations:NATIonalOFfice forFOREStSAfety inAachenNATIonalOFfice forFOREStSafety inAAchenNATIonalOfficeForFOREStSAfety inAachenNATIonalOfficeForFOREStSafety inAAchenIn case 3, only one possible combination exists:WHatIsSecretKEY",
  "sample_input": "Input:3\r\n3\r\nduckhim\r\nduck\r\nhello\r\nmoto\r\n\r\n7\r\nnatiofforessaa\r\nnational\r\noffice\r\nfor\r\nforest\r\nsafety\r\nin\r\naachen\r\n\r\n4\r\nwhiskey\r\nwhat\r\nis\r\nsecret\r\nkeyOutput:0\r\n4\r\n1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ACRYM",
  "scraped_at": "2025-08-17 00:33:08"
}