{
  "problem_code": "problems",
  "title": "Breaking Math",
  "tags": [],
  "text": "Walter is a high school chemistry teacher. After being diagnosed with stage 3A, inoperable lung cancer, Walter is devastated. Realizing he does not have much time left, a desperate Walter resorts to cooking crystal methamphetamine, in order to provide for his treatment and family. And guess what, he mixes up with some really horrible people in the process.The worst of them is Heisenberg, a badass physicist and the ultimate drug lord. Walter needs Heisenberg’s active support to distribute the methamphetamine he produces. Alas, Heisenberg is a cautious man. Heisenberg is initially sceptical about Walter, and decides to give the following problem to Walter in order to prove his worth.w(n)is defined to be the number of distinct prime factors ofn, for example:w(1) = 0, w(2) = 1, w(3) = 1, w(4) = 1, w(5) = 1, w(6) = 2, w(30) = 3f(n, k) = ∑ kw(i)where1 ≤ i ≤ nFor instance,f(6, 2) = 2w(1)+ 2w(2)+ 2w(3)+ 2w(4)+ 2w(5)+ 2w(6)= 13Givennandk, calculatef(n, k).InputThe first line contains an integert, denoting the number of test cases. Each of the nexttlines contains two integers,nandk, separated by a single space. Sum ofnwill not exceed1011in an input file.Constraints1 ≤ t ≤ 1001 ≤ n ≤ 10111 ≤ k ≤ 101 ≤ ∑n ≤ 1011OutputFor each case, output a line of the formatCase X: Y, whereXis the case number, starting from1, andYis the required answer. You can safely assume that the answer will fit in asigned 64 bit integer.ExampleInput:10\r\n1 1\r\n2 2\r\n3 3\r\n4 4\r\n5 5\r\n6 6\r\n7 7\r\n8 8\r\n9 9\r\n10 10Output:Case 1: 1\r\nCase 2: 3\r\nCase 3: 7\r\nCase 4: 13\r\nCase 5: 21\r\nCase 6: 61\r\nCase 7: 85\r\nCase 8: 113\r\nCase 9: 145\r\nCase 10: 271",
  "sample_input": "Input:10\r\n1 1\r\n2 2\r\n3 3\r\n4 4\r\n5 5\r\n6 6\r\n7 7\r\n8 8\r\n9 9\r\n10 10Output:Case 1: 1\r\nCase 2: 3\r\nCase 3: 7\r\nCase 4: 13\r\nCase 5: 21\r\nCase 6: 61\r\nCase 7: 85\r\nCase 8: 113\r\nCase 9: 145\r\nCase 10: 271",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BBAD",
  "scraped_at": "2025-08-17 00:33:11"
}