{
  "problem_code": "problems",
  "title": "Asacoco Prescription",
  "tags": [],
  "text": "Watame needs to consume asacoco. However, consuming too much asacoco can be dangerous, so she consults with a doctor.The doctor recommends her a limit for every day. LetAibea real numberdenoting the limit of asacoco allowed to be consumed in thei-th day.Uniquely, the arrayAiis a non-decreasing arithmetic sequence.An elementAican be represented as A0+ i * d where d is a constant real number. It is guaranteed that A0is an integer.After receiving the doctor's prescription, Watame went home only to realise the receipt has a different array from the recommendation given from the doctor.What was printed on the receipt was an array of integersSiwith a note thatSi= [Ai].Here,[x]denotes the largest integer less than or equal tox(floor function).For rehabilitation, Watame is forced to minimized(since minimizingdminimizesAitoo, thus less asacoco for Watame) such that the information printed on the receipt is still valid.If there exists a validd, it can be represented as a fractionP / QwhereGCD(P, Q) = 1. Print the answer in the form ofP * Q-1modulo109+ 7.There can be cases where the receipt can be faulty (the cashier and the doctor may as well be drunk of asacoco) and there is no validd. In this case, print-1instead.InputThe first line contains an integerN, the size of the arrayS.The next lines containsNintegersSi.OutputPrint an integer representing the answer in the form ofP * Q-1modulo109+ 7.If there does not exist a validd(the receipt may be faulty), print -1 instead.ExampleInput 1:6\r\n1 2 3 4 5 6Output 1:1Input 2:5\r\n3 3 3 3 4Output 2:250000002Input 3:2\r\n4 1Output 3:-1ExplanationThe answers for sample 1 and 2 in decimal format is 1.0 and 0.25 respectively.Constraints1 ≤ N ≤ 1051 ≤ Si≤ 109",
  "sample_input": "Input 1:6\r\n1 2 3 4 5 6Output 1:1",
  "sample_output": "Input 2:5\r\n3 3 3 3 4Output 2:250000002",
  "link": "https://www.spoj.com/problems/CPDUEL5B",
  "scraped_at": "2025-08-17 00:33:10"
}