{
  "problem_code": "problems",
  "title": "Battle Of The Bastards",
  "tags": [],
  "text": "Chessis a two-player strategy board game played on a8 × 8board. Each player begins with16pieces where each type of piece moves differently. Player 1 has all the white pieces and player 2 all the black ones, with white being the one to move first and then players take turns alternatingly until the game ends. The game is played on a square board of eight rows and eight columns. The rows are called ranks and are numbered 1 to 8 from bottom to top from white’s perspective. Similarly, the columns are called files and are denoted fromatohfrom left to right according to white’s perspective. The objective of the game is to threaten the opponent’s king in such a way that escape is not possible, i.e., checkmate the opponent. If a player’s king is threatened, it is said to be in check and the player must remove the king from check on the next move by either moving to a safe square or capturing or blocking the attacking piece(s). The figure shows the starting position for the game of chess.In this problem, we’ll be considering a slightly modified version of chess with the following rules:The game will be played on aN × Nboard.The game will consist of exactly 4 pieces - The white king, the black king, and two white rooks. All four pieces must be placed on different squares of the board.Kings can move to any adjacent square (horizontally, vertically, or diagonally), unless the square is outside the board or occupied by a friendly piece or if the move would place the king under check.Rooks can move to any square in the same rank or file, but not by jumping over other pieces. Also, it cannot land on a square occupied by a friendly piece.A pieceXis threatened by another enemy pieceY, iffYcan reachXin exactly one legal move.A pieceXcan capture another enemy pieceYiffXcan reachYin exactly one legal move. On capturing, pieceYis removed from the board andXtakes its place. Note that ifXis the king, then it cannot captureYifYis guarded by an enemy piece. That is the king can never move and put itself in danger where it is attacked by an enemy piece.The two kings cannot ever be in adjacent (horizontally, vertically or diagonally) squares.The objective of the game is to place the four pieces on unique squares of the board in such a way that if it is black’s move, then the black king is attacked and has no legal moves. That is, the black king must be threatened by at least one of the white rooks and has no way to move to a safe square or eliminate the checks (by capturing the attacking pieces if not guarded). Note that it is not necessary for the board configuration to be legal following the exact rules of chess. That is, ifN = 8there might be valid configurations in our modified game that might never appear in a game of chess. Like the figure shown below, which can never occur in a proper game of chess given that it is black’s turn to move, although it would be a perfectly valid configuration in our game.GivenN, you need to count how many ways you can place one white king, one black king, and two white rooks in the chessboard such that the black king is threatened and has no way to escape the threat given it is black’s turn to move. Two configurations are different if either any of the squares contain different pieces or one square contains a piece but the other does not. Note that every square is uniquely represented by its rank and file and hence mirrored or reversed configurations of the same configuration will be considered as different configurations. Also note that the white king, black king, and white rooks are distinguishable but the two white rooks are identical. So in the figure above, if we swap the two rooks, the new configuration will be the same as the old one.Since the number of ways can be huge, you need to output it modulo7340033.InputThe first line contains the number of test cases denoted byT. The nextTlines contain the board dimensionN.Constraints1 ≤ T ≤ 201 ≤ N ≤ 105OutputFor each case, output one line. First output the case number then the number of valid ways modulo7340033. Please refer to the sample i/o for more clarity on the format.ExampleInput:8\r\n1\r\n2\r\n3\r\n4\r\n5\r\n6\r\n7\r\n8Output:Case 1: 0\r\nCase 2: 0\r\nCase 3: 232\r\nCase 4: 1432\r\nCase 5: 5188\r\nCase 6: 14536\r\nCase 7: 34464\r\nCase 8: 72392ExplanationFor a8 × 8board, here are some valid configurations:For all of these boards, the black king is attacked and has nowhere to go. Also, both the white rooks are placed on the board and the kings are not in adjacent positions.And here are some invalid ones:For the first board, the black king can move and capture the attacking white rook thereby removing the check and moving to a safe square.For the second board, although the black king is attacked and cannot capture anything because all the pieces are guarded, the two kings are adjacent which is not allowed. Hence it is not a valid checkmate position.For the third board, it is a stalemate. That is the black king has nowhere to go but it is also not attacked. So no checkmate.For the fourth board, it is checkmate and the black king has nowhere to go. But we haven’t placed both the rooks on the board and hence this is not a valid position.",
  "sample_input": "Input:8\r\n1\r\n2\r\n3\r\n4\r\n5\r\n6\r\n7\r\n8Output:Case 1: 0\r\nCase 2: 0\r\nCase 3: 232\r\nCase 4: 1432\r\nCase 5: 5188\r\nCase 6: 14536\r\nCase 7: 34464\r\nCase 8: 72392",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BATTLECRY",
  "scraped_at": "2025-08-17 00:33:09"
}