{
  "problem_code": "problems",
  "title": "Mines of Moria II",
  "tags": [],
  "text": "This problem is similar but not identical to the problemMORIA.In the Mines of Moria, the job of Gakrobera Silverborn the dwarf is still to load minecarts withNstones. The stones are numbered, from 1 toN, and a given minecart can only be loaded with consecutive stones.The minecart have an optimal loadL.1Each stone has an integer weight between 1 kg andLkg. The score of a minecart loaded withWkg of stones is(W−L)2. After all stones have been loaded in minecarts, the total score is the sum of the score of each minecarts. The lower the total score is, the better it is.To help Gakrobera, find the best possible way to load minecarts, given the weights of each stone from1toN.For example, with an optimal loadL= 2000 kg, given four stones of 700 kg, Gakrobera will prefer to load them all in a single minecart (total score8002= 640 000). But given four stones of 800 kg, Gakrobera will prefer to load two minecarts with two stones (total score4002+ 4002= 320 000).Beware: the situation in the Mines of Moria has gone wild, the Dwarves push cupidity too far, the optimal load can be very high! The Balrog will soon be awaken…InputThe input begins with an integerT(1 ≤T≤ 1000), the number of test cases. ThenTtest cases follow.Each test case is a line of space-separated integers. The first integerL(1 ≤L≤ 106) is the optimal load. The second integerN(1 ≤N≤ 106) is the number of stones to be loaded. Next comeNintegersw1, …,wN(1 ≤wi≤L), wherewiis the weight of the stonei.OutputFor each test case, output the smallest possible total score.Exampleinput3\r\n2000 4 700 700 700 700\r\n2000 4 800 800 800 800\r\n2000 10 100 200 300 400 500 600 700 800 900 1000output640000\r\n320000\r\n270000Compared to the situation in the problemMORIA, the optimal load is not fixed.",
  "sample_input": "input3\r\n2000 4 700 700 700 700\r\n2000 4 800 800 800 800\r\n2000 10 100 200 300 400 500 600 700 800 900 1000output640000\r\n320000\r\n270000",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MORIA2",
  "scraped_at": "2025-08-17 00:33:16"
}