{
  "problem_code": "problems",
  "title": "Minesweeper",
  "tags": [],
  "text": "Have you ever played Minesweeper? It’s a cute little game which comes within a certain Operating System which name we can’t really remember. Well, the goal of the game is to find where are all the mines within aM×Nfield. To help you, the game shows a number in a square which tells you how many mines there are adjacent to that square. For instance, suppose the following 4×4 field with 2 mines (which are represented by an ‘*’ character):*........*......If we would represent the same field placing the hint numbers described above, we would end up with:*10022101*101110As you may have already noticed, each square may have at most 8 adjacent squares.InputThe input will consist of an arbitrary number of fields. The first line of each field contains two integersnandm(0 <n, m≤ 100) which stands for the number of lines and columns of the field respectively. The nextnlines contains exactlymcharacters and represent the field.Each safe square is represented by an ‘.’ character (without the quotes) and each mine square is represented by an ‘*’ character (also without the quotes). The first field line wheren=m= 0 represents the end of input and should not be processed.OutputFor each field, you must print the following message in a line alone:Field #x:Wherexstands for the number of the field (starting from 1). The nextnlines should contain the field with the ‘.’ characters replaced by the number of adjacent mines to that square. There must be an empty line between field outputs.ExampleInput:4 4\r\n*...\r\n....\r\n.*..\r\n....\r\n3 5\r\n**...\r\n.....\r\n.*...\r\n0 0Output:Field #1:\r\n*100 \r\n2210\r\n1*10\r\n1110\r\n \r\nField #2:\r\n**100 \r\n33200\r\n1*100",
  "sample_input": "Input:4 4\r\n*...\r\n....\r\n.*..\r\n....\r\n3 5\r\n**...\r\n.....\r\n.*...\r\n0 0Output:Field #1:\r\n*100 \r\n2210\r\n1*10\r\n1110\r\n \r\nField #2:\r\n**100 \r\n33200\r\n1*100",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PCSKREAB",
  "scraped_at": "2025-08-17 00:33:15"
}