{
  "problem_code": "problems",
  "title": "The Knights of the Round Circle",
  "tags": [],
  "text": "A group of Jedi Knights is having a competition. One of the Knights at random stands\r\nwithin a circle. The other Knights, in a random order, challenge him. If a challenger defeats\r\nthe Knight of the Round Circle, that Knight must leave the contest. The challenger\r\nthen becomes the new Knight of the Round Circle and, as such, will face all subsequent\r\nchallengers until he is defeated. If the current Knight of the Round Circle wins the challenge,\r\nhe stays within the circle and the challenger must leave the competition. The Knight\r\nwithin the circle at the end of the competition is deemed the winner. You may assume that\r\nno two Knights have exactly the same skill and that a stronger Knight will always defeat\r\na weaker Knight.Suppose there are three Knights in the competition. If the strongest one happens to stand\r\nin the circle first, he will not be defeated, so no one will ever leave the circle. If the weakest\r\none happens to be first in the circle, he will be kicked out after his first match. If the\r\nKnight that defeated him was the strongest, he will win the final challenge as well (so only\r\none Knight will ever leave the circle), otherwise the strongest Knight will kick the middle\r\nKnight out of the circle during his challenge (so that two Knights leave the circle). If the\r\nmiddle Knight stands in the circle first, he will be the only one kicked out of the circle, no\r\nmatter what order the other two come at him. All in all, an average of 5/6 or 0.83 Knight\r\nwill leave the circle during the competition.You are to compute the average number of Knights to leave the circle during a competition\r\ngiven the number of Knights in the competition.InputThe input consists of several lines. Each line (but the last) will contain one positive decimal\r\ninteger no larger than 10000. This integer is followed by exactly one <EOL>. These integers\r\nrepresent the number of Knights in the competition. The last line will contain one zero,\r\nfollowed by <EOL>. This line is not to be processed; it merely signifies the end of the input.OutputThe output cases are to appear in the same order in which they appear in the input. For\r\neach case, you are to print With c competitors, a Jedi Knight will be replaced\r\napproximately t times. c is the number of competitors in this case and should be a\r\ndecimal integer. t is the average number of times a Jedi Knight leaves the circle and\r\nshould be a floating point decimal number with exactly two digits following the decimal\r\npoint. There should always be at least one digit before the decimal point (use 0.50 rather\r\n.50, for example) The statement should be followed by two <EOL>’s, which is to say that a\r\nblank line should follow every output case.ExampleInput:3\r\n1000\r\n0Output:With 3 competitors, a Jedi Knight will be replaced approximately 0.83 times.\r\n\r\nWith 1000 competitors, a Jedi Knight will be replaced approximately 6.49 times.",
  "sample_input": "Input:3\r\n1000\r\n0Output:With 3 competitors, a Jedi Knight will be replaced approximately 0.83 times.\r\n\r\nWith 1000 competitors, a Jedi Knight will be replaced approximately 6.49 times.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/KNIGHTSR",
  "scraped_at": "2025-08-17 00:33:06"
}