{
  "problem_code": "problems",
  "title": "DNA Sequences",
  "tags": [],
  "text": "Thomas, a computer  scientist that works with DNA  sequences, needs to compute  longest  common  subsequences  of  given  pairs  of  strings. Consider   an    alphabet   Σ    of   letters   and    a   wordw=a1a2…ar, whereai∈ Σ, fori= 1, 2,  …,r.      Asubsequenceofwis     a     wordx=ai1ai2…aissuch that 1  ≤i1<i2<   … <is≤r.    Subsequencexis  asegmentofwifij+1=ij+ 1, forj= 1,2, …,s-1.   For example  the wordoveis a segment  of the  wordlovely,  whereas the wordlolyis  a subsequence  oflovely,  but  not a segment.A word is acommon subsequenceof two wordsw1andw2if it is a subsequence of each  of the two words.  Alongest common   subsequenceofw1andw2is a common subsequence ofw1andw2having  the largest possible length.  For  example, consider the wordsw1=lovxxelyxxxxxandw2=xxxxxxxlovely. The wordsw3=lovelyandw4=xxxxxxx, the latter of  length 7, are  both common  subsequences ofw1andw2.  In fact,w4is their longest common subsequence. Notice that the empty word, of  length zero,  is always a  common subsequence,  although not necessarily the longest.In the case of Thomas,  there is an extra requirement: the subsequence must be  formed from  common segments having  lengthKor  more. For example,   if   Thomas  decides   thatK=3,   then  he   considerslovelyto   be   an   acceptable  common   subsequence   oflovxxelyxxxxxandxxxxxxxlovely,     whereasxxxxxxx, which has length 7 and is also a common subsequence, is not acceptable. Can you help Thomas?InputThe input contains  several test cases. The first line  of a test case contains an integerKrepresenting the minimum length of common segments, where 1   ≤K≤ 100.   The next  two lines  contain each  a  string on lowercase letters from the regular  alphabet of 26 letters. The lengthlof each  string satisfies  the  inequality 1 ≤l≤ 103.  There are no spaces on any  line in the input.  The end of the input is indicated by a line containing a zero.OutputFor each  test case  in the  input, your program  must print  a single line,  containing the  length  of the  longest  subsequence formed  by consecutive segments of length at  leastKfrom both strings.  If no such  common subsequence  of  length greater  than  zero exists,  then0must be printed.ExampleInput:3\r\nlovxxelyxxxxx\r\nxxxxxxxlovely\r\n1\r\nlovxxelyxxxxx\r\nxxxxxxxlovely\r\n3\r\nlovxxxelxyxxxx\r\nxxxlovelyxxxxxxx\r\n4\r\nlovxxxelyxxx\r\nxxxxxxlovely\r\n0Output:6\r\n7\r\n10\r\n0",
  "sample_input": "Input:3\r\nlovxxelyxxxxx\r\nxxxxxxxlovely\r\n1\r\nlovxxelyxxxxx\r\nxxxxxxxlovely\r\n3\r\nlovxxxelxyxxxx\r\nxxxlovelyxxxxxxx\r\n4\r\nlovxxxelyxxx\r\nxxxxxxlovely\r\n0Output:6\r\n7\r\n10\r\n0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SAMER08D",
  "scraped_at": "2025-08-17 00:33:20"
}