{
  "problem_code": "problems",
  "title": "Falling Ice",
  "tags": [],
  "text": "Imagine disks of ice falling, one at a time, into a box, each ending\r\nup at the lowest point it can reach without overlapping or moving\r\nprevious disks.  Each disk then freezes into place, so it cannot\r\nbe moved by later disks.  Your job is to find the\r\noverall height of the final combination of disks.So that the answer is unique, assume that any disk reaching the\r\nbottom of the box rolls as far to the left as possible.  Also the\r\ndata is chosen so there will be a unique lowest position for any disk\r\nthat does not reach the bottom.  The data is also such that there\r\nare no \"perfect fits\":  each disk that lands will be in contact\r\nwith only two other points, on previous circles or the sides of the\r\nbox.  The illustrations above show white filled disks labeled with\r\nthe order in which they fall into their boxes.  The gray circle in\r\nthe fourth illustration is not intended to be a disk that fell in.\r\n The gray disk is included to demonstrate a point:  the gray\r\ndisk is the same size as disk 2, so there isspacefor disk 2 on the very bottom of its box, but disk 2 cannotreachthat position by falling from the top.  It gets caught on disk 1 and the side of the box.One way to find the top\r\nintersection point of two intersecting circles is as follows.\r\nSuppose circle 1 has center (x1, y1) and radius r1, and suppose circle 2 has center (x2, y2),\r\nand radius r2. Also assume that circle 1 is to the left of circle 2, i.e., x1 < x2. Letdx = x2 - x1,dy = y2 - y1,D = sqrt(dx*dx + dy*dy),E = (r1*r1 - r2*r2 + D*D)/(2*D),F = sqrt(r1*r1 - E*E);then the upper intersection point is (x1 + (E*dx - F*dy)/D, y1 + (F*dx + E*dy)/D).InputThe input consists of one or more data\r\nsets, followed by a line containing only 0 that signals the end of the input. Each data set is on\r\na line by itself and contains a sequence of three or more blank-separated\r\npositive integers, in the formatw,n,d1,d2,d3, ...,dn, wherewis the width of the box,nis the number of disks, and the remaining numbers are \r\nthe diameters of the disks, in the order in which they fall into the box.  \r\nYou can assume thatw< 100, \r\nthatn< 10, and that each diameter is less thanw.OutputFor each data set, output a single line\r\ncontaining the height of the pile of disks, rounded to two places\r\nbeyond the decimal point.The example data matches the illustrations above.ExampleInput:10 3 5 2 3\r\n8 2 5 5\r\n11 3 10 2 4\r\n9 3 4 4 6\r\n10 6 5 4 6 3 5 2\r\n0Output:5.00\r\n9.00\r\n12.99\r\n9.58\r\n14.19",
  "sample_input": "Input:10 3 5 2 3\r\n8 2 5 5\r\n11 3 10 2 4\r\n9 3 4 4 6\r\n10 6 5 4 6 3 5 2\r\n0Output:5.00\r\n9.00\r\n12.99\r\n9.58\r\n14.19",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/FALLINGI",
  "scraped_at": "2025-08-17 00:33:15"
}