{
  "problem_code": "problems",
  "title": "Shrinking Polygons",
  "tags": [],
  "text": "A polygon is said to beinscribedin a circle when all its vertices lie on that  circle.  In this problem you will be given a polygon inscribed in a circle, and you  must determine the minimum number of vertices that should be removed to  transform the given polygon into aregular polygon,  i.e., a polygon that is equiangular (all angles are  congruent) and equilateral (all edges have the same length).When you remove a vertexvfrom a polygon you first remove  the vertex and the edges connecting it to its adjacent verticesw1andw2, and then create a new edge connectingw1andw2.  Figure (a) below illustrates a polygon inscribed in a circle, with  ten vertices, and figure (b) shows a pentagon (regular polygon with  five edges) formed by removing five vertices from the polygon in (a).In this problem, we consider that any polygon must have at least three edges.InputThe input contains several test cases. The first line of a test case  contains one integerNindicating the number of vertices of the  inscribed polygon (3   ≤N≤ 104). The second line  containsNintegersXiseparated by single spaces (1   ≤Xi≤ 103, for 0   ≤i≤N-1).  EachXirepresents the length of the arc defined  in the inscribing circle, clockwise, by vertexiand vertex  (i+1)  modN. Remember that  anarcis a segment of the circumference of a circle; do not  mistake it for achord, which is a line segment whose  endpoints both lie on a circle.The end of input is indicated by a line containing only one zero.OutputFor each test case in the input, your program must print a single  line, containing the minimum number of vertices that must be removed  from the given polygon to form a regular polygon. If it is not  possible to form a regular polygon, the line must contain only the  value-1.ExampleInput:3\r\n1000 1000 1000\r\n6\r\n1 2 3 1 2 3\r\n3\r\n1 1 2\r\n10\r\n10 40 20 30 30 10 10 50 24 26\r\n0Output:0\r\n2\r\n-1\r\n5",
  "sample_input": "Input:3\r\n1000 1000 1000\r\n6\r\n1 2 3 1 2 3\r\n3\r\n1 1 2\r\n10\r\n10 40 20 30 30 10 10 50 24 26\r\n0Output:0\r\n2\r\n-1\r\n5",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SAMER08K",
  "scraped_at": "2025-08-17 00:33:13"
}