{
  "problem_code": "problems",
  "title": "Electricity",
  "tags": [],
  "text": "Martin and Isa stopped playing crazy games and finally got married. It's good news! They're pursuing a new life of happiness for both and, moreover, they're moving to a new house in a remote place, bought with most of their savings.Life is different in this new place. In particular, electricity is very expensive, and  they want to keep everything under control. That's why Martin proposed to keep a daily record of how much electricity has been consumed in the house. They have an electricity meter, which displays a number with the amount of KWh (kilowatt-hour) that has been consumed since their arrival.At the beginning of each day they consult the electricity meter, and write down the consumption. Some days Martin does it, and some days Isa does. That way, they will be able to look at the differences of consumption between consecutive days and  know how much has been consumed.But some days they simply forget to do it, so, after a long time, their register is now incomplete. They have a list of dates and consumptions, but not all of the dates are consecutive. They want to take into account only the days for which the consumption can be precisely determined, and they need help.InputThe input contains several test cases. The first line of each test case contains one integerNindicating the number of measures that have been taken (2   ≤N≤ 103). Each of theNfollowing lines contains four integersD,M,YandC, separated by single spaces,  indicating respectively the day (1   ≤D≤ 31), month (1   ≤M≤ 12), year (1900   ≤Y≤ 2100), and consumption (0   ≤C≤ 106) read at the beginning of that day. TheseNlines are increasingly ordered by date, and may include leap years. The sequence of consumptions is strictly increasing (this is, no two different readings have the same number). You may assume thatD,MandYrepresent a valid date.Remember that a year is a leap year if it is divisible by 4 and not by 100, or well, if the year is divisible by 400.The end of input is indicated by a line containing only one zero.OutputFor each test case in the input, your program must print a single line containing two integers separated by a single space:  the number of days for which a consumption can be precisely determined, and the sum of the consumptions for those days.ExampleInput:5\r\n9 9 1979 440\r\n29 10 1979 458\r\n30 10 1979 470\r\n1 11 1979 480\r\n2 11 1979 483\r\n3\r\n5 5 2000 6780\r\n6 5 2001 7795\r\n7 5 2002 8201\r\n8\r\n28 2 1978 112\r\n1 3 1978 113\r\n28 2 1980 220\r\n1 3 1980 221\r\n5 11 1980 500\r\n14 11 2008 600\r\n15 11 2008 790\r\n16 12 2008 810\r\n0Output:2 15\r\n0 0\r\n2 191",
  "sample_input": "Input:5\r\n9 9 1979 440\r\n29 10 1979 458\r\n30 10 1979 470\r\n1 11 1979 480\r\n2 11 1979 483\r\n3\r\n5 5 2000 6780\r\n6 5 2001 7795\r\n7 5 2002 8201\r\n8\r\n28 2 1978 112\r\n1 3 1978 113\r\n28 2 1980 220\r\n1 3 1980 221\r\n5 11 1980 500\r\n14 11 2008 600\r\n15 11 2008 790\r\n16 12 2008 810\r\n0Output:2 15\r\n0 0\r\n2 191",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SAMER08E",
  "scraped_at": "2025-08-17 00:33:03"
}