{
  "problem_code": "problems",
  "title": "Braille Transcription",
  "tags": [],
  "text": "Visually handicapped people use Braille\r\nsystem of codes for reading and writing. The basic Braille symbol (or cell) is\r\ncomposed of six dots arranged in two vertical columns, each column being three\r\ndots high. This pattern produces 64 one-cell symbols with character indexMany Braille codes are in use; one such is the\r\nSimple Braille System (SBS). In SBS alphabets in lower case are default\r\ncharacters; letters 'a,b,...,z' have character indices\r\n'1,2, ...,26' respectively. The 'letter sign' (dots 5-6) may be used optionally\r\nbefore a string of alphabets in lower case. Each numeric digit 0-9 requires one\r\ncell, with character index the digit itself. However the 'number sign' (dots\r\n3-4-5-6) is added before a string of numerals. In order to revert back to\r\nnormal alphabets after a string of numerals, the 'letter sign' is used. The\r\nblank cell is used as a space in alphabetic context and zero in numeric\r\ncontext. For example the numerals 1 - 10 are the same as the first ten letters\r\nof the alphabet, index of #abeing 1 and #jbeing 10. SBS allows the\r\ncontraction of 'th', by a single cell with dots\r\n1-4-5-6. A two-cell contraction for 'tion' is allowed\r\nwith dots 5-6 and dots 1-3-4-5.There are no single-cell codes for capital letters\r\nin SBS. So a 'capital sign' (dot 6) is inserted before a capital letter. Two\r\n'capital signs' are inserted to indicate that the string of alphabets that\r\nfollows is capitalized. To revert back to normal alphabets (or numerals), the\r\n'letter sign' (or the 'number sign') is used. SBS ignores punctuation marks\r\naltogether.You are required to write a program for\r\nSBS transcription that converts an SBS code to English.InputInput consists of multiple test cases.In each test case there is an SBS code. It is given in three input\r\nlines containing a certain number of Braille cells. Each Braille cell is\r\nrepresented by a3×2array of0's and1's, appearing in an odd and the next\r\neven numbered column of the three input lines, where '1' is used for an embossed\r\ndot and '0' otherwise.A line that is not a part of an SBS code, containing a single zero in\r\ncolumn 1 terminates input.OutputFor each test\r\ncase, output the SBS code\r\nin English, in one line. In case the input does not conform to SBS rules stated\r\nabove output simply the sign '?'.Sample Input110010\r\n011100\r\n011110\r\n110110\r\n010100\r\n011110\r\n000011\r\n000101\r\n010110\r\n00001110\r\n00000100\r\n01010110\r\n0Sample Output?\r\nth5\r\nTion\r\nTHEKanpur-Kolkata 2004-2005",
  "sample_input": "110010\r\n011100\r\n011110\r\n110110\r\n010100\r\n011110\r\n000011\r\n000101\r\n010110\r\n00001110\r\n00000100\r\n01010110\r\n0",
  "sample_output": "?\r\nth5\r\nTion\r\nTHE",
  "link": "https://www.spoj.com/problems/BRAILLE",
  "scraped_at": "2025-08-17 00:33:15"
}