{
  "problem_code": "problems",
  "title": "The Nobel Thief",
  "tags": [],
  "text": "The Nobel Prize of Kabiguru Rabindranath Thagore was stolen from a museum of Viswa Bharati University in West Bengal. The Central Bureau of Investigation (CBI) has been assigned the job to investigate the crime and recover the prize. CBI has identified some suspects and linked each one of them to a distinct subset of a set of clues.Let there bepsuspects andqclues. Integers 1 topidentify suspects whileqdistinct letter-codes identify clues. The clues are of varying importance. The alphabetic order of letter-codes determines the priority order in the clues; letter-codes 'a' to 'z' vary from highest to lowest priority.LetL0be the set of all suspects. Based on a clue 'α', a subsetLofL0may be split into two disjoint subsetsL+αandL-α. The subsetL+αincludes all elements ofLthat are linked to a subset of clues containing 'α' andL-αincludes all other elements ofL. Letn,n+α, andn-αdenote respectively the total number of elements inL,L+αandL-α. The discriminatory power of a clue 'α' to discriminate suspects inLis defined byδα= -(|n+α-n-α|)LetL*denote a set of disjoint subsets ofL0, each subset containing two or more elements. The discriminatory powerδ*αof a clue 'α' to discriminate suspects in subsets contained inL*is defined to be the sum of allδα's corresponding to each subset inL*.CBI wants to select a setDof dominant clues so that the presence or absence of some or all of these clues can identify each suspect uniquely. The selection is to be done in stages.LetL*contain onlyL0initially. At each stage of selection a clue 'β' with highest discriminatory powerδ*βis selected. Selecting the clue 'β' with highest priority breaks tie, if any. After a selection of 'β' eachLinL*is split into disjoint subsetsL+βand 'L-β' all resulting subsets with less than two elements are dropped fromL*. The process of selection continues untilL*becomes empty. All the clues thus selected form the set of dominant cluesD.You are required to write a program to find the set of dominant cluesD.InputInput may contain multiple test cases. For each test case input is given in one line. It contains an integerkrepresenting the case number and a certain number of strings of clues. Thei-th string represents the subset of clues to which thei-th suspect is linked. A space separates two consecutive fields in input.Input terminates with an input 0 for the case numberk.OutputFor each test case, present output in one line. The line contains the case numberkand a string of letters. The letters in the string correspond to the clues inDand appear in the order of their selection.ExampleInput:1 cbx cpxb bc brc\r\n2 bac adce cbd d\r\n0Output:1 xpr\r\n2 abKanpur-Kolkata 2004-2005",
  "sample_input": "Input:1 cbx cpxb bc brc\r\n2 bac adce cbd d\r\n0Output:1 xpr\r\n2 ab",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NBLTHIEF",
  "scraped_at": "2025-08-17 00:33:17"
}