{
  "problem_code": "problems",
  "title": "Binary Search Tree",
  "tags": [],
  "text": "A binary search tree is a tree in which every node has at most two children nodes (a left and a right child). Each node has an integer written inside it. If the number X is written inside a node, then the numbers in its left subtree are less than X and the numbers in its right subtree are greater than X.You will be given a sequence of integers between 1 and N (inclusive) such that each number appears in the sequence exactly once. You are to create a binary search tree from the sequence, putting the first number in the root node and inserting every other number in order. In other words, run insert (X, root) for every other number:insert (number X, node N)\r\n          increase the counter C by 1\r\n          if X is less than the number in node N\r\n                   if N has no left child\r\n                           create a new node with the number X and set it to be the left child of node N\r\n                   else\r\n                           insert (X, left child of node N)\r\n          else (X is greater than the number in node N)\r\n                   if N has no right child\r\n                           create a new node with the number X and set it to be the right child of node N\r\n                   else\r\n                           insert (X, right child of node N)Write a program that calculates the value of the counter C after every number is inserted. The counter is initially 0.InputThe first line contains the integer N (1 ≤ N ≤ 300 000), the length of the sequence.The remaining N lines contain the numbers in the sequence, integers in the interval [1, N]. The numbers will be distinct.OutputOutput N integers, each on its own line, the values of the counter C after each number is inserted into the tree.ExampleInput:8\r\n3\r\n5\r\n1\r\n6\r\n8\r\n7\r\n2\r\n4Output:0\r\n1\r\n2\r\n4\r\n7\r\n11\r\n13\r\n15Warning: large input/output data.Warning: A naive algorithm may not run in time; do not simply implement the above algorithm.Note: The test data for this problem consist of the official test cases from the contest, as well some cases of my own.",
  "sample_input": "insert (number X, node N)\r\n          increase the counter C by 1\r\n          if X is less than the number in node N\r\n                   if N has no left child\r\n                           create a new node with the number X and set it to be the left child of node N\r\n                   else\r\n                           insert (X, left child of node N)\r\n          else (X is greater than the number in node N)\r\n                   if N has no right child\r\n                           create a new node with the number X and set it to be the right child of node N\r\n                   else\r\n                           insert (X, right child of node N)",
  "sample_output": "Input:8\r\n3\r\n5\r\n1\r\n6\r\n8\r\n7\r\n2\r\n4Output:0\r\n1\r\n2\r\n4\r\n7\r\n11\r\n13\r\n15",
  "link": "https://www.spoj.com/problems/BST",
  "scraped_at": "2025-08-17 00:33:06"
}