{
  "problem_code": "problems",
  "title": "Najkraci",
  "tags": [],
  "text": "A road network in a country consists of N cities and M one-way roads. The cities are numbered 1 through N. For each road we know the origin and destination cities, as well as its length.We say that the road F is a continuation of road E if the destination city of road E is the same as the origin city of road F. A path from city A to city B is a sequence of road such that origin of the first road is city A, each other road is a continuation of the one before it, and the destination of the last road is city B. The length of the path is the sum of lengths of all roads in it.A path from A to B is a shortest path if there is no other path from A to B that is shorter in length.Your task is to, for each road, output how many different shortest paths containing that road, modulo 1 000 000 007.InputThe first line contains two integers N and M (1 ≤ N ≤ 1500, 1 ≤ M ≤ 5000), the number of cities and roads.Each of the following M lines contains three positive integers O, D and L. These represent a one-way road from city O to city D of length L. The numbers O and D will be different and L will be at most 10000.OutputOutput M integers, each on its own line – for each road, the number of different shortest paths containing it, modulo 1 000 000 007. The order of these numbers should match the order of roads in the input.ExampleInput:4 4\r\n1 2 5\r\n2 3 5\r\n3 4 5\r\n1 4 8Output:2\r\n3\r\n2\r\n1Input:5 8\r\n1 2 20\r\n1 3 2\r\n2 3 2\r\n4 2 3\r\n4 2 3\r\n3 4 5\r\n4 3 5\r\n5 4 20Output:0\r\n4\r\n6\r\n6\r\n6\r\n7\r\n2\r\n6Note: The test data for this problem consist of the official test cases from the contest, as well some cases of my own.",
  "sample_input": "Input:4 4\r\n1 2 5\r\n2 3 5\r\n3 4 5\r\n1 4 8Output:2\r\n3\r\n2\r\n1",
  "sample_output": "Input:5 8\r\n1 2 20\r\n1 3 2\r\n2 3 2\r\n4 2 3\r\n4 2 3\r\n3 4 5\r\n4 3 5\r\n5 4 20Output:0\r\n4\r\n6\r\n6\r\n6\r\n7\r\n2\r\n6",
  "link": "https://www.spoj.com/problems/NAJKRACI",
  "scraped_at": "2025-08-17 00:33:08"
}