{
  "problem_code": "problems",
  "title": "Moo University",
  "tags": [],
  "text": "Moo U's cafeteria has run out of hay and so must order pizzas for\r\nthe C (1 ≤ C ≤ 1,000) calves attending Moo U. Conveniently, a\r\nlarge pizza from the local pizzeria, Pizza Farm, serves exactly one\r\ncalf.Pizza Farm is willing to make a pizza for each calf, but, due to\r\nthe size of the order, has three constraints on the order:Although Pizza Farm has long list of T (1 ≤ T ≤ 30) vegetarian\r\ntoppings, each of the pizzas must have exactly K (1 ≤ K ≤\r\nT) toppingsNo topping on a pizza can be duplicated (a pizza cannot have\r\nonions and onions, for example).No two pizzas in the order can have the same set of toppings.For example, if pizza 1 has onions, green peppers, pineapples,\r\nand wheat grass, then it can be the only pizza with that exact\r\nset of toppings, although pizza 2 might have onions, green\r\npeppers, pineapples, and also olives.For ordering purposes, the toppings are numbered 1..T.The calves at Moo U are very picky when it comes to their pizza\r\ntoppings. Some calves might not like all of the toppings available.\r\nA calf will eat a pizza only she likes every single one of the\r\ntoppings on that pizza. Determine the maximum number of calves\r\nthat can be fed.InputLine 1: Three integers: C, T, and K.Lines 2..C+1: Each line of space-separated integers describes which\r\ntoppings one of the calves likes. The first integer on a line\r\nis the number of topping the calf likes. The remaining\r\nintegers on the line are the toppings that the calf likes.OutputLine 1: A single integer, the maximum number of calves that can be fed.ExampleInput:3 2 1\r\n2 2 1\r\n1 1\r\n1 2Input details:There are three calves. Pizza Farm has two toppings and each pizza\r\nmust have exactly one topping. The first calf likes both of the\r\ntoppings, the second calf likes only the first topping, and the\r\nthird calf likes only the second topping.Output:2Output detailsThere are only two pizzas that can be made: a pizza with topping 1 and a\r\npizza with topping 2. If the first pizza is given to the first\r\ncalf (since she likes topping 1) and the second pizza to the third calf\r\n(since she likes topping 2), two calves will be fed. There is no way to\r\nfeed all three calves.",
  "sample_input": "Input:3 2 1\r\n2 2 1\r\n1 1\r\n1 2",
  "sample_output": "Output:2",
  "link": "https://www.spoj.com/problems/MOOPIZZA",
  "scraped_at": "2025-08-17 00:33:13"
}