{
  "problem_code": "problems",
  "title": "Rainbow Ride",
  "tags": [],
  "text": "Mr.Raju and his extended family are on vacation in Chennai. They visit MGM and see the Rainbow ride. They want to enjoy the ride. However, there are some problems.Each person in the family likes some other people in the family. Each person insists that he or she will go on the ride only if all the people whom that person likes and all the people who like that person also go on the ride. If someone doesn't like anyone and no one likes him, he may come for the ride.You have been roped in to solve this dilemma. Given the weight of the each person in the family, and the list of people they like, and the maximum weight that the Rainbow can bear safely, calculate the maximum number of people in the family who can go on the rainbow.InputThere will be multiple test cases in the input. For our convenience the family members are numbered from 1 to n. Each test case begins with a line containing two   integersn( 1 ≤ n ≤ 1000 ) andC( 0 ≤ C ≤ 1000 ), where n is the number of people in the family and C the maximum capacity of the ride in kilograms.The next line contains n space separated integers with theith integer giving the weight of theith family member. These weights are positive and less than or equal to 200 kilograms. Then n lines follow. Each line contains a sequence of integers separated by spaces. The first integerkigives the number of people in the family personilikes, followed by the personsilikes. An empty line separates each test case. The end of input is indicated by n=0 and C=0 and it should not be processed.There are atmost 50 test cases.OutputFor each test case output on a separate line the maximum number of persons that can take the ride under the given conditions.ExampleInput:5 200\r\n50 50 50 50 50\r\n1 2\r\n1 3\r\n0\r\n1 5\r\n1 4\r\n\r\n3 200\r\n100 100 100\r\n1 2\r\n1 3\r\n1 1\r\n\r\n0 0Output:3\r\n0",
  "sample_input": "Input:5 200\r\n50 50 50 50 50\r\n1 2\r\n1 3\r\n0\r\n1 5\r\n1 4\r\n\r\n3 200\r\n100 100 100\r\n1 2\r\n1 3\r\n1 1\r\n\r\n0 0Output:3\r\n0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RAINBOW",
  "scraped_at": "2025-08-17 00:33:21"
}