{
  "problem_code": "problems",
  "title": "George",
  "tags": [],
  "text": "Last week Mister George visited Croatia. Since Mister George is a very important person, while he was in a street, the policedisallowed entryto that street, but vehicles that entered the street before Mister George could continue driving.While Mister George was visiting, Luka drove his truck around town. But because of some of the streets being closed off, he couldn't make his delivery in time and almost lost his job. Although it is late now, he is wondering how he could have planned his delivery better i.e. what would have been the least time needed to make his delivery while Mister George was visiting. He knows the route mister George took.The city is modeled with intersections and two-way streets connecting them. For each street, Luka knows how much time he needs to traverse it (mister George needs he same amount of time).For example, if Mister George starts traversing a street during minute 10 and needs 5 minutes to exit it, this street will be blocked during minutes 10, 11, 12, 13 and 14. Luka can enter the street during minutes 9 and earlier, or 15 and later.Write a program that calculates the least amount of time Luka needs to make his delivery, if he starts driving K minutes after the arrival of Mister George.InputThe first line contains two integers N and M (2 ≤ N ≤ 1000, 2 ≤ M ≤ 10 000), the number of intersections and the number of streets. The intersections are numbered 1 to N.\r\nThe second line contains four integers A, B, K and G (1 ≤ A, B ≤ N, 0 ≤ K ≤ 1000, 0 ≤ G ≤ 1000).\r\nThese are, in order:The intersection where Luka starts;The intersection Luka must get to;The difference in starting times between mister George and Luka (Luka starts at intersection A exactly K minutes after mister George starts his route);The number of intersections on Mister George's route.The third line contains G integers, the labels of intersections mister George will visit. Every pair of adjacent integers denotes a street he will traverse. That street will exist and Mister George will traverse every street at most once.\r\nEach of the following M lines contains three integers A, B and L, meaning that there is a street between intersection A and B, and it takes L minutes to traverse. L will be between 1 and 1000.OutputOutput the least amount of time (in minutes) Luka needs to make his delivery.ExampleInput:6 5\r\n1 6 20 4\r\n5 3 2 4\r\n1 2 2\r\n2 3 8\r\n2 4 3\r\n3 6 10\r\n3 5 15Output:21Input:8 9\r\n1 5 5 5\r\n1 2 3 4 5\r\n1 2 8\r\n2 7 4\r\n2 3 10\r\n6 7 40\r\n3 6 5\r\n6 8 3\r\n4 8 4\r\n4 5 5\r\n3 4 23Output:40Croatian Open Competition in Informatics (COCI) - 2007/2008 Contest #6",
  "sample_input": "Input:6 5\r\n1 6 20 4\r\n5 3 2 4\r\n1 2 2\r\n2 3 8\r\n2 4 3\r\n3 6 10\r\n3 5 15Output:21",
  "sample_output": "Input:8 9\r\n1 5 5 5\r\n1 2 3 4 5\r\n1 2 8\r\n2 7 4\r\n2 3 10\r\n6 7 40\r\n3 6 5\r\n6 8 3\r\n4 8 4\r\n4 5 5\r\n3 4 23Output:40",
  "link": "https://www.spoj.com/problems/GEORGE",
  "scraped_at": "2025-08-17 00:33:23"
}