{
  "problem_code": "problems",
  "title": "Street",
  "tags": [],
  "text": "There arenlots on one side of a street (wheren≤ 500). We would like to erect at mostkapartment buildings on these lots. Each building must occupy an interval of at mosttconsecutive lots. Moreover, each lotihas a height restrictionr[i](wherer[i]≤ 100). A building cannot exceed any of the height restriction of any lot on which it is built (that is, the maximal height of the building that can be erected on lotitojis:H = min{r[i], r[i + 1], ..., r[j]})Hence, the maximum usable facade space of the building is:H × (j − i + 1). We would like to have a program to select at mostknon-overlapping intervals to erect the buildings such that the total usable facade space is maximized.Example 1Consider a street of length 10. The height restriction of each lot is as follows:7, 3, 12, 11, 13, 4, 8, 6, 6, 20Suppose we would like to erect at mostk= 2 buildings and each building occupies at mostt= 4 lots. Then, to maximize the total usable facade space, we choose two intervalsr[3..5] = (12, 11, 13) andr[7..10] = (8, 6, 6, 20) (see “Example 1” in the figure below). The maximum usable facade space is 3 ∗ min{12, 11, 13} + 4 ∗ min{8, 6, 6, 20} = 57.Example 2Suppose we would like to erect at mostk= 3 buildings on the same street with the same height restrictions as in Example 1, and each building occupies at mostt= 4 lots. Then, to maximize the total usable facade space, we choose three intervalsr[3..5] = (12, 11, 13),r[7..9] = (8, 6, 6) andr[10..10] = (20) (see “Example 2” in the figure above). The maximum usable facade space is 3 ∗ min{12, 11, 13} + 3 ∗ min{8, 6, 6} + 1 ∗ 20 = 71.InputThe input file is as follows: The first line contains three integersn,k, andtseparated by a space character, where 1 ≤n≤ 500, 1 ≤k≤ n, and 1 ≤t≤ n. The rest of thenlines containnpositive integers representing the height restriction for thenlots. For Example 1, the input file looks like:10 2 4\r\n7\r\n3\r\n12\r\n11\r\n13\r\n4\r\n8\r\n6\r\n6\r\n20The input should be read from the standard input, and your program will be run several times, each one with one of the test cases.OutputThe output file contains an integer which is the maximum usable facade space. For the above example, the output file looks like:57National Olympiad in Informatics (NOI) - 2007",
  "sample_input": "7, 3, 12, 11, 13, 4, 8, 6, 6, 20",
  "sample_output": "10 2 4\r\n7\r\n3\r\n12\r\n11\r\n13\r\n4\r\n8\r\n6\r\n6\r\n20",
  "link": "https://www.spoj.com/problems/STREET",
  "scraped_at": "2025-08-17 00:33:05"
}