{
  "problem_code": "problems",
  "title": "Majstor",
  "tags": [],
  "text": "EnglishVietnameseRock-paper-scissors is a popular two-player game. In the game, each of the players uses their hand to\r\nshow one of three symbols: rock, paper or scissors. If both players show the same symbol, the game is\r\na tie. Otherwise, scissors beat paper, paper beats rock and rock beats scissors.Sven has been studying the psychological intricacies of the game for years and has become a real master\r\nat the game, his friends not standing a chance against him in one-on-one games.With the world championships around the corner, Sven is practicing his skills playing simultaneous\r\ngames with N of his friends. One such game consists of R rounds. In each round, Sven and each of his\r\nfriends show one of the three symbols.When calculating the score, in each round, Sven's symbol is independently compared to each of his\r\nfriends' symbols. Sven scores two points for every win and one point for every tie. Sven does not get\r\npoints for losing.Write a program that calculates Sven's total score, and also his largest possible score had he known in\r\nadvance all the symbols his friends would show.InputThe first line contains the integer R (1 ≤ R ≤ 50), the number of rounds played.The second line contains a string of R letters 'S', 'P' or 'R'. The string represents symbols that Sven\r\nshowed in each round. 'S' is for scissors, 'P' for paper, 'R' for rock.The third line contains the integer N (1 ≤ N ≤ 50), the number of friends.Each of the following N lines contains a string of R letters 'S', 'P' or 'R'. These are the symbols shown\r\nby each of the N friends in each of the R rounds.OutputOutput Sven's actual score on the first line.Output his largest possible score on the second line, assuming his friends didn't change their symbols.ExampleInput\r\n5\r\nSSPPR\r\n1\r\nSSPPR\r\n\r\nOutput\r\n5\r\n10Input\r\n5\r\nSSPPR\r\n2\r\nPPRRS\r\nRRSSP\r\n\r\nOutput\r\n10\r\n15Input\r\n4\r\nSPRS\r\n4\r\nRPRP\r\nSRRR\r\nSSPR\r\nPSPS\r\n\r\nOutput\r\n12\r\n21",
  "sample_input": "Input\r\n5\r\nSSPPR\r\n1\r\nSSPPR\r\n\r\nOutput\r\n5\r\n10",
  "sample_output": "Input\r\n5\r\nSSPPR\r\n2\r\nPPRRS\r\nRRSSP\r\n\r\nOutput\r\n10\r\n15",
  "link": "https://www.spoj.com/problems/MAJSTOR",
  "scraped_at": "2025-08-17 00:33:16"
}