{
  "problem_code": "problems",
  "title": "Activities",
  "tags": [],
  "text": "Ana likes many activities. She likes acrobatics, alchemy, archery, art, Arabic dances, and\r\nmany more. She joined a club that offers several classes. Each class has a time interval\r\nin every week. Ana wants to sign up for many classes, but since they overlap in time, she\r\nlooks for a subset of non-overlapping classes to attend. A subset is non-overlapping if it\r\ndoes not contain two classes that overlap in time. If a class starts at the time another\r\nclass ends, this is not considered overlapping.Ana decided to list all the non-overlapping non-empty subsets of classes. Then she will\r\nchoose the subset she likes best. In order to predict the amount of paper needed to write\r\nthe list, she wants you to calculate how many of these subsets there are.InputEach test case is described using several lines. The first line contains an integer N\r\nindicating the number of classes the club offers (1 ≤ N ≤ 105). Each of the next N lines\r\ndescribes a class using two integers S and E that represent the starting and ending times\r\nof the class, respectively (1 ≤ S < E ≤ 109). The end of input is indicated with a line\r\ncontaining a single −1.OutputFor each test case, output a single line with a single integer representing the number of\r\nnon-overlapping non-empty subsets of classes. To make your life easier, output only the\r\nlast 8 digits of the result. If the result has less than 8 digits, write it with leading zeros\r\nto complete 8 digits.ExampleInput:5\r\n1 3\r\n3 5\r\n5 7\r\n2 4\r\n4 6\r\n3\r\n500000000 1000000000\r\n1 500000000\r\n1 500000000\r\n1\r\n999999999 1000000000\r\n-1Output:00000012\r\n00000005\r\n00000001",
  "sample_input": "Input:5\r\n1 3\r\n3 5\r\n5 7\r\n2 4\r\n4 6\r\n3\r\n500000000 1000000000\r\n1 500000000\r\n1 500000000\r\n1\r\n999999999 1000000000\r\n-1Output:00000012\r\n00000005\r\n00000001",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ACTIV",
  "scraped_at": "2025-08-17 00:33:11"
}