{
  "problem_code": "problems",
  "title": "Just on Time",
  "tags": [],
  "text": "Last week’s campaign on healthy and environmentally friendly mobility was a big success. Hundreds of commuters to the EPFL campus traded their car for a ride by bus or metro and gave a very positive feedback. They merely complained about earlier wake-up times necessary to reach the campus on time.This is where you enter the story. Try to improve the mood of the people by indicating them the latest time they can leave their house such that they can reach the campus no later than 8h15. Any means are ok to maximize their sleeping time, and all would accept to change bus or metro lines several times during their journey if this helps your planning.The public transport network is made up ofS (0 <= S <= 100)stations (numbered from 1 toS) and countsC (0 <= C <= 1,000)unidirectional connections that link two stations in regular time intervals, starting from a certain time in the morning and up to 8h15. Note that for any two stations, there might exist several direct shuttle services with different starting time and frequency. You are to answer some students’ request on the latest possible time they can leave from home in order not to be late.InputThe input consists of several test-cases separated by an empty line. Each test-case starts with the number of stationsS, the number of connectionsCand the number of requestsRon a line. Then comeClines, each describing one shuttle service in the format ‘from’ ‘to’ ‘firstRide’ ‘travelTime’ ‘frequency’ (in minutes). The nextRlines each hold two integers, the first being the closest station to the student’s home (come what may, but so early no student would like to walk more than necessary) and the second the time (in minutes) it takes the student to reach that station. The campus is located at stationS. Input terminates on a test-case withS = C = R = 0, which must not be evaluated.OutputAnswer the requests in the same order as they appear in the input. For each request, print a line in the form “Leave no later than ‘time’”, where ‘time’ is in the formathh:mm. Add an empty line after each test-case. If there is no way the students can make it on time, output “Doomed to be late”. You can safely assume that the commuters are so experienced in hopping on and off busses that they can change busses in no time at all.SampleInput:3 2 2\r\n1 3 07:10 50 15\r\n2 3 08:20 5 5\r\n1 3\r\n2 0\r\n\r\n3 4 3\r\n2 3 05:30 6 5\r\n1 3 06:11 5 15\r\n1 2 07:01 2 5\r\n3 2 08:00 1 8\r\n1 2\r\n2 1\r\n3 10\r\n\r\n0 0 0Output:Leave no later than 07:22\r\nDoomed to be late\r\n\r\nLeave no later than 07:59\r\nLeave no later than 08:04\r\nLeave no later than 08:05",
  "sample_input": "Input:3 2 2\r\n1 3 07:10 50 15\r\n2 3 08:20 5 5\r\n1 3\r\n2 0\r\n\r\n3 4 3\r\n2 3 05:30 6 5\r\n1 3 06:11 5 15\r\n1 2 07:01 2 5\r\n3 2 08:00 1 8\r\n1 2\r\n2 1\r\n3 10\r\n\r\n0 0 0Output:Leave no later than 07:22\r\nDoomed to be late\r\n\r\nLeave no later than 07:59\r\nLeave no later than 08:04\r\nLeave no later than 08:05",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ONTIME",
  "scraped_at": "2025-08-17 00:33:21"
}