{
  "problem_code": "problems",
  "title": "Power Calculus",
  "tags": [],
  "text": "Starting withxand repeatedly multiplying byx, we can computex31with thirty multiplications:x2=x*x,x3=x2*x,x4=x3*x,...x31=x30*x.The operation of squaring can appreciably shorten the sequence of multiplications. The following is a way to computex31with eight multiplications:x2=x*x,x3=x2*x,x6=x3*x3,x7=x6*x,x14=x7*x7,x15=x14*x,x30=x15*x15,x31=x30*x.This is not the shortest sequence of multiplications to computex31. There are many ways with only seven multiplications. The following is one of them:x2=x*x,x4=x2*x2,x8=x4*x4,x10=x8*x2,x20=x10*x10,x30=x20*x10,x31=x30*x.There however is no way to computex31with fewer multiplications. Thus this is one of the most efficient ways to computex31only by multiplications.If division is also available, we can find a shorter sequence of operations. It is possible to computex31with six operations (five multiplications and one division):x2=x*x,x4=x2*x2,x8=x4*x4,x16=x8*x8,x32=x16*x16,x31=x32÷x.This is one of the most efficient ways to computex31if a division is as fast as a multiplication.Your mission is to write a program to find the least number of operations to computexnby multiplication and division starting withxfor the given positive integern. Products and quotients appearing in the sequence of operations should bexto a positive integer's power. In other words,x-3, for example, should never appear.InputThe input is a sequence of one or more lines each containing a single integern.nis positive and less than or equal to 1000. The end of the input is indicated by a zero.OutputYour program should print the least total number of multiplications and divisions required to computexnstarting withxfor the integern.  The numbers should be written each in a separate line without any superfluous characters such as leading or trailing spaces.ExampleInput:1\r\n31\r\n70\r\n91\r\n473\r\n512\r\n811\r\n953\r\n0Output:0\r\n6\r\n8\r\n9\r\n11\r\n9\r\n13\r\n12",
  "sample_input": "Input:1\r\n31\r\n70\r\n91\r\n473\r\n512\r\n811\r\n953\r\n0Output:0\r\n6\r\n8\r\n9\r\n11\r\n9\r\n13\r\n12",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/YOKOF",
  "scraped_at": "2025-08-17 00:33:24"
}