{
  "problem_code": "problems",
  "title": "Cubic Eight",
  "tags": [],
  "text": "Let's play a puzzle using eight cubes placed on a 3 × 3 board leaving one empty square.Faces of cubes are painted with three colors. As a puzzle step, you can roll one of the cubes to the adjacent empty square. Your goal is to make the specified color pattern visible from above by a number of such steps.The rules of this puzzle are as follows.Coloring of Cubes:All the cubes are colored in the same way as shown in Figure 3. The opposite faces have the same color.Figure 3: Coloring of a cubeInitial Board State:Eight cubes are placed on the 3 × 3 board leaving one empty square. All the cubes have the same orientation as shown in Figure 4. As shown in the figure, squares on the board are givenxandycoordinates, (1, 1), (1, 2) ... and (3, 3). The position of the initially empty square may vary.Figure 4: Initial board stateRolling Cubes:At each step, we can choose one of the cubes adjacent to the empty square and roll it into the empty square, leaving the original position empty. Figure 5 shows an example.Figure 5: Rolling a cubeGoal:The goal of this puzzle is to arrange the cubes so that their top faces form the specified color pattern by a number of cube rolling steps described above.Your task is to write a program that finds the minimum number of steps required to make the specified color pattern from the given initial state.InputThe input is a sequence of datasets. The end of the input is indicated by a line containing two zeros separated by a space. The number of datasets is less than 16. Each dataset is formatted as follows.xyF11F21F31F12F22F32F13F23F33The first line contains two integersxandyseparated by a space, indicating the position (x,y) of the initially empty square. The values ofxandyare 1, 2, or 3.The following three lines specify the color pattern to make. Each line contains three charactersF1j,F2j, andF3j, separated by a space. CharacterFijindicates the top color of the cube, if any, at position (i,j) as follows:B: Blue,W: White,R: Red,E: the square is Empty.There is exactly one 'E' character in each dataset.OutputFor each dataset, output the minimum number of steps to achieve the goal, when the goal can be reached within 30 steps. Otherwise, output \"-1\" for the dataset.ExampleInput:1 2\r\nW W W\r\nE W W\r\nW W W\r\n2 1\r\nR B W\r\nR W W\r\nE W W\r\n3 3\r\nW B W\r\nB R E\r\nR B R\r\n3 3\r\nB W R\r\nB W R\r\nB E R\r\n2 1\r\nB B B\r\nB R B\r\nB R E\r\n1 1\r\nR R R\r\nW W W\r\nR R E\r\n2 1\r\nR R R\r\nB W B\r\nR R E\r\n3 2\r\nR R R\r\nW E W\r\nR R R\r\n0 0Output:0\r\n3\r\n13\r\n23\r\n29\r\n30\r\n-1\r\n-1",
  "sample_input": "Input:1 2\r\nW W W\r\nE W W\r\nW W W\r\n2 1\r\nR B W\r\nR W W\r\nE W W\r\n3 3\r\nW B W\r\nB R E\r\nR B R\r\n3 3\r\nB W R\r\nB W R\r\nB E R\r\n2 1\r\nB B B\r\nB R B\r\nB R E\r\n1 1\r\nR R R\r\nW W W\r\nR R E\r\n2 1\r\nR R R\r\nB W B\r\nR R E\r\n3 2\r\nR R R\r\nW E W\r\nR R R\r\n0 0Output:0\r\n3\r\n13\r\n23\r\n29\r\n30\r\n-1\r\n-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/YOKOC",
  "scraped_at": "2025-08-17 00:33:27"
}