{
  "problem_code": "problems",
  "title": "Architecture",
  "tags": [],
  "text": "Architecture, a tightrope walk between engineering and art! There are probably few invariants shared by the architectural styles around the world and throughout time. Precisely this diversity makes the domain so interesting and challenging.Any domains may serve as sources of inspiration, mathematical shapes, nature, organisms and even arched slices of Swiss cheese J. Some of our university friends from architecture plan to participate in the prestigious Erect a Palace From Lines (EPFL) contest. This contest is about designing a huge single-floor palace by building horizontal and vertical walls inside the preset square fundament.The students just finished their creative prototypes, and you are to revise their projects before they enter the contest. Some were obviously overwhelmed by the cryptographic protocol required for the palace description and do not know how many rooms their palace has. Walls are one unit thick and are described by their horizontal and vertical start and end positions. As the palace is huge, these coordinates are expressed in a base 26 system (the latin alphabet). Having overlapping walls is not a problem. For the encryption, read ‘A’ as zero and ‘Z’ as twenty-five. All other letters cover the remaining range in the conventional lexicographic order.InputThe input consists of several test-cases, separated by an empty line. Each test-case starts with the side length of the square palacen(A ≤ n ≤ ZZ) and the number of wallsw(0 ≤ w ≤ 500) the student placed inside the palace. The palace’s interior spreads thus from 0 ton-1, vertically and horizontally. The followingwlines each describe a wall in the form x1 y1 x2 y2, the horizontal and vertical endpoints of the wall such that (0 ≤ x1, y1, x2, y2 ≤ n-1). Input terminates on a test-case withn= A andw= 0, which must not be processed. You may safely assume that no student placed walls that transgress the fundaments of the palace and that no palace has more than 10,000 rooms.OutputFor each test-case, output the number of rooms in the palace.ExampleInput:P 17\r\nG N G F\r\nF G C G\r\nF O F K\r\nG M N M\r\nC F C M\r\nI E K E\r\nO C O E\r\nB L B N\r\nJ M J E\r\nM O J O\r\nH O C O\r\nL H L I\r\nN F K F\r\nM E O E\r\nN D O D\r\nE C E L\r\nG O G L\r\n\r\nZZZZZZZZZZZZZZZZ 4\r\nA GH ZZZZZZZZZZZZZZZY GH\r\nPOLYPROG SELECTION POLYPROG CONTEST\r\nTOBE ORNOT TOBE THATSTHEQUESTION\r\nLEADINGZEROS NO LEADINGAS NOOutput:4\r\n2",
  "sample_input": "Input:P 17\r\nG N G F\r\nF G C G\r\nF O F K\r\nG M N M\r\nC F C M\r\nI E K E\r\nO C O E\r\nB L B N\r\nJ M J E\r\nM O J O\r\nH O C O\r\nL H L I\r\nN F K F\r\nM E O E\r\nN D O D\r\nE C E L\r\nG O G L\r\n\r\nZZZZZZZZZZZZZZZZ 4\r\nA GH ZZZZZZZZZZZZZZZY GH\r\nPOLYPROG SELECTION POLYPROG CONTEST\r\nTOBE ORNOT TOBE THATSTHEQUESTION\r\nLEADINGZEROS NO LEADINGAS NOOutput:4\r\n2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ARCHI",
  "scraped_at": "2025-08-17 00:33:08"
}