{
  "problem_code": "problems",
  "title": "Homo or Hetero",
  "tags": [],
  "text": "Consider a list of numbers with two operations:insert number — adds the specified number to the end of the list.delete number — removes the first occurrence of the specified number from the list. If the list does not contain the number specified, no changes are performed.For example: the result of the insertion of a number 4 to the list [1, 2, 1] is the list [1, 2, 1, 4]. If we delete the number 1 from this list, we get the list [2, 1, 4], but if we delete the number 3 from the list [1, 2, 1, 4], the list stays unchanged.The list is homogeneous if it contains at least two equal numbers and the list is heterogeneous if it contains at least two different numbers. For example: the list [2, 2] is homogeneous, the list [2, 1, 4] is heterogeneous, the list [1, 2, 1, 4] is both, and the empty list is neither homogeneous nor heterogeneous.Write a program that handles a number of the operations insert and delete on the empty list and determines list’s homogeneity and heterogeneity after each operation.InputThe first line of the input file contains an integer number n — the number of operations to handle (1 ≤ n ≤ 100 000).Following n lines contain one operation description each. The operation description consists of a word “insert” or “delete”, followed by an integer number k — the operation argument (−109≤ k ≤ 109).OutputFor each operation output a line, containing a single word, describing the state of the list after the operation:“both” — if the list is both homogeneous and heterogeneous.“homo” — if the list is homogeneous, but not heterogeneous.“hetero” — if the list is heterogeneous, but not homogeneous.“neither” — if the list is neither homogeneous nor heterogeneous.ExampleInput:11\r\ninsert 1\r\ninsert 2\r\ninsert 1\r\ninsert 4\r\ndelete 1\r\ndelete 3\r\ndelete 2\r\ndelete 1\r\ninsert 4\r\ndelete 4\r\ndelete 4Output:neither\r\nhetero\r\nboth\r\nboth\r\nhetero\r\nhetero\r\nhetero\r\nneither\r\nhomo\r\nneither\r\nneither",
  "sample_input": "Input:11\r\ninsert 1\r\ninsert 2\r\ninsert 1\r\ninsert 4\r\ndelete 1\r\ndelete 3\r\ndelete 2\r\ndelete 1\r\ninsert 4\r\ndelete 4\r\ndelete 4Output:neither\r\nhetero\r\nboth\r\nboth\r\nhetero\r\nhetero\r\nhetero\r\nneither\r\nhomo\r\nneither\r\nneither",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HOMO",
  "scraped_at": "2025-08-17 00:33:07"
}