{
  "problem_code": "problems",
  "title": "Cheese",
  "tags": [],
  "text": "Nlogonian people are very excited about the event that will occur in the next year: the\r\nCheese-rolling World Cup Nlogonia 2013! The event is organized by the Modern Cheese-rolling\r\nAssociation (MCA or ACM, as spelled in Nlogonish) every four years, and this will be\r\nthe ﬁrst time that such an event is held in Nlogonia.The project, however, is still being worked on. ACM didn’t announce the list of host\r\ncities yet, but, instead, it announced how the cities will be chosen. It’s worth mentioning\r\nthat Nlogonia was attacked by some kind of giant cannon in 2009, so the facilities in the cities\r\nare damaged and can’t be fully considered (at least not now). Instead, a city will be chosen\r\naccording to how easy its name is pronounced.Let’s deﬁne the pronunciation power (pp) of a city name S as the sum of the lengths of\r\nall its palindromic contiguous substrings with even positive length. For example, consider the\r\nname abbaxx. Its substrings with even positive length are {ab, bb, ba, ax, xx, abba, bbax, baxx,\r\nabbaxx}. Of these, the palindromic ones are {bb, xx, abba} and thus pp(abbaxx) = |bb| +\r\n|xx| + |abba| = 8. Repeated substrings should be considered as many times as they occur (so\r\npp(aaa) = |aa| + |aa| = 4, since aa occurs twice). Also, letter comparisons are case insensitive\r\n(so pp(aBbAxX) = 8, too), since the pronunciation is independent of the letter case.Nlogonia has N cities. Let K be a number given by ACM. The cities whose names have a\r\npronunciation power equal or greater than the K th unique highest power of all N cities will be\r\nchosen. Notice that it’s possible to choose more than K cities. For example, consider K = 3\r\nand N = 6 cities whose names have the powers 2, 4, 4, 8, 8 and 16. The ﬁrst 3 unique higher\r\npowers are 16, 8 and 4, so all cities except the ﬁrst one will be chosen.The 2009 cannon attack also damaged the roads between the cities. There’are only M\r\none-way roads available to use in Nlogonia (if a road connects city A to B, it can’t be used to\r\ngo from B to A). Also, due the damages made by the cannon, each road has a traﬃc ﬂow limit.\r\nNlogonia’s capital is the only city with an airport, so all the foreign people will come to\r\nNlogonia via the capital and go to the host cities using the road network cited above. Your\r\ntask is to help the Nlogonian people know the list of cities that will be chosen, and, for each\r\none, know what is the maximum traﬃc ﬂow possible from the capital to the city, so they\r\nknow if the roads will handle the traﬃc well during the event. During the World Cup, each\r\nmatch will be played in a diﬀerent date and city, so consider the chosen cities independently\r\n(in other words, calculate the ﬂow between the capital and the ﬁrst chosen city as if it was\r\nthe only chosen one; then do the same with the second chosen one, and so on).InputThe input will consist of one or more test cases. Each test case starts with a line containing\r\nthree integers N (1 ≤ N ≤ 200), M (1 ≤ M ≤ N (N − 1)) and K (1 ≤ K ≤ 10). The cities are\r\nnumbered from 0 to N − 1, and the capital is the city number 0.Each of the N next lines\r\ncontains the names of the cities, in increasing order of their numbers. Each name will contain\r\nonly upper and lower case English letters, and its length will not exceed 30000. Each of the\r\nM next lines will describe the road network of the country. Each line will be in the form A\r\nB C (0 ≤ A, B < N, A = B, 1 ≤ C ≤ 109) and indicates a road connecting city A to city\r\nB with traﬃc ﬂow limit C. There won’t be more than one road connecting a pair of cities\r\nin the same direction, and it will always be possible to go from the capital to any other city.The last test case will be followed by a line containing three zeros.OutputFor each test case, print one line with k - the number of chosen cities. Then, print k\r\nlines in the format n (pp) f , where n is a city name, pp is its pronunciation power and f is\r\nthe maximum ﬂow from the capital to the city. Print the cities in increasing order of their\r\nnumbers. Also, if the capital is a chosen city, use f = 0. You may assume that k ≤ 2K for\r\neach test case.ExampleInput:3 4 2\r\nCuritiba\r\nLalLal\r\nIdappadi\r\n0 1 2\r\n2 1 1\r\n0 2 3\r\n1 2 6\r\n4 5 3\r\nheeymacarena\r\nhaay\r\nabbaxx\r\nddxdd\r\n0 3 20\r\n0 2 10\r\n2 3 5\r\n3 1 10\r\n2 1 20\r\n0 0 0Output:2\r\nLalLal (12) 3\r\nIdappadi (20) 5\r\n4\r\nheeymacarena (2) 0\r\nhaay (2) 20\r\nabbaxx (8) 10\r\nddxdd (4) 25",
  "sample_input": "Input:3 4 2\r\nCuritiba\r\nLalLal\r\nIdappadi\r\n0 1 2\r\n2 1 1\r\n0 2 3\r\n1 2 6\r\n4 5 3\r\nheeymacarena\r\nhaay\r\nabbaxx\r\nddxdd\r\n0 3 20\r\n0 2 10\r\n2 3 5\r\n3 1 10\r\n2 1 20\r\n0 0 0Output:2\r\nLalLal (12) 3\r\nIdappadi (20) 5\r\n4\r\nheeymacarena (2) 0\r\nhaay (2) 20\r\nabbaxx (8) 10\r\nddxdd (4) 25",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CHEESE",
  "scraped_at": "2025-08-17 00:33:23"
}