{
  "problem_code": "problems",
  "title": "Prendonians",
  "tags": [],
  "text": "The ancient civilization of the Prendonians, who lived in Jutland from 5000 BC to 4500\r\nBC, is well known. A Prendonian name is composed of three non empty words formed by\r\nlowercase letters from a to z: an unique ﬁrst name, one of their parents’ ﬁrst name with a\r\nsuffix and the other parent’s name with the same suffix. The unique ﬁrst name always comes\r\nﬁrst, but there is no speciﬁc order for the other two.The suffix denotes the gender of the bearer of the name, jk for male and gvw for female,\r\nfor example, if ric is igo and malte’s son, his full name would be ric igojk maltejk, but had\r\nric been a girl, her name would have been ric igogvw maltegvw.All the Prendonians were monogamic and faithful to their partners. There are no registers\r\nof male homosexual couples, but it was common for two women to be married, and there has\r\nnot been a single case of married siblings in Prendonian history. A couple was not considered\r\nmarried until they had given birth to a child or adopted one.Given N 3 word names, write a program that prints YES if they are all valid and part of\r\na valid Prendonian family tree and everyone is related to everyone else, print NO otherwise.InputThe ﬁrst line consists of a single integer T (1 ≤ T ≤ 30), which is the number of test\r\ncases. Each test case begins with a line with only the integer N (1 ≤ N ≤ 1000), the number\r\nof names, followed by N lines with 3 word (a-z lowercase only, each word not longer than 103\r\ncharacters), the ﬁrst word is guaranteed to be unique.OutputFor each test case print YES if the names are all valid and part of a valid Prendonian\r\nfamily tree and are all related to each other, print NO otherwise.ExampleInput:1\r\n3\r\ndocs afegvw fegvw\r\ndraw rridajk cajk\r\npito docsjk drawjkOutput:YES",
  "sample_input": "Input:1\r\n3\r\ndocs afegvw fegvw\r\ndraw rridajk cajk\r\npito docsjk drawjkOutput:YES",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PRENDON",
  "scraped_at": "2025-08-17 00:33:21"
}