{
  "problem_code": "problems",
  "title": "Derp",
  "tags": [],
  "text": "Usually, producing methamphetamine is somewhat laborous and boring. There are\r\nsome TV series who assume that there is a new way to produce it, being way cheaper\r\nthan actually is. Nonsense. The fact is there is a new drug around, called Krokodil.\r\nThis drug is a variation of morphine, which gives 8 to 10 times more hallucination\r\nthan “meth”, costing up to 10 times less than it.Your friend Derp works in a “meth lab” and, while he was doing some tests,\r\nlooking at the microscope, he found an interesting property: if he isolates the most\r\nfar away pair of atoms in it, he will produce a substance as powerful (perhaps even\r\nmore) as Krokodil is. This happens because one of the electron moves from one\r\natom to the other.But, most of the times, there are hundreds, maybe thousands of particles in\r\neach sample, each of them using several layers, making kinda hard to ﬁnd out\r\nwhich is the longest distance. There’s an unusual fact about this distance calculus:Each electron from these particles are kinda dumb; they are only able to move in\r\nhorizontal and vertical axis. Also, since there are nanometrical layers, and distance\r\nis also considered for calculation between layers (which is the same), and a electron,\r\nin the layer L, with position (x, y), can only move to layers L + 1 and L − 1, if any\r\nof those exist, in the same relative position as in layer L.InputEach input contains several test cases. The ﬁrst line of every test case contains a\r\nnumber N, which is the number of particles of that sample (2 ≤ N ≤ 100,000).Then there are N lines, each of which contains 3 integers, li, xi, yi, which\r\nare the actual layer, the position corresponding corresponding to the X-axis, and\r\nthe position corresponding to Y-axis (1 ≤ li, xi, yi ≤ 1,000,000,000).OutputFor each output you print one integer, DISTANCE, which corresponds to the value\r\nof the farthest distance between particles in the that sample.ExampleInput:5\r\n1 1 2\r\n3 4 1\r\n2 5 7\r\n4 1 1\r\n3 3 3\r\n0Output:12",
  "sample_input": "Input:5\r\n1 1 2\r\n3 4 1\r\n2 5 7\r\n4 1 1\r\n3 3 3\r\n0Output:12",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DERP",
  "scraped_at": "2025-08-17 00:33:21"
}