{
  "problem_code": "problems",
  "title": "Exclusive Security",
  "tags": [],
  "text": "Ashton Carl McDonald (known as A.C.M.) works at a company called XOR (XptO Revolution). The company has a simple rule for employee identification: each employee must have an integer id that must be unique (no two employees may have the same id).Recently, the employees were grouped into teams, in the following way: the teams are intervals on the XOR’s employees list. An employee can be part of more than one team.The company wants to hire new employees, and needs to generate id numbers for them. However, due to a security flaw in Human Resources software, the company can’t assign a new number that, if one executes Exclusive-Or operation with all numbers of any team, results in 0.McDonald, as the leader lazy programmer of XOR, needs your help to determine if a given number can or can’t be assigned to a new employee.InputThe input contains multiple test cases.The first line of each test case contains three numbers, N, T and Q, the number of employees in the company, the number of teams and the number of new numbers to be queried, respectively.The second line contains N numbers Xi, 1 ≤ i ≤ N, distinct, the employees id numbers.Each one of the following E lines contains two numbers, A and B, which represent an interval that forms a team. It means that the employees identified by XA… XBform one team.Each one of the following Q lines contains one number Yj, the queried number.Limits: 1 ≤ N, T, Q ≤ 105, 1 ≤ A ≤ B ≤ N. All Xiand Yjwill be non-negative and fit into a signed 32 bit integer, and all queries must be treated as independent from others (just the initial employees and teams must be taken into account).OutputFor each test case, the program must print Q + 1 output lines. For each queried number, the program must print ‘Y’, if the number can be assigned to a new employee, or ‘N’, otherwise. The last line is a simple minus sign ‘-’.ExampleInput:3 2 41 2 41 21 335670 0 0Output:NYYN-",
  "sample_input": "Input:3 2 41 2 41 21 335670 0 0Output:NYYN-",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/EXCLSEC",
  "scraped_at": "2025-08-17 00:33:05"
}