{
  "problem_code": "problems",
  "title": "MONO",
  "tags": [],
  "text": "Mirko soon realised that number sequences are not the best career choice, and went right back to letter table business.Mirko’s table has R rows and C columns and consists of lowercase letters. Each cell of the table is a square of equal size. We assign coordinates to vertices of those squares, so that upper-left corner of the table has coordinates (0, 0), upper-right (C, 0), lower-left (0, R), and lower-right (C, R).We say that polygon within the table is monoliteral if the following holds:its vertices are from the described set of cell-square vertices,its edges are parallel to coordinate axes,all letters inside the polygon are equal.A simple polygon for which first two conditions are true (third one may or may not be true) is given.Mirko would like to know the number of monoliteral polygons that can be obtained by moving the given one up, down, left, or right or any combination thereof, but not rotating.InputThe first line of input contains two space separated integers R and C (1 ≤ R, C ≤ 500).Each of the next R lines contains exactly C lowercase letters, this is Mirko’s table.The following line contains integer V (4 ≤ V ≤ 500), number of vertices of given polygon.Each of the next V lines contains two integers X, Y (0 ≤ X ≤ C, 0 ≤ Y ≤ R). These are the coordinatesof the vertices of the given polygon. Vertices are given in clockwise order.The given polygon will satisfy conditions 1 and 2 from above.OutputIn the first and only line of output, print expected number of polygons.ExamplesInput:3 3\r\naaa\r\naaa\r\naaa\r\n4\r\n2 0\r\n2 2\r\n0 2\r\n0 0Output:4Input:3 3\r\naaa\r\naba\r\naaa\r\n4\r\n2 0\r\n2 2\r\n0 2\r\n0 0Output:0Input:5 4\r\nxyyx\r\nxyyy\r\nxxyy\r\nxxxx\r\nxxxx\r\n8\r\n1 3\r\n1 2\r\n0 2\r\n0 0\r\n2 0\r\n2 1\r\n3 1\r\n3 3Output:2",
  "sample_input": "Input:3 3\r\naaa\r\naaa\r\naaa\r\n4\r\n2 0\r\n2 2\r\n0 2\r\n0 0Output:4",
  "sample_output": "Input:3 3\r\naaa\r\naba\r\naaa\r\n4\r\n2 0\r\n2 2\r\n0 2\r\n0 0Output:0",
  "link": "https://www.spoj.com/problems/MONO",
  "scraped_at": "2025-08-17 00:33:20"
}