{
  "problem_code": "problems",
  "title": "Wachovia Bank",
  "tags": [],
  "text": "Danilo Gheyi is a renowned bank robber. He is known worldwide for accomplishing the most profitable bank robbery, in Fortaleza, Ceará. Danilo and his friends dug a tunnel to get into the main chest. There were some bags, with different amounts of money or jewelry and weight. They had to leave about 50% of the total value, since the truck couldn't carry all the bags.Danilo wasn't caught, and to show that he can do itall again, he is planning a robbery to one of the safer banks in USA -the Wachovia Bank. He wants your help to maximize the amount stolen, avoiding a huge loss as it happened in Fortaleza.Write a program that, given the maximum weight the truck is ableto carry and the information about each bag in the bank, determine the maximum value that Danilo can steal.InputThe input consists of several instances. There is an integer N (1 ≤ N ≤ 200) in the first line; it stands for the number of instances. The first line of each instance contains two integers, K and M (8 ≤ K ≤ 1000 and 1 ≤ M ≤ 50) representing, respectively, the maximum weight the truck can handle and the amount of bags in the bank. The next M lines describe each bag with two integers A and B (8 ≤ A ≤ 200 and 1 ≤ B ≤ 25): the weight and the value of the bag, respectively.OutputFor each instance output a sentence “Hey stupid robber, you can get P.”, and P represents the maximum value Danilo can steal.ExampleInput:3\r\n34 5\r\n178 12\r\n30 1\r\n13 7\r\n34 8\r\n87 6\r\n900 1\r\n900 25\r\n100 10\r\n27 16\r\n131 9\r\n132 17\r\n6 5\r\n6 23\r\n56 21\r\n100 25\r\n1 25\r\n25 25\r\n100 2Output:Hey stupid robber, you can get 8.\r\nHey stupid robber, you can get 25.\r\nHey stupid robber, you can get 99.",
  "sample_input": "Input:3\r\n34 5\r\n178 12\r\n30 1\r\n13 7\r\n34 8\r\n87 6\r\n900 1\r\n900 25\r\n100 10\r\n27 16\r\n131 9\r\n132 17\r\n6 5\r\n6 23\r\n56 21\r\n100 25\r\n1 25\r\n25 25\r\n100 2Output:Hey stupid robber, you can get 8.\r\nHey stupid robber, you can get 25.\r\nHey stupid robber, you can get 99.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/WACHOVIA",
  "scraped_at": "2025-08-17 00:33:18"
}