{
  "problem_code": "problems",
  "title": "Ada and Easy Game",
  "tags": [],
  "text": "Ada the Ladybug is frequently playing board games against her friend Velvet Mite Vinit. Last time, they were playingGame of Digits. Anyway Vinit is slightly mad at Ada, because she \"cheated\". She let one of her good friends to make program which helped her significantly. As Vinit wants to avoid this, he createdGame of Pileswith his own rules. He puts many piles with many nuts on the table. He then chooses a few numbers (rules), which are possible moves. Ada and Vinit play alternately (as Vinit is gentleman, Ada starts). In each move one can choose a pile, any number from rules (not  greater than the number of nuts in the pile) and eats that many nuts from pile. The one who can't move looses. Vinit is very excited to play since he is ensured Ada can't cheat this time.Well that was just a fun fact from world of bugs and now lets solve some completely different problem. Your good friend Ada has asked you to help her win a game against one of her friends...InputFirst line of input will consistT ≤ 200number of test-cases.Each testcase will begin with two numbers0 < N ≤ 105[number of piles] and0 < M ≤ 30[number of rules].The next line will consist ofMnumbers,1 ≤ Ri≤ 105[rules]The last line of each test-case will consist ofNnumbers,1 ≤ Pi≤ 105[sizes of pile]OutputFor each test-case, print the name of winner (\"Ada\" or \"Vinit\")  [if both played optimally].Example Input6\r\n4 1\r\n2\r\n1 2 3 4\r\n4 2\r\n1 2\r\n4 4 3 5\r\n1 3\r\n2 3 5\r\n20\r\n2 2\r\n1 3\r\n4 7\r\n5 5\r\n1 2 7 13 15\r\n10 20 30 40 50\r\n1 2\r\n1 2\r\n98997Example OutputVinit\r\nAda\r\nAda\r\nAda\r\nAda\r\nVinit",
  "sample_input": "6\r\n4 1\r\n2\r\n1 2 3 4\r\n4 2\r\n1 2\r\n4 4 3 5\r\n1 3\r\n2 3 5\r\n20\r\n2 2\r\n1 3\r\n4 7\r\n5 5\r\n1 2 7 13 15\r\n10 20 30 40 50\r\n1 2\r\n1 2\r\n98997",
  "sample_output": "Vinit\r\nAda\r\nAda\r\nAda\r\nAda\r\nVinit",
  "link": "https://www.spoj.com/problems/ADAGAME2",
  "scraped_at": "2025-08-17 00:33:13"
}