{
  "problem_code": "problems",
  "title": "Joining lines",
  "tags": [],
  "text": "Two years ago we had a setback when Joaquín, a member of the jury, had an accident which prevented us from including the problem \"Playing with lists\" in that year's problem set for the Argentinian Programming Tournament. Thanks to the contest's participants, who kindly helped us solve that problem, we planned to include it in today's problem set. Unfortunately, we had a new inconvenience with Jacinto, another jury member.As it happens, Jacinto doesn't like it when the sample test cases included along with the problem statements span more than one page. For the problem \"Playing with lists\", each test case consists of a single line with the description of a list. We don't want to say too much about them because the problem is definitely going to be used next year, so for now we'll just provide you with the total number of characters for each test case, clarifying that it's not allowed to \"split\" a test case in order to write it in multiple lines.We would like to write the input for theNsample test cases in a single page, in which we can fit at mostLlines ofCcharacters each. The inconvenience appears when there are more sample test cases than there are lines available in the page, so that we cannot write each of them in a separate line. In order to circumvent this problem, Jacinto suggested drawing vertical segments spanning the whole height of the page, dividing it in two or more columns. These segments should have negligible width, so that the number of characters we can write in each line is not reduced, and will act as visual separators splitting each of the lines they cross. In this way, we can write each sample test case in a different line belonging to some column, as long as it doesn't cross the vertical segments. For the purposes of this problem, the order of the sample test cases is considered to be irrelevant.For example, let's consider the situation in which there areN = 5sample test cases in a page fittingL = 3lines ofC = 11characters each. If the test cases haveK1= 3,K2= 4,K3= 5,K4= 6andK5= 7characters, we can split the page in two columns in such a way that one column has a width of7characters, while the other one has a width of4characters. In the larger column we may write the test cases withK3= 5,K4= 6andK5= 7characters in any order, whereas in the other column we can write the remaining sample test cases, havingK1= 3andK2= 4characters, again in any order.Thus, two possible ways in which we can fit the sample test cases in this example arewhere for example5/7means we have used5of the7available characters in the corresponding column.In an analogous situation for which the number of characters fitting in a single line isC = 10, we would need a column of at least7characters of width in order to write in it the larger sample test case. Therefore, it would be impossible to have any other column of width greater than3characters, which in turn means that4of theN = 5sample test cases should be written in the largest column. But this is clearly impossible, as there are onlyL = 3lines in the page. On the other hand, let us also note that although the sample test cases withK1= 3andK5= 7characters can in principle be written in a single line, as well as the sample tests cases withK2= 4andK4= 6characters, it is impossible to simultaneously put both pairs in one page in this way, as the width of each column should be the same along all the lines in the page.Now we would like your help in order to determine if it is possible to make Jacinto happy by putting all the sample test cases in a single page as described above.InputThere are multiple test cases in the input file. For each test case, the first line contains three integer numbersN,LandC. The integerNrepresents the number of sample test cases,Lrepresents the maximum number of lines fitting in a page, andCrepresents the maximum number of characters fitting in a line (1 ≤ N, L, C≤5000). The second line containsNinteger numbersK1,K2, ...KN, representing the total number of characters in each sample test case (1≤Ki≤Cfori = 1, 2, ... N).OutputFor each test case, print a single line containing a character representing if it is possible to write all sample test cases in a single page as described in the problem statement. The printed character should be an'S'if this is possible, and an'N'otherwise.ExampleInput:5 3 11\r\n3 4 5 6 7\r\n5 3 10\r\n3 4 5 6 7\r\n3 3 4\r\n1 3 2\r\n6 3 4\r\n1 3 1 2 1 1Output:S\r\nN\r\nS\r\nS",
  "sample_input": "Input:5 3 11\r\n3 4 5 6 7\r\n5 3 10\r\n3 4 5 6 7\r\n3 3 4\r\n1 3 2\r\n6 3 4\r\n1 3 1 2 1 1Output:S\r\nN\r\nS\r\nS",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2016J",
  "scraped_at": "2025-08-17 00:33:06"
}