{
  "problem_code": "problems",
  "title": "Leonardo de Pisa",
  "tags": [],
  "text": "Leonardo de Pisa is a very cautious man, and even though Christmas is still many months away, he has already bought his Christmas tree. It is a very, very high tree, even higher than the Tower of Pisa. Leonardo wishes to decorate his tree by using colored balls and lights. To that end, he has bought many balls of each possible integer diameter between1andN. In fact, he has bought so many balls that he has no idea of what to do with all of them.In Pisa, each ball has two cords hanging from it, to which other balls can be attached. By doing so, they make sure that the balls never fall from the tree and roll all the way across the floor, until finally stopping underneath a big piece of furniture where they cannot easily be found. All of the cords hanging from all of the balls have a length of 20 centimeters.Just like any good Christmas tree, Leonardo's tree has a top. On it, Leonardo will place a ball of diameterN, as those are the most alluring. All of the other balls in the tree will hang from this top ball either directly, or indirectly by means of other balls. Leonardo has carefully studied the way in which he must hang the balls so that his tree is the most beautiful tree in all of Pisa, and he has arrived at the following conclusions:No ball of diameter1or2must have another ball hanging from it.Every ball of diameterk ≥ 3must have two balls hanging from it: one of diameterk-1, and the other of diameterk-2.The following pictures show two examples of how Leonardo's tree would look after decorating it with balls. The left figure corresponds to the case in which he buys every ball up to diameterN = 4, while the right figure corresponds to the case with balls of diameter up toN = 5(the number written on each ball indicates its diameter).There is always enough room for Leonardo to add as many balls as he wants, for his tree is incredibly tall. However, he still feels that his tree is not the most beautiful tree in the city: It is missing colored lights!Leonardo has bought a special string of lights suitable for trees with balls. The string hasKlights tied together by cord, such that the lights are separated from each other by 20 centimeters of cord. Each light fits perfectly onto some balls, depending solely on their size: a light of typeionly fits onto balls of diameteri, for eachibetween1andN. If the diameter of the ball is larger thani, the ball will not fit, and if it is smaller thani, the light will fall to the floor. Two lights can never be attached to the same ball, and the cord between the lights must always be perfectly tight. In particular, that means that if there is no cord in the tree between two balls, then their distance will not be exactly 20 centimeters, and so it will not be possible to place two consecutive lights on top of them.The following picture shows four different strings of lights, colored gray.By the time that Leonardo bought the string of lights, he had already finished decorating his tree with balls. It was such an effort to do so, that he is completely determined not to add, remove, or move any ball from the tree. Now he does not know if he will be able to use the string of lights that he bought, as he needs to find a sequence of balls in the tree that are adequately hanging from each other, and that have precisely the diameters that the lights fit onto.For example, the first string previously shown can be placed on each of the two trees; the second one can only be placed in the second tree; the third and fourth strings cannot be placed on any tree. The following picture shows the first string placed on the first tree, and the second string placed on the second tree.Help Leonardo to know, given the string of lights and the diameterNof the largest ball that he bought, whether it is possible to place the string of lights on his tree.InputThere are multiple test cases in the input file. For each test case, the first line contains two integersNandK, withNrepresenting the maximum diameter of the balls, andKrepresenting the number of lights in the string (2 ≤ N, K≤105). The second line containsKintegersL1, L2... Lkdescribing the string of lights. The ith integerLirepresents the type of thei-th light in the string (1≤Li≤Nforibetween1andK).OutputFor each test case, write a single line containing a single character, indicating whether Leonardo can place the string of lights or not. The character must be an 'S' if Leonardo can place the string of lights, and an 'N' otherwise.ExampleInput:3 2\r\n2 3\r\n4 4\r\n1 3 4 2\r\n5 2\r\n3 5\r\n4 2\r\n4 1\r\n6 3\r\n2 3 2\r\n8 4\r\n2 3 3 1\r\n10 10\r\n2 3 4 5 6 8 7 5 3 1Output:S\r\nS\r\nS\r\nN\r\nN\r\nN\r\nS",
  "sample_input": "Input:3 2\r\n2 3\r\n4 4\r\n1 3 4 2\r\n5 2\r\n3 5\r\n4 2\r\n4 1\r\n6 3\r\n2 3 2\r\n8 4\r\n2 3 3 1\r\n10 10\r\n2 3 4 5 6 8 7 5 3 1Output:S\r\nS\r\nS\r\nN\r\nN\r\nN\r\nS",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2016L",
  "scraped_at": "2025-08-17 00:33:10"
}