{
  "problem_code": "problems",
  "title": "Can you draw it or not?",
  "tags": [],
  "text": "Given a graph, you have to find if the graph can be drawn without taking the hands away. Assume that you are going to draw the given graph on a paper and you have to find whether you can draw it at a single stroke, i.e, without taking the hands away. And also, you are allowed to draw the graph only once. That is, you can't draw a single edge more than once. The given graph will have N nodes, numbered from 1 to N.Consider the following graphs. For input clarity of the graphs, refer to the sample inputInputThe first line has the number of test cases, T.Then for each test case, the first line has the integer N, the number of nodes.The second line has the integer K.Then K lines follow that, each line having three integers S, D, M denoting that there are M edges between the two nodes S and D.Constraints1 <= T <= 501 <= N <= 1001 <= K <= (N * ( N – 1) ) / 21 <= S, D <= N1 <= M <= 100OutputFor each test case, if the graph can be drawn so, print \"YES\" followed by a single space and the node from which you have to start drawing. If there are more than one node from where it's right to start drawing, print the node with the least value.If the graph can't be drawn so, just print \"NO\".ExampleInput:2\r\n4\r\n6\r\n1 2 2\r\n1 3 1\r\n1 4 2\r\n2 3 2\r\n2 4 1\r\n3 4 2\r\n5\r\n10\r\n1 2 1\r\n1 3 1\r\n1 4 1\r\n1 5 1\r\n2 3 1\r\n2 4 1\r\n2 5 1\r\n3 4 1\r\n3 5 1\r\n4 5 1Output:NO\r\nYES 1Note:1) If there are more than one edge between two nodes, assume that those edges are of different forms. See the above picture for more clarity.2) If there are M edges from S to D, then there are also M edges from D to S.",
  "sample_input": "Input:2\r\n4\r\n6\r\n1 2 2\r\n1 3 1\r\n1 4 2\r\n2 3 2\r\n2 4 1\r\n3 4 2\r\n5\r\n10\r\n1 2 1\r\n1 3 1\r\n1 4 1\r\n1 5 1\r\n2 3 1\r\n2 4 1\r\n2 5 1\r\n3 4 1\r\n3 5 1\r\n4 5 1Output:NO\r\nYES 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DRAWIT",
  "scraped_at": "2025-08-17 00:33:15"
}