{
  "problem_code": "problems",
  "title": "Ada and Orange Tree",
  "tags": [],
  "text": "Ada the Ladybug lives near an orange tree. Instead of reading books, she investigates the oranges. The oranges on orange tree can be in up to 5×50 Shades of Orange. She walks from orange to orange, examining different properties of orange tree. The oranges are connected by branches. There are more oranges than branches, yet it is still possible to get from any orange to any other orange [through branches]. The tree is rooted.Ada has many questions in following form: She goes from orangeAto orangeB(by shortest path) and is interested in total number different Shades of Orange among all subtrees of all edges on shortest path.InputThe first line of input consists of1 ≤ T ≤ 100, the number of test-cases.The first line of each test case contains three integers1 ≤ N, Q ≤     4.5×105, 0 ≤ R < N, the number of oranges, the number of questions and number of root.Next line containsNintegers1 ≤ Si≤ 250, the shade of orange of orangei.NextN-1lines contains two integers0 ≤ I, J < N, I ≠ J, the numbers of oranges which are connected by branch.NextQlines contains two integers0 ≤ A, B < N, the path Ada is interested about.The sum of allNand allQamong all test-cases won't exceed106OutputFor each question answer the number of shades in all subtrees of all nodes on shortest path fromAtoB.Example Input1\r\n10 7 1\r\n1 2 1 4 5 6 6 8 9 9\r\n0 9\r\n9 3\r\n3 4\r\n4 6\r\n4 5\r\n4 8\r\n1 3\r\n1 2\r\n2 7\r\n4 4\r\n8 6\r\n0 6\r\n7 0\r\n7 2\r\n0 0\r\n2 3Example Output3\r\n3\r\n5\r\n7\r\n2\r\n1\r\n7Explanation - shades in subtrees5 6 9\r\n5 6 9\r\n1 4 5 6 9\r\n1 2 4 5 6 8 9\r\n1 8\r\n1\r\n1 2 4 5 6 8 9",
  "sample_input": "1\r\n10 7 1\r\n1 2 1 4 5 6 6 8 9 9\r\n0 9\r\n9 3\r\n3 4\r\n4 6\r\n4 5\r\n4 8\r\n1 3\r\n1 2\r\n2 7\r\n4 4\r\n8 6\r\n0 6\r\n7 0\r\n7 2\r\n0 0\r\n2 3",
  "sample_output": "3\r\n3\r\n5\r\n7\r\n2\r\n1\r\n7",
  "link": "https://www.spoj.com/problems/ADAORANG",
  "scraped_at": "2025-08-17 00:33:03"
}