{
  "problem_code": "problems",
  "title": "Highschool Homework",
  "tags": [],
  "text": "Hugo had quite a bad day today. His favourite high school subject, mathematics, was taught by his least liked substitute teacher - he always gave out an abnormally large amount of homework. Today was no different.The teacher wroteNnumbers on the board, and after a long thoughtful pause he told the class with a grin: \"Well then, kids. For today's homework you will do this harmless exercise. As you can see, I've written quite a few numbers on the board, and your task is to find which two of them have the greatest product. Hm, now that I think about it, that would be too trivial. So you will also have to find which pair of numbers has the greatest quotient. Well, and now that we're at it, why don't you find the pair with the smallest quotient, too. And at that point you might as well find the pair with the smallest product. That should keep you busy for today's evening!\".Sigh.How could someone even come up with such a boring, time-consuming and impractical task. If only there was someone who would help Hugo and do it for him.InputThe first line of input contains the number1 ≤ T ≤ 15: the number of test cases.Tcases follow. The first line of each case contains the number2 ≤ N ≤ 105: how many numbers the teacher wrote on the board. The second line containsNintegers; their absolute value will be in the range[1, 106](inclusive). In particular, notice that none of them are equal to zero. You may assume that in any input file, the sum ofNacross all test cases does not exceed3*105.OutputFor each case, output five lines. The first one contains the number of the case x in the format \"Case x:\", starting at 1.Then output four lines, each containing two integers from the input (let's call themxandy). They need to have the following properties (in this order):x * yis the greatest possiblex * yis the lowest possiblex / yis the greatest possiblex / yis the lowest possibleIf there are multiple pairs of integers which fulfil the criteria, output the one with the lowestx.x, ymay be equal, but in that case their value has to appear at least twice in the input. All four lines are independent, that is the same integer from the input may be used across multiple lines. A numberAis said to be greater thanBifA > Band lower thanBifA < B.ExampleInput:1\r\n3\r\n5 -7 10Output:Case 1:\r\n5 10\r\n-7 10\r\n10 5\r\n10 -7",
  "sample_input": "Input:1\r\n3\r\n5 -7 10Output:Case 1:\r\n5 10\r\n-7 10\r\n10 5\r\n10 -7",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HSHW",
  "scraped_at": "2025-08-17 00:33:08"
}