{
  "problem_code": "problems",
  "title": "Januarius, The Travelling Clairvoyant",
  "tags": [],
  "text": "The annual Congress of Mages is approaching. Januarius the Clairvoyant intends to participate in it. He has to somehow reach the city where the convention takes place.His favourite means of transportation is railway. He plans to travel using a convenient, direct connection. The train will visitnstations, numbered with consecutive integers. It will depart from station number 1, with station numbernas its destination. Remaining stations are intermediate - the train will visit them in order, according to their numbers.Januarius likes travelling by train for a lot of reasons - it's comfortable, you can admire the landscape in peace - but most importantly, tickets are quite cheap. National Railways determined that cost of the trip depends only on the number of sections between stations covered during the ride. Ticket forisections costswi. Obviously, the prices become higher when the trip gets longer.You could also travel without a ticket if you're feeling adventurous, but of course there is a risk of unexpected ticket inspection, which can happen during the ride between two consecutive stations. Life of the clairvoyant is devoid of any surprises though - Januarius knows exactly when there will be an inspection. He doesn't have to buy full ticket - it's only important to have valid ticket during the inspection (starting station can be any station before the inspection, and the destination can be any station after the inspection).There are two ways to buy a ticket - from the ticket office at the station, or already on the train, from the ticket inspector. There are limitations though. If you board the train without a ticket, you have to find the inspector immediately after the departure. He only sells tickets starting from the station you boarded the train at. Also, if you boarded the train at the station with a ticket office, you have to pay an additional constant fee ofd.Januarius has no time to get off the train during the ride, so he can either buy the ticket at the first station in a ticket office, or at any station from the inspector (he can approach him immediately after the departure from the station and tell him he just boarded the train).Find the cheapest ticket-buying strategy. You must have a valid ticket during every inspection.InputThe first line contains a single integert, denoting the number of test cases. Then, descriptions of the test cases follow.First line of the description consists of three integersn,kandd- number of stations, number of inspections and an additional fee for buying a ticket from the inspector in case there is a ticket office at the station (1 ≤n≤ 106, 1 ≤k≤ 1000, 1 ≤d≤ 109).In the second line there is a string of lengthn. If station numberihas a ticket office,i-th character of this string is \"1\", otherwise it's \"0\".In the third line there aren-1 integers.i-th numberwidenotes price of coveringisections. (1 ≤wi≤ 109,wi<wi+1).In the last line there arekintegerssi- stations numbers.i-th ticket inspection will take place between the station numbersiand the station numbersi+1. (1 ≤si≤n-1,si<si+1)OutputFor every test case you should output a ticket-buying strategy that minimizes total cost. Description of the strategy starts with two integerssandb- total cost of the tickets and number of tickets (1 ≤b≤n). Descriptions of the tickets should follow. One ticket description consists of two integerspiandci- starting station and number of segments for which the ticket is valid. (1 ≤pi<n, 1 ≤ci≤n-pi).You should describebtickets, their total cost must be equal tos, and it has to be minimal.ExampleInput:1\r\n5 2 5\r\n11001\r\n2 6 7 10\r\n2 4Output:8 2\r\n1 2\r\n4 1ExplanationThere are two inspections - between stations 2 and 3, and between stations 4 and 5. Januarius can buy a ticket in the ticket office from the station number 1 to the station number 3, and another one from the inspector from station number 4 to station number 5, and it will cost him 6+2=8.If he bought the first ticket from the second station instead from the first, it would be more expensive - there is a ticket office at the second station, so there will be an additional fee for buying the ticket from the inspector. (2+5+2=9).",
  "sample_input": "Input:1\r\n5 2 5\r\n11001\r\n2 6 7 10\r\n2 4Output:8 2\r\n1 2\r\n4 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/JAN",
  "scraped_at": "2025-08-17 00:33:17"
}