{
  "problem_code": "problems",
  "title": "Paper Fold",
  "tags": [],
  "text": "Sedrak likes making various things from paper (and he's very good at that). But after he finishes the job, his table is covered with a lot of useless creased, scrappy paper. Can he use them somehow?Imagine a thin strip of paper marked with creases at regular intervals, which we can think of as a line segment divided into equal-length subsegments. Each crease point is marked with asmountain,valley, orflatto specify the orientation of the crease (∧, ∨, -). For example the input might look as follows:Sedrak thinks, he can use the scrap, if it is possible to fold it usingallthe marked creases with the specified orientations. The operations he is allowed are as follows. Given a particular crease (∧ or ∨),simple foldrotates the portion of the segment to the left of the crease around the portion of the segment to the right of the crease. The rotation is counterclockwise for a mountain fold, and clockwise for a valley fold. When multiple layers of paper come in contact, they become inseparable; in other words, each simple fold must fold all layers of paper. For example, here is how he might fold the example above:Notice that when a subsegment is folded, the crease turns upside-down, inverting ∧↔∨. Thus, for a simple fold to bevalid,the inversions of the creases to the left must match the creases to the right.InputThe first line of input file contains the number 1 ≤ N ≤ 20 - the number of paper scraps on Sedrak’s table. Next N lines contain descriptions of paper scraps as a string containing symbols ‘^’, ‘v’ and ‘-‘. The length of a single description does not exceed 10^6.OutputFor each description line of the input file, output a single line containing “Yes”, if Sedrak can use the scrap, and “No” otherwise.ExampleInput:6\r\n-^vv-\r\n--v-\r\n-vv-\r\n^vv^\r\nv-v^-^^\r\n--^-v^^-v--Output:Yes\r\nYes\r\nNo\r\nYes\r\nNo\r\nYesNOTE: The last example corresponds to the scrap in the figure.",
  "sample_input": "Input:6\r\n-^vv-\r\n--v-\r\n-vv-\r\n^vv^\r\nv-v^-^^\r\n--^-v^^-v--Output:Yes\r\nYes\r\nNo\r\nYes\r\nNo\r\nYes",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PFOLD",
  "scraped_at": "2025-08-17 00:33:16"
}