{
  "problem_code": "problems",
  "title": "RPS Warfare",
  "tags": [],
  "text": "The Danubian Lowland has always been a very fertile area. No wonder that a long, long time ago there wereNkingdoms situated by the Danube river. As all good kingdoms do, each had chosen its favourite weapon, with  which it equipped its armies in times of war.The Danube arsenal was quite limited - in these ancient times only three weapons were available: Rocket launchers, Pistols and Swords.  An army equipped with rocket launchers devastated those which challenged it with swords. At the same time, they did not stand a chance against opponents using pistols. And as you might already suspect, an army relying on pistols could not withstand the might of a sword-wielding army. Hence, we say that rocket launchers beat swords, swords beat pistols, and pistols beat rocket launchers.Try to guess why the first two paragraphs were dedicated to kingdoms and their weapons. Exactly - these  kingdoms constantly fought against each other! Each kingdom went to war with both of its neighbours every year (respectively one, if the kingdom was the left or rightmost). Every war lasted exactly one year, after which the victorious kingdom captured one enemy territory. Of course, just after that another war began.You are given a description of the kingdoms by the Danube river -Ncharacters representing the chosen weapon of each kingdom - in the year 0. Each year, every kingdom will go to war with its neighbouring kingdoms. If two kingdomsaandbgo to war, and the weapon of kingdomabeats the weapon of kingdomb, then at the end of the year kingdomawill capture one territory (one character) of kingdomb. If two kingdoms defeat the same territory of a kingdom at once, they decide which one captures the territory by a game of rock-paper-scissors.After some finite number of years, there will only be a single weapon which all the remaining kingdoms are using. Find out which one.InputThe first line contains an integer1 ≤ T ≤ 30: the number of test cases.Ttest cases follow.For each case, the first line contains the integer1 ≤ N ≤ 106- the number of kingdoms by the Danube river. The second line containsNcharacters representing each kingdom's chosen weapon:Rfor rocket launchers,Pfor pistols, andSfor swords.The sum ofNwithin one input file does not exceed2×106.Warning - the input is quite large. Make sure to read it efficiently.OutputFor each test case, output \"Casex: \", wherexis the number of the test case, starting from 1, followed by the characterR,PorS: the character representing the weapon which will conquer the entire river bank of Danube.ExampleInput:2\r\n3\r\nRPS\r\n7\r\nRRRRRRPOutput:Case 1: S\r\nCase 2: PIn case 1, after the first year the situation will be PSS, and then after the second SSS.In case 2, it will take the pistol-using kingdom six years, but no rocket launcher-equipped kingdom will be able to stop it.",
  "sample_input": "Input:2\r\n3\r\nRPS\r\n7\r\nRRRRRRPOutput:Case 1: S\r\nCase 2: P",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RPSWAR",
  "scraped_at": "2025-08-17 00:33:05"
}