{
  "problem_code": "problems",
  "title": "Absurd prices",
  "tags": [],
  "text": "Surely you know that supermarkets, shopping centres, and indeed all kind of vendors seem to have fallen in love with the digit9, for that digit occurs most often in the price of a product, preferably at the least significant positions. Your favourite chocolate bar might cost99cents, just right to be able to advertise that it costs less than1euro. Your new bicycle might cost499.98euros, which, of course, is less than500euros.While such comparisons are mathematically sound, they seem to impose a certain amount of stupidity on the customer. Moreover, who wants to carry home those annoying small coins you get back as change?Fortunately, the FIFA has not adopted this weird pricing scheme: a ticket for the final in the first category for example costs900dollar, in the second category600dollar and in the third category400dollar. These prices may only be regarded weird for other reasons.We want to distinguish betweenabsurdprices like99cents,499.98euros, etc. and normal prices. To measure the absurdity of a positive integer, do the following:Eliminate all trailing zeros, i.e., those in the least significant positions, from the number. You now have a positive integer, sayx, with a non-zero digitdat its end.Count the number of digits, saya, of the numberx.ifd=5the absurdity of the number is2 * a - 1otherwise, the absurdity of the number is2 * aFor example, the absurdity of350is3and the absurdity of900900is8. Using the measure of absurdity, we can define what we call an absurd price: A pricecis absurd if and only if the closed interval [0.95 * c,1.05 * c] contains an integeresuch that the absurdity ofeis less than the absurdity ofc. Given a price in cents, go ahead and tell whether it is absurd!InputThe first line of the input consists of the numbertof test cases to follow. Each test case is specified by one line containing an integerc. You may assume that1 ≤ c ≤ 109.OutputFor each test case output ifcis absurd or not. Adhere to the format shown in the sample output.ExampleInput:4\r\n99\r\n49998\r\n90000\r\n970000000Output:absurd\r\nabsurd\r\nnot absurd\r\nabsurd",
  "sample_input": "Input:4\r\n99\r\n49998\r\n90000\r\n970000000Output:absurd\r\nabsurd\r\nnot absurd\r\nabsurd",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ABSURD",
  "scraped_at": "2025-08-17 00:33:19"
}