{
  "problem_code": "problems",
  "title": "Yet Another Assignment Problem",
  "tags": [],
  "text": "New semester is coming.  As the class monitor,Cathy Yinis going to make necessary preparations.  She hasmjobs to do,nclassmates are going to help her.  Each job requires some classmates working on it for certain time, say thei-th classmate must work on thej-th job forAijminutes.  As an OIer of great responsibility she wishes to finish all jobs as soon as possible.  But a classmate can do only one job at a time, and two classmates cannotdo the same job at the same moment.  For example, to decorate the classroom, Alpha must work on it for 3 minutesplusBeta works on it for 4 minutes, then one possible assignment will be ABABBAB, taking 7 minutes in total.Now she is going to make a detailed schedule specifying who is doing what at each moment.  Jobs are independent and may be done in any order.  Also for each job anyone can do it for arbitrarily long, butnotlonger than the required timeAij.  Anyone can be free at any time.  Time for certain classmate doing certain work neednotbe consecutive.As her friend, you are to help her to work out the schedule minimizing the total time needed.InputFirst line of the input contains two positive integersm,n(1 ≤m,n≤ 2000), number of jobs and classmates.mlines follow, each describing a job.i-th line containsnnon-negative integers (≤ 106), where thej-th number is Aij, meaning that thej-th classmate has to work on thei-th job for Aijminutes as described above.OutputFirst line contains single integer T, minimum time needed.  Next line containsnnon-negative integers (≤m), giving one possible schedule for thefirstminute, where thei-th number specifying the job for thei-th classmate to do, and 0 denotes that the corresponding classmate is free.If there are multiple solutions, any one is accepted.ExampleInput:2 22 55 1Output:71 0Explanation:Two jobs are assigned to two classmates, say Lambda and Mu.  To clean up the classroom Lambda needs to work for 2 minutes and Mu 5 minutes; and to move desks for new comers Lambda 5 minutes and Mu 1 minute.One optimal schedule is:TLambdaMu0TidyFree1MoveTidy2TM3MT4MT5MT6MT7 minutes in total.  It is obvious that it is impossible to finish it in less than 7 minutes.",
  "sample_input": "Input:2 22 55 1Output:71 0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ASSIGN5",
  "scraped_at": "2025-08-17 00:33:29"
}