{
  "problem_code": "problems",
  "title": "A HUGE TOWER",
  "tags": [],
  "text": "The ancient Babylonians decided to build a huge tower. The tower consists ofNcubic building blocks that are stacked one onto another. The Babylonians gathered many building blocks of various sizes from all over the country. From their last unsuccessful attempt they have learned that if they put a large block directly onto a much smaller block, the tower will fall.Task specificationEach two building blocks are different, even if they have the same size. For each building block you are given its side length. You are also given an integerDwith the following meaning: you are not allowed to put block A directly onto block B if the side length of A is strictly larger thanDplus the side length of B.Compute the number of different ways in which it is possible to build the tower usingallthe building blocks. Since this number can be very large, output the result modulo 109+ 9.Input specificationThe first line of the input contains two positive integersNandD: the number of building blocks and the tolerance respectively.The second line containsNspace-separated integers; each represents the size of one building block.ConstraintsAll numbers in the input files are positive integers not exceeding 109.Nis always at least 2.In test cases worth 70 pointsNwill be at most 70.Out of those, in test cases worth 45 points,Nwill be at most 20.Out of those, in test cases worth 10 points,Nwill be at most 10.For some of the test cases the total number of valid towers will not exceed 1,000,000. These test cases are worth 30 points in total.For the last six test cases (worth 30 points) the value ofNis larger than 70. No upper bound onNis given for these test cases.Output specificationOutput a single line containing a single integer: the number of towers that can be built, modulo 1,000,000,009.Examplesinput:4 1\r\n1 2 3 100output:4We can arrange the first three blocks in any order, except for 2, 1, 3 or 1, 3, 2. The last block has to be at the bottom.input:6 9\r\n10 20 20 10 10 20output:36We are not allowed to put a cube of size 20 onto a cube of size 10. There are six ways to order the cubes of size 10, and six ways to order the cubes of size 20.",
  "sample_input": "input:4 1\r\n1 2 3 100output:4",
  "sample_output": "input:6 9\r\n10 20 20 10 10 20output:36",
  "link": "https://www.spoj.com/problems/CTOI10D3",
  "scraped_at": "2025-08-17 00:33:05"
}