{
  "problem_code": "problems",
  "title": "MP3 Player",
  "tags": [],
  "text": "Georg's new MP3 player has many interesting features, one of them being the key lock. All the keys are locked after more thanTseconds of inactivity. After the key lock is engaged, no key performs its original function, but if any key is pressed, the key lock is disengaged.For example, assume thatT= 5 and the player is currently locked. Georg presses the keyA, waits for 3 seconds, presses the keyB, waits for 5 seconds, pressesC, waits for 6 seconds, and pressesD. In this case only the keysBandCperform their regular functions. Note that the keys became locked betweenCandDwas pressed.Sound level of the MP3 player is controlled by the+and-keys, increasing and decreasing volume by 1 unit respectively. The sound level is an integer between 0 andVmax. Pressing the+key at volumeVmaxor pressing the-key at volume 0 leaves the volume unchanged.Task specificationGeorg does not know the value ofT. He wanted to find it by an experiment. Starting with a locked keyboard, he pressed a sequence ofN+and-keys. At the end of the experiment Georg read the final volume from the player's display. Unfortunately, he forgot to note the volume before his first keypress. For the purpose of this task, the unknown initial volume will be denotedV1and the known final volume will be denotedV2.You are given the valueV2and a list of keystrokes in the order in which Georg made them. For each key, you are given the type of the key (+or-) and the number of seconds from the beginning of the experiment to the moment when the key was pressed. The task is to find the largest possibleintegervalue ofTwhich is consistent with the outcome of the experiment.InputThe first line of the input contains three space-separated integersN,VmaxandV2(0 ≤ V2≤ Vmax). Each of the nextNlines contains a description of one key in the sequence: a character+or-, a space and an integerCi(0 ≤ Ci≤ 2 x 109), the number of seconds from the beginning of the experiment. You may assume that the keypresses are in sorted order and that all times are distinct (i.e.,Ci<Ci+ 1for all 1 ≤ i < N).OutputIfTcan be arbitrarily large, output a single line containing the word \"infinity\" (quotes for clarity).Otherwise, output a single line containing two integersTandV1separated by a single space.The values must be such that carrying out the experiment with locking timeTstarting at volumeV1gives the final volumeV2. If there are multiple possible answers, output the one with the largestT; if there are still multiple possible answers, output the one with the largestV1.(Note that at least one solution always exists: forT= 0 none of the keys performs its action, so it suffices to takeV1=V2.)ConstraintsYou may assume that 2 ≤ N ≤ 100000 and 2 ≤ Vmax≤ 5000.In test cases worth 40 points N ≤ 4000.In test cases worth 70 points N x Vmax≤ 400000.ExamplesInput:6 4 3- 0+ 8+ 9+ 13- 19- 24Output:5 4ForT= 5 the keys perform the following actions: unlock, unlock,+,+, unlock,-.For anyV1∈; {2, 3, 4} we would getV2= 3. Note that the output contains the largest possibleV1.ForT≥ 6 the last two keystrokes will both be active, hence it will be impossible to haveV2= 3.Input:3 10 10+ 1+ 2+ 47Output:infinityIfV1= 10 then for anyTwe'll haveV2= 10.",
  "sample_input": "6 4 3- 0+ 8+ 9+ 13- 19- 24",
  "sample_output": "5 4",
  "link": "https://www.spoj.com/problems/CTOI10D1",
  "scraped_at": "2025-08-17 00:33:08"
}