{
  "problem_code": "problems",
  "title": "Partial Palindrome",
  "tags": [],
  "text": "Fernando is president of country named Palindromia. Every two years there are elections in Palindromia, but not normal elections. Elections in Palindromia are preformed in next steps:Candidate which at the moment isn't president gives to the current president one stringO, which consist only of upper-case letters of English alphabet and character '?', stringU, which consist only of upper-case letters of English alphabet, and integerK.Current president has one day to compute all longest palindromes in the first string by the following rules:Every '?' inOis substituted with one letter fromU,i-th '?' inOwithi-th letter inU.Every time he search for palindromes, he may substitute some '?' with any letter, at mostK-times.If he finds palindrome, he goes to step 1.If he doesn't succeed, the candidate becomes the new president.If there are more candidates, go to step one.Fernando wants to stay president for at least two more years, so he asks you to write program which solves his problem.InputFirst line of input will contain stringO(1 ≤ length ofO≤ 5 × 105), string which Fernando must compute to stay president.Owill consist only of upper-case letters of English alphabet and character '?'. You may assume there is at least one '?' inO.Second line will contain stringU, string with leads for '?'s.i-th letter inUcorrespond toi-th '?' inO.Uwill consist only of upper-case letters of English alphabet.Third line will contain integerK(0 ≤ K ≤ 300), number of replacements.It is guaranteed that there will be not more than 300 '?'s.OutputIn first line of output print integerS, length of the longest palindrome that Fernando could find.In Second and next lines print stringPiand integerLi,longest palindrome and position where it starts. EachPimust contain only upper-case letters of English alphabet.Notes:you must print all longest palindromes, in alphabetically increasing orderif two or more palindromes starts at the same position, print only one of themExampleInput:UDOVICAB??IVODUANAVOL?MILOVANA\r\nCCA\r\n1Output:15\r\nANAVOLIMILOVANA 16\r\nUDOVICABACIVODU 1Note that both palindromes have 1 letter which Fernando has changed.Input:ABCDE??ABCDE??\r\nABCD\r\n1Output:5\r\nCBABC 6Input:ABCDE??ABCDEFG\r\nFG\r\n0Output:1\r\nA 1\r\nA 8\r\nB 2\r\nB 9\r\nC 10\r\nC 3\r\nD 4\r\nD 11\r\nE 5\r\nE 12\r\nF 13\r\nF 6\r\nG 7\r\nG 14",
  "sample_input": "Input:UDOVICAB??IVODUANAVOL?MILOVANA\r\nCCA\r\n1Output:15\r\nANAVOLIMILOVANA 16\r\nUDOVICABACIVODU 1",
  "sample_output": "Input:ABCDE??ABCDE??\r\nABCD\r\n1Output:5\r\nCBABC 6",
  "link": "https://www.spoj.com/problems/PARTPAL",
  "scraped_at": "2025-08-17 00:33:12"
}