{
  "problem_code": "problems",
  "title": "PIN",
  "tags": [],
  "text": "Martin has just been hired as a computer administrator in a big company. The company did not change its authorization system since 1980s. Every person has a four-digit personal identification number (PIN). Nobody uses usernames or passwords, you can login just by typing your PIN. As the company grew, they added the possibility to use letters as well, but the length of the PIN remained the same.Martin is not happy with the situation. Suppose there are people whose PINs differ only at a single place, for example61aband62ab. If the first person accidentally presses 2 instead of 1, the system would still let him in. Martin would like to make the statistics about the PINs currently in use, in particular, compute the number of pairs of PINs that differ at 1, 2, 3 or 4 positions. He hopes that these numbers will be alarming enough to convince his boss to invest in a better system.Task specificationGiven the list of PINs and an integerD, find the number of pairs of PINs that differ at exactlyDpositions.InputThe first line of the input contains two space-separated positive integersNandD, whereNis the number of PINs andDis the chosen number of differences. Each of the followingNlines contains a single PIN.ConstraintsYou may assume that in all test cases 2 ≤N≤ 50000 and 1 ≤D≤ 4.Each PIN is of length 4 and each character is either a digit or a lowercase letter between 'a' and 'z', inclusive. You may assume that all PINs in the input are different.In test cases worth 15 points,N≤ 2000.In test cases worth 60 points,D≤ 2. Out of those, in test cases worth 30 points,D= 1.In test cases worth 75 points, every PIN will only consist of digits or lowercase letters between 'a' and 'f', inclusive. Thus it can be viewed as a hexadecimal number.OutputOutput a single line with a single number: the number of pairs of PINs that differ atexactlyDpositions.ExamplesInput:4 10000a0100202a0e2Output:0For these PINs each pair of PINs differs at more than one position.Input:4 20000a0100202a0e2Output:3There are three pairs that differ at exactly 2 positions: (0000, a010), (0000, 0202), and (a010, a0e2).",
  "sample_input": "Input:4 10000a0100202a0e2Output:0",
  "sample_output": "Input:4 20000a0100202a0e2Output:3",
  "link": "https://www.spoj.com/problems/CTOI10D2",
  "scraped_at": "2025-08-17 00:33:04"
}