{
  "problem_code": "problems",
  "title": "Crashing Robots",
  "tags": [],
  "text": "In a modernized warehouse, robots are used to fetch the goods. Careful planning is needed to ensure that the robots reach their destinations without crashing into each other. Of course, all warehouses are rectangular, and all robots occupy a circular floor space with a diameter of 1 meter. Assume there are N robots, numbered from 1 through N. You will get to know the position and orientation of each robot, and all the instructions, which are carefully (and mindlessly) followed by the robots. Instructions are processed in the order they come. No two robots move simultaneously; a robot always completes its move before the next one starts moving.A robot crashes with a wall if it attempts to move outside the area of the warehouse, and two robots crash with each other if they ever try to occupy the same spot.InputThe first line of input is K, the number of test cases. Each test case starts with one line consisting of two integers, 1 ≤ A, B ≤ 100, giving the size of the warehouse in meters. A is the length in the EW-direction, and B in the NS-direction.The second line contains two integers, 1 ≤ N, M ≤ 100, denoting the numbers of robots and instructions respectively.Then follow N lines with two integers, 1 ≤ Xi ≤ A, 1 ≤ Yi ≤ B and one letter (N, S, E or W), giving the starting position and direction of each robot, in order from 1 through N. No two robots start at the same position.Finally there are M lines, giving the instructions in sequential order. An instruction has the following format:<robot #> <action> <repeat>Where <action> is one of:L: turn left 90 degrees,R: turn right 90 degrees, orF: move forward one meter,and 1 ≤ <repeat> ≤ 100 is the number of times the robot should perform this single move.OutputOutput one line for each test case:Robot i crashes into the wall, if robot i crashes into a wall. (A robot crashes into a wall if Xi = 0, Xi = A + 1, Yi = 0 or Yi = B + 1.)Robot i crashes into robot j, if robots i and j crash, and i is the moving robot.OK, if no crashing occurs.Only the first crash is to be reported.ExampleInput:4\r\n5 4\r\n2 2\r\n1 1 E\r\n5 4 W\r\n1 F 7\r\n2 F 7\r\n5 4\r\n2 4\r\n1 1 E\r\n5 4 W\r\n1 F 3\r\n2 F 1\r\n1 L 1\r\n1 F 3\r\n5 4\r\n2 2\r\n1 1 E\r\n5 4 W\r\n1 L 96\r\n1 F 2\r\n5 4\r\n2 3\r\n1 1 E\r\n5 4 W\r\n1 F 4\r\n1 L 1\r\n1 F 20Output:Robot 1 crashes into the wall\r\nRobot 1 crashes into robot 2\r\nOK\r\nRobot 1 crashes into robot 2",
  "sample_input": "Input:4\r\n5 4\r\n2 2\r\n1 1 E\r\n5 4 W\r\n1 F 7\r\n2 F 7\r\n5 4\r\n2 4\r\n1 1 E\r\n5 4 W\r\n1 F 3\r\n2 F 1\r\n1 L 1\r\n1 F 3\r\n5 4\r\n2 2\r\n1 1 E\r\n5 4 W\r\n1 L 96\r\n1 F 2\r\n5 4\r\n2 3\r\n1 1 E\r\n5 4 W\r\n1 F 4\r\n1 L 1\r\n1 F 20Output:Robot 1 crashes into the wall\r\nRobot 1 crashes into robot 2\r\nOK\r\nRobot 1 crashes into robot 2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CROBOTS",
  "scraped_at": "2025-08-17 00:33:03"
}