{
  "problem_code": "problems",
  "title": "Hexagonal Board",
  "tags": [],
  "text": "Square boards (as the chessboard) are really common among games and luckily, they are easy to draw with the help of a ruler. However, there exist other games that require hexagonal boards, that are much harder to draw by hand.The Institute for Client Permanent Comfort (ICPC) of a famous board game factory has decided to provide their customers with an automated program to build hexagonal boards for several games. The size of an hexagonal board is determined by a single integer N that indicates how many cells there are in each of the 6 sides of the board. For example, a board of size N = 2 should look as follows when drawn by the program._\r\n _/ \\_\r\n/ \\_/ \\\r\n\\_/ \\_/\r\n/ \\_/ \\\r\n\\_/ \\_/\r\n  \\_/Your task is to help ICPC in making the program.InputThe input contains several test cases. Each test case is described in a single line that contains an integer N representing the size of the board (1 ≤ N ≤ 20). The last line of the input contains a single −1 and should not be processed as a test case.OutputFor each test case output the hexagonal board of the required size, and a line with exactly three asterisks. You have to follow the sample input and output, as well as the example given above. Use only regular spaces, underscores (“_”), slashes (“/”) and backslashes (“\\”). There must be no trailing spaces at the end of printed lines, neither empty lines.ExampleInput:1\r\n3\r\n-1Output:_\r\n/ \\\r\n\\_/\r\n***\r\n     _\r\n   _/ \\_\r\n _/ \\_/ \\_\r\n/ \\_/ \\_/ \\\r\n\\_/ \\_/ \\_/\r\n/ \\_/ \\_/ \\\r\n\\_/ \\_/ \\_/\r\n/ \\_/ \\_/ \\\r\n\\_/ \\_/ \\_/\r\n  \\_/ \\_/\r\n    \\_/\r\n***",
  "sample_input": "_\r\n _/ \\_\r\n/ \\_/ \\\r\n\\_/ \\_/\r\n/ \\_/ \\\r\n\\_/ \\_/\r\n  \\_/",
  "sample_output": "Input:1\r\n3\r\n-1Output:_\r\n/ \\\r\n\\_/\r\n***\r\n     _\r\n   _/ \\_\r\n _/ \\_/ \\_\r\n/ \\_/ \\_/ \\\r\n\\_/ \\_/ \\_/\r\n/ \\_/ \\_/ \\\r\n\\_/ \\_/ \\_/\r\n/ \\_/ \\_/ \\\r\n\\_/ \\_/ \\_/\r\n  \\_/ \\_/\r\n    \\_/\r\n***",
  "link": "https://www.spoj.com/problems/HEXBOARD",
  "scraped_at": "2025-08-17 00:33:18"
}