{
  "problem_code": "problems",
  "title": "Escape from Jail",
  "tags": [],
  "text": "Harry is currently a prisoner of the International Common Prison for Criminals (ICPC), the\r\nmost secure prison in the world. It was designed by and old gamer and as such, the prison is\r\nnot necessarily closed, but only an incredibly logical and fast mind can get out.The prison is made of N chambers connected by M corridors. Each corridor connects exactly\r\ntwo chambers and can be traversed in any direction. Each chamber is either empty, contains\r\na single unbreakable door, or contains a single key. No chamber contains both a door and a\r\nkey. There are K doors and K keys in the whole prison. Each key opens a different door, and\r\neach door is opened by a different key. If a chamber contains a door, the corresponding key is\r\nneeded to enter the chamber, regardless of which corridor was used to reach it.Harry found the complete map of the prison, including the location of each door and each key,\r\nand wants to know how to get out that hell hole. According to the map, Harry is now in\r\nchamber number 1, and the exit is in chamber N . Given the information on the map, let Harry\r\nknow if it is possible to escape or if he is doomed forever.InputThe input contains several test cases, each one described in several lines. The first line of each\r\ntest case contains three integers N , K, and M separated by single spaces. The value N is the\r\nnumber of chambers in the prison (4 ≤ N ≤ 105); each chamber is identified by an integer\r\nnumber between 1 and N . The value K is the number of doors and keys (1 ≤ K ≤ N/2), while\r\nM is the number of corridors (1 ≤ M ≤ 105). Each of the next K lines describes a door and its\r\ncorresponding key using two integers A and B separated by a single space, with the following\r\nmeaning: chamber A contains the key that opens the door in chamber B (2 ≤ A, B ≤ N − 1).\r\nThe last M lines of the test case describe the corridors. Each of these lines contains two integers\r\nC and D separated by a single space, indicating that there is a corridor connecting chambers\r\nC and D (1 ≤ C < D ≤ N ).You may assume that no two corridors connect the same pair of\r\nchambers. The last line of the input contains the number −1 three times separated by single\r\nspaces and should not be processed as a test case.OutputFor each test case output a single line with an uppercase “Y” if it is possible for Harry to escape\r\nfrom the prison, or an uppercase “N” otherwise.ExampleInput:4 1 4\r\n2 3\r\n3 4\r\n2 3\r\n1 3\r\n2 4\r\n6 2 5\r\n5 4\r\n3 2\r\n2 6\r\n2 5\r\n1 4\r\n1 5\r\n3 4\r\n4 1 1\r\n3 2\r\n2 3\r\n-1 -1 -1Output:N\r\nY\r\nN",
  "sample_input": "Input:4 1 4\r\n2 3\r\n3 4\r\n2 3\r\n1 3\r\n2 4\r\n6 2 5\r\n5 4\r\n3 2\r\n2 6\r\n2 5\r\n1 4\r\n1 5\r\n3 4\r\n4 1 1\r\n3 2\r\n2 3\r\n-1 -1 -1Output:N\r\nY\r\nN",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ESJAIL",
  "scraped_at": "2025-08-17 00:33:10"
}