{
  "problem_code": "problems",
  "title": "Split",
  "tags": [],
  "text": "Little Petar has been put in charge of maintaining an unpredictable array of strings. Initially, all of the array elements were the same string S, but the array is prone to change; and there is exactly one kind of change that may happen. This is asplitoperation at a given location, X; after it is performed, the location X maintains the string it had before, however all fields to the left and all fields to the right of X containing the same string as X will be given new strings, S1and S2.At certain points in time, Petar will be asked to give the string at a given location. He asked you for help.InputThe first line of the standard input contains two numbers, N and Q, the size of the array and the total number of operations and queries, respectively.The second line contains the string S, the string initially contained within each location of the array.The following Q lines contain the description of either an operation or a query:A split operation is represented as \"SPLIT X S1S2\", implying that the fields to the left of X, containing the same string as at X, will from now on have the string S1, and fields to the right will have the string S2.A query is represented as \"QUERY X\", implying that Petar is asked to give the string at location X.OutputFor each QUERY command given, output a new line containing the string currently located on the given position.ExampleInput:6 6picselSPLIT 3 petarv duxserbiaSPLIT 5 sasav nikolajQUERY 1QUERY 3QUERY 5QUERY 6Output:petarvpicselduxserbianikolajExplanationInitially, the string picsel is located throughout the array. After the first and second split operation, respectively, the array looks as follows:[petarv, petarv, picsel, duxserbia, duxserbia, duxserbia][petarv, petarv, picsel, sasav, duxserbia, nikolaj]The answers to the queries then clearly follow from the final state of the array.Constraints1 ≤ N, Q ≤ 1051 ≤ X ≤ N1 ≤ |S|, |S1|, |S2| ≤ 50The strings will consist solely of lowercase letters of the English alphabet.All strings appearing in the operations will be unique.",
  "sample_input": "Input:6 6picselSPLIT 3 petarv duxserbiaSPLIT 5 sasav nikolajQUERY 1QUERY 3QUERY 5QUERY 6Output:petarvpicselduxserbianikolaj",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SPLITS",
  "scraped_at": "2025-08-17 00:33:38"
}