{
  "problem_code": "problems",
  "title": "Fingerprints",
  "tags": [],
  "text": "Professor Emad Eldin one of the best people in pattern recognition, he asked his students to create a program to check if a special pattern belongs to fingerprints of someone or not.He said that we can consider that a computer reads the special pattern and the fingerprints as strings, and we can say that the special pattern belongs to the fingerprint if the last substring of the fingerprint string is the same as the special pattern string.Your task is to help professor Emad students.InputThe first line of the input contains special pattern string S (1 ≤ |S| ≤ 50). Second line will be a single integer N, the number of fingerprints (1 ≤ N ≤ 10). N lines follow, each line contains fingerprint string F (1 ≤ |F| ≤ 50).OutputFor each test case, print an integer K, the number of fingerprints strings that special pattern string belongs to it. Followed by K lines, each contains the fingerprint string that the special pattern string belongs to it. You should print the fingerprint strings in a lexicographical order. If there is no fingerprint belongs to the special pattern, print \"Wrong fingerprints!\" instead.ExamplesInput:On\r\n5\r\nPattern recognatiOn\r\nCommOn patterN\r\ngame\r\norganizatiOn\r\nlionOutput:2\r\nPattern recognatiOn\r\norganizatiOnInput:Ze\r\n2\r\nFingerprint\r\npattern designOutput:Wrong fingerprints!NotesStringScontains uppercase English letters ('A' - 'Z') and lowercase English letters ('a' - 'z') only.All other strings in the input contains uppercase English letters ('A' - 'Z'), lowercase English letters ('a' - 'z') and spaces (' ') only.All strings are case sensitive ('A' is not equal to 'a').Lexicographical order is defined in following way. When we compare s and t, first we find the leftmost position with differing characters: si ≠ ti. If there is no such position (i.e. s is a prefix of t or vice versa) the shortest string is less. Otherwise, we compare characters si and ti according to their order in alphabet.",
  "sample_input": "Input:On\r\n5\r\nPattern recognatiOn\r\nCommOn patterN\r\ngame\r\norganizatiOn\r\nlionOutput:2\r\nPattern recognatiOn\r\norganizatiOn",
  "sample_output": "Input:Ze\r\n2\r\nFingerprint\r\npattern designOutput:Wrong fingerprints!",
  "link": "https://www.spoj.com/problems/FINGP",
  "scraped_at": "2025-08-17 00:33:52"
}