{
  "problem_code": "problems",
  "title": "The Toy Store",
  "tags": [],
  "text": "One day Amit had an idea to open up a toy store. Though he realised that he must do something to attract customers to his store otherwise his store would not be successful. So he comes up with a plan to give each customer a free Lego (blocks) set. Hearing about this, you go to the store to get your free sample.You are provided with a set of Legos. The set given to you consists of N different kinds of Lego. The set has an infinite number of pieces of each kind of Lego. Each kind of Lego has some fixed height. Note that 2 different kinds of Lego may have the same height.Now you want to check the actual price of your Lego set. The price of the set is equal to the number of distinct Beautiful Buildings that can be built using the set.A Beautiful Building is a stack of Lego pieces such that it is made of exactly K Lego pieces (not necessarily of different kind) and its height is equal to X modulo M for given values of X, M and K (these values are printed on the box).2 Buildings are distinct if there exists a height H at which the block used in both buildings is not the same.You want to find out the price of the free sample provided to you.InputThe input starts with an integer T, indicating the number of test cases. Then T test cases follow. Each test cases consists of 3 lines. The first line contains an integer N, indicating the number of different kinds of Lego in the set. The second line contains N space separated integers, the ith of which represents the height of pieces of ith kind. The third line contains 3 space separated integers representing the values of M, K and X respectively.OutputFor each test case print a line containing the price of the set modulo 1000000007.CONSTRAINTST ≤ 1001 ≤ N ≤ 1000001 ≤ M ≤ 1001 ≤ K ≤ 10000000000 ≤ X1 ≤ Height of Each Lego ≤ 1000000000ExampleInput:231 2 33 1 031 2 33 2 0Output:13",
  "sample_input": "Input:231 2 33 1 031 2 33 2 0Output:13",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DCEPC14F",
  "scraped_at": "2025-08-17 00:33:24"
}