{
  "problem_code": "problems",
  "title": "Eefun the Accountant",
  "tags": [],
  "text": "Eefun is an accountant. As an accountant, he loves to work with spreadsheet. In spreadsheet, a data must be saved into a single cell which has row and column. Spreadsheet has an interesting feature. It can move the cursor from a cell to another cell by clicking a button based on this rules :If current cell has data and its right neighbour also contain data, then clicking the right button will make the cursor move to the first cell to the right of the current cell whose right neighbour doesn't contain data. If there is no such cell, then the cursor will move to the rightmost cell in the current row.Else,then clicking the right button will make the cursor to move to the first cell in the right of current cell which has data. If there is no such cell, then the cursor will move to the rightmost cell in the current row.Same rules apply when clicking the left, up, and down button.Eefun realizes this feature which makes him curious. He currently has a lot of data in his spreadsheet. He wants to edit a data on cell (R, C), but first he must move his cursor to the desired cell. Currently his cursor is at cell (1,1), the top-leftmost cell in the spreadsheet. Eefun wants to know the minimal number of button clicked to reach the cell.InputFirst line of input consists of 2 integers, N and M, the number of rows and number of columnsSecond line consists of a number X, the number of data that Eefun currently has.Next X lines each consists of 2 integers, A and B which denotes the position of the dataLine (X+3) contains a number Q, the number of query.Next Q lines each consists of 2 integers, R and C, the position of cells that Eefun wants to editOutputFor each query, output a single integer, the minimum number of buttons that Eefun should click to reach cell (R,C). If the cell cannot be reached, then output a string \"Eefun gagal mengedit data\"\"Eefun gagal mengedit data\" means \"Eefun fails to edit his data\"Note that each query is independent, so Eefun's initial cursor will be at (1,1) for each queryExampleInput:3 3\r\n8\r\n1 1\r\n1 2\r\n1 3\r\n2 1\r\n2 3\r\n3 1\r\n3 2\r\n3 3\r\n2\r\n3 2\r\n1 3Output:Eefun gagal mengedit data1Note : You can try this in Microsoft Excel using ctrl + arrow buttonConstraints1 ≤ X ≤ min(100.000 , N×M)1 ≤ N, M ≤ 10.0001 ≤ Q ≤ 100.000",
  "sample_input": "Input:3 3\r\n8\r\n1 1\r\n1 2\r\n1 3\r\n2 1\r\n2 3\r\n3 1\r\n3 2\r\n3 3\r\n2\r\n3 2\r\n1 3Output:Eefun gagal mengedit data1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NPC2015B",
  "scraped_at": "2025-08-17 00:33:26"
}