{
  "problem_code": "problems",
  "title": "Save Area 11",
  "tags": [],
  "text": "In the year 2010 of the Imperial Calendar, the Holy Britannian Empire invaded Japan and overpowered the defending forces. Japan became a dominion of the Empire. The country was stripped off her freedom, her rights and her name. The defeated and once proud nation was given a mere number as a name - Area 11.After many years, Lelouch vi Britannia, the leader of the Black Knights, is making plans for some important battles against the Holy Britannian Empire army in his quest to free Area 11. He is assigning soldiers of the Black Knights to various strategically advantageous positions on the battlefields.Lelouch assigns a soldier to a position from T1second to T2second. The soldier leaves to fight at the beginning of T1second and returns at the end of T2second. During this time, this soldier is unavailable for any other assignments. After returning, he is available for future assignments. A complete plan includes several of these assignments.The Black Knights does not have unlimited number of soldiers. Lelouch has made plans for several battles and now he is trying to distribute his soldiers to carry out these plans. He takes a plan and allocatesNsoldiers for it. Then he asks you to check if the plan can be carried out successfully with N soldiers.Help Lelouch make the plans. The fate of Area 11 depends on you!InputInput begins with an integerP (1 ≤ P ≤ 105), indicating the number of plans. Then follows the P plans. Each plan begins with two integersN (0 ≤ N ≤ 109)andA (0 ≤ A≤104),indicating the number of soldiers allocated for that plan and the number of assignments that plan has respectively. The next A lines each contains two integersSandE (1 ≤ S ≤ E ≤ 104), indicating the starting and the ending time of an assignment.OutputFor each plan, print a single line in the formatPlan X: Y, where X is the plan number and Y is eitherYesorNo, indicating whether the plan can be completed successfully or not.ExampleInput:2\r\n3 3\r\n1 3\r\n1 4\r\n1 2\r\n2 3\r\n1 3\r\n1 4\r\n1 2Output:Plan 1: Yes\r\nPlan 2: NoNote:Dataset is huge. Use faster I/O method.",
  "sample_input": "Input:2\r\n3 3\r\n1 3\r\n1 4\r\n1 2\r\n2 3\r\n1 3\r\n1 4\r\n1 2Output:Plan 1: Yes\r\nPlan 2: No",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SVAREA11",
  "scraped_at": "2025-08-17 00:33:22"
}