{
  "problem_code": "problems",
  "title": "CompuTenis reloaded",
  "tags": [],
  "text": "You may remember from a previous edition of TAP about CompuTenis, that sport specially adapted to a public without any mensurable physical qualities and whose rules involve coding with your elbow glued to your ear. This time we will have another problem concerning this exciting subject, in case you found the solution to that one too easy.Once more, for the purposes of this problem the only thing you have to know about CompuTenis is that two players, which we will call A and B, compete in a match. The match is won by the player who first winsSsets, each set being composed of one or more games. In each set the two players play as many games as is required for one of them to win in at leastJgames, with a difference of at leastDgames won in excess of his opponent. The player satisfying both of these conditions is then the winner of the corresponding set.The Modern Club Association (MCA) has recently found a trove of records of pre-historic CompuTenis matches. Each record consists of a string composed ofNcharacters'A'or'B', indicating which player won each of theNgames the match had, in the order in which they occurred. Now the MCA wants to know, for each record, what the result of the match was.InputThere are multiple test cases in the input file. For each test case, the first line contains four integersN, S, JandD. The valueNrepresents the number of games in the record to be analyzed (1 ≤ N ≤ 105). The valueSindicates the number of sets a player is required to win in order to win the match (1 ≤ S ≤ 10). The valueJis the minimum number of games it is necessary to win in order to win a set, whereas the valueDindicates that a player should win at least that number of games more than his opponent in order to win the set (1 ≤ D ≤ J ≤ 100). The second line contains a string composed ofNcharacters'A'or'B'. Thei-th character of the string indicates which player won thei-th game played in the match. The input string will represent a valid record of a complete match.OutputFor each test case, print a single line containing two integers representing the number of sets won by player A and player B, respectively.ExampleInput:10 5 2 1\r\nAAAAAAAAAA\r\n21 3 3 2\r\nAABABBBABBBABABABBABBOutput:5 0\r\n1 3",
  "sample_input": "Input:10 5 2 1\r\nAAAAAAAAAA\r\n21 3 3 2\r\nAABABBBABBBABABABBABBOutput:5 0\r\n1 3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2015C",
  "scraped_at": "2025-08-17 00:33:22"
}