{
  "problem_code": "problems",
  "title": "Hugo s homework",
  "tags": [],
  "text": "Hugo goes to primary school, but he is convinced that not enough homework is being given to him. Specifically, he was recently taught how to subtract two numbers, but each day he is given a single subtraction to perform at home. Hugo knows that in order to master such a complex technique he should practice much more, so he has decided to take matters into his own hands and create his own homework.It's not easy for Hugo to invent exercises about a subject he does not fully comprehend, so he has devised the following method to perform multiple subtractions. He starts by asking his mother for a numberN, and then forms the numberMcontaining the same digits asNin increasing order from left to right, after which he finally performs the subtractionN-M. For example, if his mother chooses the numberN = 321thenM = 123and the subtraction Hugo must perform isN - M = 321-123 = 198.Hugo wouldn't want to bother his mother too often, so he will repeat this procedure using the result of the subtractionN-Min one step as the numberNhe starts with in the next step. This will end only when at some point he reaches the valueN = 0, as this case is useless to practice subtractions because he would haveM = 0: Hugo already knows perfectly well that if he has no candies he cannot eat any candies, and will therefore continue to not have or eat candies forever.Now Hugo's mother would like to know, given a numberN, how many subtractions Hugo can perform if she gives him that number to start his homework. In the previous example, in the second step Hugo would haveN = 198so thatM = 189andN - M = 198 - 189 = 9. Then in the third stepN = 9,M = 9andN - M = 0, so here the fun ends because in the fourth step he would haveN = 0. Thus, starting with the numberN = 321Hugo will perform3subtractions.InputThere are multiple test cases in the input file. Each test case consists of one line containing an integerN, representing the number Hugo's mother will give him to start his homework (1 ≤ N ≤ 109).OutputFor each test case, print one line containing one integer representing the number of subtractions Hugo will perform if he starts his homework with numberN.ExampleInput:321\r\n20\r\n960687301Output:3\r\n2\r\n91",
  "sample_input": "Input:321\r\n20\r\n960687301Output:3\r\n2\r\n91",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2015H",
  "scraped_at": "2025-08-17 00:33:31"
}