{
  "problem_code": "problems",
  "title": "Jolly Kingdom",
  "tags": [],
  "text": "Jolly Kingdom is a kingdom which is famous for its troops' power. Jolly Kingdom has N swordsman troops and M archer troops where each troop has his/her own unique fighting style, different with others.For the 10thtimes, an evil witch with her monster troops tries to seize the throne of Jolly Kingdom. According to the information gathered from Jolly Kingdom's spies, the witch will attack everyday for H days. Each day, the witch will add 1 new monster into her monster troops. This makes enemy's troops become stronger every day.Each monster owned by the witch is strong and almost unbeatable, only the Xithswordsman troop or the Yitharcher troop can beat the monster. After the monster has been defeated by Jolly Kingdom's troop, that monster will take a reset and attack again in the next day.To protect Jolly Kingdom, every dayall monstershave to be defeated, but the cost to send 1 troop is expensive, so the king wants to send minimum number of troops every day such that the sent troops will be able to defeatall monstersexist on that corresponding day.The king asks you for your help, as a royal advisor, the number of troops the king has to send every day.InputFirst line consists of 3 integers: N, M, and H (1 ≤ N, M ≤ 1000; 1 ≤ H ≤ N*M) – the number of swordsman troops, archer troops, and days. Each of next H lines contains 2 integers: Xiand Yi(1 ≤ Xi≤ N; 1 ≤ Yi≤ M) – the weakness of ithmonster, ithcan be defeated by the Xithswordsman or Yitharcher.There can't be 2 monsters with the exact same weakness (there won't be any monster i and j where Xi= Xjand Yi= Yjfor all 1 ≤ i, j ≤ H and i ≠ j).OutputPrint H lines. Each line contains 1 number represents the answer to the king's question.Sample TestsInput4 4 9\r\n1 1\r\n1 2\r\n1 3\r\n2 1\r\n4 1\r\n3 4\r\n3 3\r\n4 3\r\n4 4Output1\r\n1\r\n1\r\n2\r\n2\r\n3\r\n3\r\n4\r\n4Explanation for sample caseNotation: { swordsman troop number: monster number(s) defeated } { archer troop number: monster number(s) defeated }1stday: {1: 1} {}2ndday: {1: 1 2} {}3rdday: {1: 1 2 3} {}4thday: {1: 1 2 3} {1: 4}5thday: {1: 1 2 3} {1: 4 5}6thday: {1: 1 2 3;3: 6} {1: 4 5}7thday: {1: 1 2 3;3: 6 7} {1: 4 5}8thday: {1: 1 2 3;3: 6 7;4: 8} {1: 4 5}9thday: {1: 1 2 3;3: 6 7;4: 8 9} {1: 4 5}InformationThe constraints above is not typo, N and M can be as large as 1000 (1 Thousand), so H can be as large as 106(1 Million). So this problem has 10× larger constraints than the original one.Warning: Large Input/Output files, each file I/O can be as large as 7.5 Megabytes (7.5 MB), cin or cout probably too slow for I/O, it's recommended to use scanf/printf (I've tested it).If you find this problem too hard, you can try this first:https://jollybeeoj.com/problem/view/199original problem with smaller constraints.TriviaThe total size of file I/O in this problem is slightly more than 100 MB, took a while to generate, modify, and upload it. :)If the witch attack Jolly Kingdom everyday for 1 Million days that means the attack took more than 2500 years. :oIf I count number of operation in the deepest loop of my algo on worst case input, it will be 671,163,499 operations.Credit & Special thanksSandy Karunia- Developer ofJollybee Online JudgeAlvin Setiadi- Original problem author",
  "sample_input": "4 4 9\r\n1 1\r\n1 2\r\n1 3\r\n2 1\r\n4 1\r\n3 4\r\n3 3\r\n4 3\r\n4 4",
  "sample_output": "1\r\n1\r\n1\r\n2\r\n2\r\n3\r\n3\r\n4\r\n4",
  "link": "https://www.spoj.com/problems/JOLLYKINGDOM",
  "scraped_at": "2025-08-17 00:33:35"
}