{
  "problem_code": "problems",
  "title": "Optimal Connected Subset",
  "tags": [],
  "text": "It is well-known that we can uniquely represent any pointPon the Cartesian coordinate system using an ordered pair (x,y). If bothxandyare integers, then we shall callPan integer point, otherwise we shall callPa non-integer point. We shall denote all integer points on the plane using the setW.Definition 1: For two pointsP1(x1,y1),P2(x2,y2), if |x1−x2| + |y1−y2| = 1, thenP1andP2shall be consideredneighbors, which is denoted asP1~P2. Otherwise,P1andP2are considered non-neighboring.Definition 2: The setSis a finite subset ofWsuch thatS= {P1,P2, …,Pn} (n≥ 1), wherePi(1 ≤i≤n) belongs inW. We shall callSaset of integer points.Definition 3: WhereSis a set of integer points, if the pointsRandTbelong toS, and there exists a finite sequenceQ1,Q2, …,Qksatisfying the following:Qibelongs toS(1 ≤i≤k);Q1=R,Qk=T;Qi~Qi+1(1 ≤i≤k−1) — i.e.QiandQi+1are neighbours; andQi≠Qjfor any 1 ≤i<j≤kthen we shall say thatRandTareconnectedwithin setS, where the sequenceQ1,Q2, …,Qkshall be called apathwayconnecting pointsRandT.Definition 4: For a set of integer pointsV, if for any two ofV's integer points there exists exactly one pathway connecting them, thenVshall be known as asingular set of integer points.Definition 5: For any integer point on the plane, we can assign it an integer score. Thus, we shall call the sum of the scores of all the points in a set of integer points itstotal score.Given a singular set of integer pointsV, we would like to find the optimally connected subsetB, where:Bis a subset ofV;any two integer points inBis connected withinB; andout of the set of integer points satisfying 1 and 2,Bis the set where the total score is highest.InputThe very first line of the input contains a single integerT, the number of test cases.Tblocks follow.For each test case, the first line contains a single integerN= |V| (N<= 1000). Within the followingNlines, thei-th line (1 ≤i≤N) contains three space-separated integersXi,Yi, andCi(−106≤Xi,Yi≤ 106; −100 ≤Ci≤ 100), representing the coordinates of thei-th point along with its score.OutputTlines, each line should consist of one integer, the total score of the optimally connected subset.ExampleInput:1\r\n5\r\n0 0 -2\r\n0 1 1\r\n1 0 1\r\n0 -1 1\r\n-1 0 1Output:2",
  "sample_input": "Input:1\r\n5\r\n0 0 -2\r\n0 1 1\r\n1 0 1\r\n0 -1 1\r\n-1 0 1Output:2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/OPTSUB",
  "scraped_at": "2025-08-17 00:33:39"
}