{
  "problem_code": "problems",
  "title": "Memory Distribution",
  "tags": [],
  "text": "EMS memory (calledmemoryfor short) is some important resource of a computer. When a program is running, the computer must distribute the memory for it.The classical memory distribution process is like the following:The basic unit of the memory is called acell, each cell is assigned to a fixed integer number called itsaddress. The address starts from number 0. If two cells' address numbers are two consecutive integer numbers, the two cells are called (logically) consecutive. We name thesconsecutive cells starting from addressia piece whose length issand first address isi.Many programs need memory during their running. For each program, we need an application timeX, a number of cells neededMand a running timePto describe it. While the program is running (during its start running timeTtoT + P, including the left end and excluding the right end), the M cells cannot be used by other programs.Suppose a program applyMcells at timeXand its running time isP, then(A) If there is a piece in the memory at timeX, each cell of which is not being used, and whose length isM, the computer will distribute theseMcells to this program. If there are more pieces, the computer will choose the one whose first address is minimum.(B) If such piece does not exist at timeX, the program will be put into a queue. If after some time, there exist a piece whose length isMand the corresponding program is at the head of the queue, the computer will pop this program and distribute memory for it like (A) immediately. During the process of memory distribution, the programs which are not at the head of the queue cannot start to run before the one at the head of the queue.InputTen test cases (given one after another, you have to process all!) For each test case:The first line is a number N, which shows the number of memory cells. Their addresses are 0..n-1. Fewer than 10000 lines follow, each contains 3 integers X, M (M ≤ N), P describing the programs. A line containing three zeroes denotes the end of a test case. The programs have been sorted by their application time X.All numbers in the input and output file will be less than 109.OutputFor each test case output two lines. The first line contains a single integer, which shows the time when all the programs have been run and stops normally. The second line contains a single integer, which is the number of programs which have been put into the queue.ExampleInput:10\r\n1 3 10\r\n2 4 3\r\n3 4 4\r\n4 1 4\r\n5 3 4\r\n0 0 0\r\n[and 9 test cases more]Output:12\r\n2\r\n[and 9 test cases more]",
  "sample_input": "Input:10\r\n1 3 10\r\n2 4 3\r\n3 4 4\r\n4 1 4\r\n5 3 4\r\n0 0 0\r\n[and 9 test cases more]Output:12\r\n2\r\n[and 9 test cases more]",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MEMDIS",
  "scraped_at": "2025-08-17 00:33:41"
}