{
  "problem_code": "problems",
  "title": "The Secret of a Lost City",
  "tags": [],
  "text": "EnglishVietnameseBí mật về thành phố biến mấtNhà khảo cổ nổi tiếng Blue Mary vừa tìm thấy di tích một   thành phố bị biến mất. Cô tìm thấy 12 tấm bia lớn ở trung tâm   thành phố, mà cô đặt tên là thành phố Đỉnh-Băng (Ice-Peak   City). Các tấm bia có nhiều kiến trúc khác nhau. Blue Mary đặt   tên các kiến trúc này là IPA (Ice-Peak Articles). Không may là   cô không thể tìm ra thành phố Đỉnh Băng nữa sau khi quay về   phòng thí nghiệm của mình.Điều duy nhất Blue Mary biết về thành phố Đỉnh Băng là   hình dạng kiến trúc của các tấm bia. Vốn thông minh, cô nhanh   chóng tìm ra cú pháp của IPA. Cú pháp có dạng như dưới   đây.<IPA>        ::=<câu>{<câu>}\r\n<câu>        ::=<ngữ danh từ>{<ngữ động từ><ngữ danh từ>}[<ngữ động từ>]\r\n<ngữ danh từ>::=<danh từ>|[<trạng từ>]<ngữ danh từ>\r\n<ngữ động từ>::=<động từ>|[<trạng từ>]<ngữ động từ>\r\n<từ>         ::=<động từ>|<danh từ>|<trạng từ>Trong đódanh từ, động từ và trạng từ được cho trước bởi một từ   điển mà ta sẽ nêu sau.| ký hiệu \"hoặc\"Các đối tượng trong dấu [] xuất hiện 0 hoặc 1 lần.Các đối tượng trong dấu {} xuất hiện 0 hoặc nhiều   lần.Blue Mary đã soạn một từ điển các từ trong IPA. Do các   ký tự trong IPA chỉ gồm 26 dạng khác nhau, ta sẽ dùng các   chữ cái latin in thường từ 'a' đến 'z' để biểu diễn.Không có dấu câu ngăn cách giữa các từ hoặc câu, do đó   Blue Mary nhờ bạn viết chương trình phân tách chuỗi IPA cho   trước thành một số ít câu nhất, sau đó lại phân tách các câu   này ra thành ít từ nhất.Dữ liệuDòng đầu tiên chứa số từ trong từ điển, không vượt quá   1000.Các dòng tiếp theo chứa các từ có dạng \"X.Y\", mỗi từ   trên một dòng, trong đó X là một trong các ký tự 'n', 'v', 'a',   cho biết từ tương ứng là danh từ, động từ hay trạng từ, và Y là   chuỗi gồm các chữ cái in thường thể hiện một từ, có độ dài   không quá 20.Dòng tiếp theo chứa một chuỗi IPA đúng (chỉ gồm các   chữ cái latin in thường), kết thúc bởi dấu chấm (.). Độ dài của   chuỗi IPA sẽ không vượt quá 5KB.Kết quảDòng đầu tiên chứa số câu ít nhất trong chuỗi IPA. Dòng   thứ hai chứa số từ ít nhất trong chuỗi IPA, sau khi chuỗi IPA   đã được phân tách thành ít câu nhất.Ví dụDữ liệu11\r\nn.table\r\nn.baleine\r\na.silly\r\nn.snoopy\r\nn.sillysnoopy\r\nv.is\r\nv.isnot\r\nn.kick\r\nv.kick\r\na.big\r\nv.cry\r\nsillysnoopyisnotbigtablebaleinekicksnoopysillycry.Kết quả2\r\n9The famous archaeologist Blue Mary has found a site of a   lost city. She found 12 huge steles in the center of the city -   called Ice-Peak City by her, on which there were many designs.   Blue Mary named these designs Ice-Peak Articles (IPA for   short). Unfortunately, she can't find Ice-Peak city any more   after she returns to her lab.The only thing Blue Mary knows about Ice-Peak city is   pictures of the designs on the steles. With her intelligence she   soon comes up with the syntax of IPA. Its BNF form is   below.<IPA>        ::=<sentence>{<sentence>}\r\n<sentence>   ::=<noun phrase>{<verb phrase><noun phrase>}[<verb phrase>]\r\n<noun phrase>::=<noun>|[<adverb>]<noun phrase>\r\n<verb phrase>::=<verb>|[<adverb>]<verb phrase>\r\n<words>      ::=<verb>|<noun>|<adverb>Wherenouns, verbs and adverbs are given by a dictionary which we will discuss later.| denotes or.Things in [] will appear zero or one time.Things in {} will appear zero or more times.Blue Mary has compiled a dictionary of words in IPA.   Since characters appeared in IPA only contain 26 different   forms, we will use small Latin letters 'a' to 'z' to represent.There are no separators between words or sentences, so   Blue Mary asks you to write a program which will split a   correct IPA into minimum number of sentences, and split these   sentences into minimum number of words.InputThe first line contains the number of words in the   dictionary, no more than 1000.Next lines contain the words in the form \"X.Y\", one per   line, where X is one of the characters 'n', 'v', 'a', denoting that   the corresponding word is noun, verb or adverb, and  Y is a   string of lowercase Latin letters, whose length will be no more   than 20.The next line contains a correct IPA (contains only   lowercase Latin letters), ends with a dot(.). The length of the   IPA will be no more than 5KB.OutputThe first line contains the minimum number of sentences in   IPA. The second line contains the minimum number of words   in IPA, when given IPA is split into minimum number of   sentences.ExampleInput:11\r\nn.table\r\nn.baleine\r\na.silly\r\nn.snoopy\r\nn.sillysnoopy\r\nv.is\r\nv.isnot\r\nn.kick\r\nv.kick\r\na.big\r\nv.cry\r\nsillysnoopyisnotbigtablebaleinekicksnoopysillycry.Output:2\r\n9Time limit has been changed to 200 ms in total for all tests.",
  "sample_input": "<IPA>        ::=<câu>{<câu>}\r\n<câu>        ::=<ngữ danh từ>{<ngữ động từ><ngữ danh từ>}[<ngữ động từ>]\r\n<ngữ danh từ>::=<danh từ>|[<trạng từ>]<ngữ danh từ>\r\n<ngữ động từ>::=<động từ>|[<trạng từ>]<ngữ động từ>\r\n<từ>         ::=<động từ>|<danh từ>|<trạng từ>",
  "sample_output": "Dữ liệu11\r\nn.table\r\nn.baleine\r\na.silly\r\nn.snoopy\r\nn.sillysnoopy\r\nv.is\r\nv.isnot\r\nn.kick\r\nv.kick\r\na.big\r\nv.cry\r\nsillysnoopyisnotbigtablebaleinekicksnoopysillycry.Kết quả2\r\n9",
  "link": "https://www.spoj.com/problems/LOSTCT",
  "scraped_at": "2025-08-17 00:33:45"
}