{
  "problem_code": "problems",
  "title": "Whac",
  "tags": [],
  "text": "While visiting a traveling fun fair you\r\nsuddenly have an urge to break the high\r\nscore in the Whac-a-Mole game. The goal\r\nof the Whac-a-Mole game is to... well...\r\nwhack moles. With a hammer. To make\r\nthe job easier you have ﬁrst consulted\r\nthe fortune teller and now you know the\r\nexact appearance patterns of the moles.\r\n    The moles appear out of holes occupying the n2integer points (x, y)\r\nsatisfying 0 ≤ x, y < n in a\r\ntwo-dimensional coordinate system.\r\nAt each time step, some moles will\r\nappear and then disappear again before\r\nthe next time step. After the moles appear\r\nbut before they disappear, you are able\r\n to move your hammer in a straight line\r\nto any position (x2, y2) that is at distance\r\nat most d from your current position (x1, y1). For simplicity, we assume that you\r\ncan only move your hammer to a point having integer coordinates. A mole is whacked\r\nif the center of the hole it appears out of is located on the line between (x1, y1) an\r\n(x2, y2) (including the two endpoints). Every mole whacked earns you a point. When\r\nthe game starts, before the ﬁrst time step, you are able to place your hammer anywhere\r\nyou see ﬁt.InputThe input consists of several test cases. Each test case starts with a line containing three\r\nintegers n, d and m, where n and d are as described above, and m is the total number\r\nof moles that will appear\r\n(1 ≤ n ≤ 20, 1 ≤ d ≤ 5, and 1 ≤ m ≤ 1000). Then follow\r\nm lines, each containing three integers x, y and t giving the position and time of the\r\nappearance of a mole (0 ≤ x, y < n and 1 ≤ t ≤ 10). No two moles will appear at the\r\nsame place at the same time.\r\n    The input is ended with a test case where n = d = m = 0. This case should not be\r\nprocessed.OutputFor each test case output a single line containing a single integer, the maximum\r\npossible score achievable.ExampleInput:4 2 6\r\n0 0 1\r\n3 1 3\r\n0 1 2\r\n0 2 2\r\n1 0 2\r\n2 0 2\r\n5 4 3\r\n0 0 1\r\n1 2 1\r\n2 4 1\r\n0 0 0Output:4\r\n2",
  "sample_input": "Input:4 2 6\r\n0 0 1\r\n3 1 3\r\n0 1 2\r\n0 2 2\r\n1 0 2\r\n2 0 2\r\n5 4 3\r\n0 0 1\r\n1 2 1\r\n2 4 1\r\n0 0 0Output:4\r\n2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MOLE",
  "scraped_at": "2025-08-17 00:33:36"
}