{
  "problem_code": "problems",
  "title": "Colorful Lights Party",
  "tags": [],
  "text": "ACRush and his friends want to open a party to celebrate the good result of THU in ICPC 2007. They will use all halls in THU for their party. There are 2 kinds of hall: the small and the large one. In each hall, there is an electronic light system, which forms a tree topology to reduce redundant wires.In a small hall, the light system is a general tree with n lights. The lights are numbered from 1 tonIn a large hall, the light system is obtained fromkchains of lights, each chain has lengtht. The first lights of these k chains are connected with a big light at the central stage of the hall. The big light has id 1, the first light of each chain has id from 2 to k+1, then we continue with the second light of each chain, so on...Take a look at the figure below:ACRush hopes in every hall, each light has an unique color and so do the wires!For easier to remember and to hang up lights against the walls, he sets a\r\nrule:For each hall, we number the color from 0 ton-1, so each light will get a color id in set {0, 1, ...,n-1}.Color id of the wire connects i-th light and j-th light uniquely identified by the positive difference between color ids of i-th light and j-th light.At first view, the rule seems easy, so everyone agrees with him. But it's really tough if the room is quite large, too hard to set colors for lights.\r\nAfter few seconds, ACRush says\"So in this hall, the 1-st light should have color 3, the 2-nd one should have color 0,...\". Well, how can he do it very fast?How about you ? Let write a program to help ACRush's friends setting colors for lights in allThalls.InputThe first line of file isT-- number of halls in THU (0 < T <= 10).\r\nThe following line is blank. Then, there are the descriptions of T halls.For each hall, the first line contains one integerkind.kinddenotes which kind of the current hall: 1 is a small hall, 2 is a large one.\r\n\r\nOn next line, there are two cases:For Kind 1, first line is n (1 <= n <= 27) -- number of lights. Nextn - 1lines describe\r\nwires in this hall. Each line is pair (u, v) -- there is a wire between light u and v (1 <= u, v <= n).For Kind 2, only one line contains two numbers k and t (1 <= k, t <= 1000).There is a blank line after each description.OutputFor each hall, show usnnumbers on one line, i-th number is the color id of i-th light. If there are many solutions any of them will be accepted. Otherwise, if there is no solution, all color id should be-1.The color ids on one line are separated by exactly one blank, and you'd better not print any redundant blanks.\r\nThere is no blank line after each case.ExampleInput:2\r\n\r\n1\r\n3\r\n1 2\r\n2 3\r\n\r\n2\r\n2 1Output:0 2 1\r\n0 4 2 1 3",
  "sample_input": "Input:2\r\n\r\n1\r\n3\r\n1 2\r\n2 3\r\n\r\n2\r\n2 1Output:0 2 1\r\n0 4 2 1 3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PT07G",
  "scraped_at": "2025-08-17 00:33:27"
}