{
  "problem_code": "problems",
  "title": "Mobiles",
  "tags": [],
  "text": "You have been asked to buy a gift for your baby brother, Ike. However, you have noticed that \r\nIke has a very particular taste in gifts. He only likes gifts that are configured in his particular \r\nstyle.You have found a shop that sells mobiles. A mobile is a multi-layered decoration that is typically \r\nhung from the roof. Each mobile consists of a series of horizontal rods connected by vertical wires. \r\nEach rod has a wire hanging from both ends, which holds either another horizontal rod or a toy.A sample mobile is shown below:To satisfy your brother, you need to find a mobile that can be reconfigured so that:(i) any two toys are either at the same level (that is, joined to the roof by the same number of \r\nrods), or di.er by only one level;(ii) for any two toys that differ by one level, the toy to the left is further down than the toy to \r\nthe right.Mobiles can be reconfigured by performing swaps. A swap involves taking some rod, unhooking \r\nwhatever is hanging beneath the left and right ends, and reattaching them at opposite ends (that \r\nis, the right and left ends respectively). This process does not modify the ordering of any rods or \r\ntoys further down.Since you are training for the Informatics Olympiad, you decide to write a program to test \r\nwhether a given mobile can be reconfigured into a gift that Ike will like!As an example, consider the mobile illustrated earlier. Ike will not like this mobile. Although \r\nit satisfies condition (i), it breaks condition (ii) — the toy at the leftmost end is at a higher level \r\nthan the toys to its right.However, the mobile can be reconfigured into a mobile that Ike will like. The following swaps \r\nare required:1. First, the left and right ends of rod 1 are swapped. This exchanges the positions of rods 2 \r\nand 3, resulting in the following configuration:2. Second, and finally, the left and right ends of rod 2 are swapped. This moves rod 4 to the \r\nleft end of rod 2, and the toy to the right end of rod 2.It can be seen that this final mobile satisfies Ike's requirements. All toys are at most one level \r\napart, and the toys at a lower level are further to the left than the toys at a higher level.Your task is, given a description of a mobile, to determine the smallest number of swaps required \r\nto reconfigure it so that Ike will like it (if this is possible). You may assume that the toys can \r\nnever get in each other's way.InputMultiple test cases, the number of them will be given at the very first line.For each test case:The first line of input will contain the single integer n (1 <= n <= 100 000) representing the number \r\nof rods in the mobile. The rods are numbered 1, 2 , ..., n.The following n lines will describe the connections for each rod. Specifically, the ith of these \r\nlines will describe rod i. Each of these lines will contain two integerslrseparated by a single \r\nspace, indicating what is hung beneath the left and right ends of the rod respectively. If a toy is \r\nhung beneath this rod, the corresponding integerlorrwill be -1. Otherwise the integerlorrwill be the number of a rod that is hung beneath this rod.If there are any rods hanging beneath rod i, these rods will have numbers strictly greater than i. Rod 1 is the single rod at the top of the mobile.OutputOutput should consist of a single line containing a single integer, giving the smallest number of \r\nswaps required to reconfigure the mobile according to Ike's constraints. If this is not possible, you \r\nshould output the integer -1.ExampleInput:1\r\n6\r\n2 3 \r\n-1 4 \r\n5 6 \r\n-1 -1 \r\n-1 -1 \r\n-1 -1Output:2Warning: large input/output data,be careful with certain languages",
  "sample_input": "Input:1\r\n6\r\n2 3 \r\n-1 4 \r\n5 6 \r\n-1 -1 \r\n-1 -1 \r\n-1 -1Output:2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MOBILE2",
  "scraped_at": "2025-08-17 00:33:44"
}