{
  "problem_code": "problems",
  "title": "Trees",
  "tags": [],
  "text": "Byteasar has a cottage. Lately, he has bought n trees and had them planted all in one row. Byteasar does not,\r\nhowever, like the order which the trees have been planted in. It particularly annoys him that tall and short\r\nones have been mixed up, and the composition does not meet his aesthetic criteria.Byteasar has invented adisorder coefficientso as to allow the gardener to comprehend his intentions: the\r\nlower the value of the coefficient the prettier the row of trees. It is defined in the following way: |h1−h2|+\r\n|h2−h3|+ ... +|hn−1−hn|, where h1,h2... hnare the heights of consecutive trees in a row.Replanting is a very toilsome and cumbersome task, therefore Byteasar has ordered the gardener to replant\r\ntwo trees at the most (i.e. interchange their positions). The task of the gardener is to choose the pair to replant\r\nin a way that makes the disorder coefficient the smallest.The gardener is not sure if he has chosen the correct pair of trees and he fears he may lose his job if\r\nhe is mistaken. Help him: for each tree calculate the minimal disorder coefficient that may be attained by\r\nswitching places with any other tree.TaskWrite a program which:reads the height of the consecutive trees in a row from the standard input,for each tree calculates the minimal disorder coefficient that may be attained should it switch places\r\nwith some other tree (or should there be no change at all),writes the outcome to the standard output.InputThe first line of the standard input contains one integern(2 ≤n≤ 50000). The other containsnintegers hi(1 ≤ hi≤ 100000000) separated by single spaces, denoting the height of the consecutive trees in the row.OutputThe output should consist of preciselynlines. The i-th line should contain a single integer - the smallest\r\ndisorder coefficient attainable when considering replanting of the i-th tree.ExampleInput:5\r\n7 4 5 2 5Output:7\r\n7\r\n8\r\n7\r\n7* Added some unofficial tests",
  "sample_input": "Input:5\r\n7 4 5 2 5Output:7\r\n7\r\n8\r\n7\r\n7",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TREEOI14",
  "scraped_at": "2025-08-17 00:33:35"
}