{
  "problem_code": "problems",
  "title": "Can you answer these queries II",
  "tags": [],
  "text": "Being a completist and a simplest, kid Yang Zhe cannot solve but\r\n  get Wrong Answer from most of the OI problems. And he refuse to\r\n  write two program of same kind at all. So he always fails in\r\n  contests.When having a contest, Yang Zhe looks at the score of every\r\n  problems first. For the problems of the same score, Yang Zhe will\r\n  do only one of them. If he's lucky enough, he can get all the scores\r\n  wanted.Amber is going to hold a contest in SPOJ. She has made a list ofNcandidate problems, which fit Yang Zhe very well. So Yang\r\n  Zhe can solve any problem he want. Amber lined up the problems,\r\n  began to select. She will select a subsequence of the list as the\r\n  final problems. Being A girl of great compassion, she'd like to\r\n  select such a subsequence (can be empty) that Yang Zhe will get the\r\n  maximal score over all the possible subsequences.Amber found the subsequence easily after a few minutes. To make\r\n  things harder, Amber decided that, Yang Zhe can take this contest\r\n  only if Yang Zhe can answer herQquestions. The question is:\r\n  if the final problems are limited to be a subsequence\r\n  oflist[X..Y] (1 <=X<=Y<= N),\r\n  what's the maximal possible score Yang Zhe can get?As we know, Yang Zhe is a bit idiot (so why did he solve the\r\n  problem with a negative score?), he got Wrong Answer again... Tell\r\n  him the correct answer!InputLine 1: integerN(1 <=N<= 100000);Line 2:Nintegers denoting the score of each problem,\r\n  each of them is a integer in range [-100000, 100000];Line 3: integerQ(1 <=Q<= 100000);Line 3+i(1 <=i<=Q): two\r\n  integersXandYdenoting theith question.OutputLinei: a single integer, the answer to theith\r\n  question.ExampleInput:9\r\n4 -2 -2 3 -1 -4 2 2 -6\r\n3\r\n1 2\r\n1 5\r\n4 9Output:4\r\n5\r\n3Warning: large input/output data, be careful with certain languages",
  "sample_input": "Input:9\r\n4 -2 -2 3 -1 -4 2 2 -6\r\n3\r\n1 2\r\n1 5\r\n4 9Output:4\r\n5\r\n3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GSS2",
  "scraped_at": "2025-08-17 00:33:32"
}