{
  "problem_code": "problems",
  "title": "Logic II",
  "tags": [],
  "text": "Some day in 2003 in Byteland began calm and quietly as any other day. Some people went to work, some to school, some to store to buy food. Drivers were traditionally stucked in traffic jams, drinking coffee and reading morning newspaper. Suddenly the regularity of this day was disturbed by huge explosion.\"They blew up the embassy of Bajtocja!!!\"  somebody cried. Everybody began to run away in panic.Police works pretty good in Byteland and first radiocars appeared near the embassy only few seconds after the explosion. All the people near the embassy were detained. Only one of the people is the organizer of the explosion, the others could by just occasional witnesses. It is known, among these M(1<=M<=11) people, N(1<=N<=M) people always lie because they want to make the work of police more difficult, the others always tell the truth.All these people say P(1<=P<=30) sentences in total.All the useful sentences are in one of the 4 forms below, all the other sentences are useless and you can ignore them.I am guilty.I am not guilty.Somebodyis guilty.Somebodyis not guilty.Today isSomeday.Among these sentences,Somebodyis a name of one of these M people, andSomedayis Monday, Tuesday, Wednesday, Thursday, Friday, Saturday or Sunday.Your task is to help the police to find out the only one organizer of the explosion.InputMultiple test cases. For each test case:The first line contains three integers M, N and P. M lines follow, each contains a name of one of the people.All names contain only capital Latin letters and no whitespaces.P lines come next, each contains no more than 250 characters, the speaker and his/her speech. See the example.You can assume that there's no whitespace at the start and the end of a line, and there are no two consecutive spaces in the input.Input terminate by EOF.OutputThe name of the organizer if you can determine, orCannot Determineif you find more than one person is possible, orImpossibleif you find the situation is contradictory.ExampleInput:3 1 5\r\nMIKE\r\nCHARLES\r\nKATE\r\nMIKE: I am guilty.\r\nMIKE: Today is Sunday.\r\nCHARLES: MIKE is guilty.\r\nKATE: I am guilty.\r\nKATE: How are you??Output:MIKE",
  "sample_input": "Input:3 1 5\r\nMIKE\r\nCHARLES\r\nKATE\r\nMIKE: I am guilty.\r\nMIKE: Today is Sunday.\r\nCHARLES: MIKE is guilty.\r\nKATE: I am guilty.\r\nKATE: How are you??Output:MIKE",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LOGIC2",
  "scraped_at": "2025-08-17 00:33:41"
}