{
  "problem_code": "problems",
  "title": "Coconuts",
  "tags": [],
  "text": "A group of n castle guards are voting to determine whether African swallows can carry coconuts.  While each guard has his \r\nown personal opinion on the matter, a guard will often vote contrary to his beliefs in order to avoid disagreeing with the \r\nvotes of his friends.You are given a list of guards who either do or do not believe in the coconut-carrying capacity of African swallows, and a \r\nlist of all pairs of guards who are friends.  Your task is to determine how each guard must vote in order to minimize the sum \r\nof the total number of disagreements between friends and the total number of guards who must vote against their own beliefs.InputThe input to this problem will contain multiple test cases.  Each test case begins with a single line containing an \r\ninteger n (where 2 ≤ n ≤ 300), the number of guards, and an integer m (where 1 ≤ m ≤ n(n-1)/2), the number of pairs of \r\nguards who are friends.  The second line of the test case contains n integers, where the ith integer is 1 if the ith guard \r\nbelieves in the ability of African swallows to carry coconuts, and 0 otherwise.  Finally, the next m lines of the test case \r\neach contain two distinct integers i and j (where 1 ≤ i, j ≤ n), indicating that guards i and j are friends.  Guards within \r\neach pair of friends may be listed in any order, but no pair of guards will be repeated. The input is terminated by an \r\ninvalid test case with n = m = 0, which should not be processed.OutputFor each input test case, print a single line containing the minimum possible sum of the total number of disagreements \r\nbetween all friends plus the total number of guards who must vote against their own beliefs.ExampleInput:3 3\r\n1 0 0\r\n1 2\r\n1 3\r\n3 2\r\n6 6\r\n1 1 1 0 0 0\r\n1 2\r\n2 3\r\n4 2\r\n3 5\r\n4 5\r\n5 6\r\n0 0Output:1\r\n2",
  "sample_input": "Input:3 3\r\n1 0 0\r\n1 2\r\n1 3\r\n3 2\r\n6 6\r\n1 1 1 0 0 0\r\n1 2\r\n2 3\r\n4 2\r\n3 5\r\n4 5\r\n5 6\r\n0 0Output:1\r\n2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/COCONUTS",
  "scraped_at": "2025-08-17 00:33:47"
}