{
  "problem_code": "problems",
  "title": "ACM (ACronymMaker)",
  "tags": [],
  "text": "The sadists who design problems for ACM programming contests often like to include the abbre-\r\nviation “ACM” somewhere in their problem descriptions. Thus, in years past, the World Finals\r\nhas had problems involving “Apartment Construction Management,” the “Atheneum of Culture and\r\nMovies,” the “Association of Cover Manufacturers,” “ACM Airlines,” the “Association for Computa-\r\ntional Marinelife,” and even an insect named “Amelia Cheese Mite.” However, the number of word\r\ncombinations beginning with A, C, and M that make sense is finite and the problem writers are starting\r\nto run out of ideas (it’s hard to think of problems about “Antidisestablishmentarianistic Chthonian\r\nMetalinguistics”). Fortunately, modern culture allows more flexibility in designing abbreviations —\r\nconsider, for example:GDB — Gnu DeBugger\r\nLINUX — either “LINus’s UniX” or “LINUs’s miniX” or “Linux Is Not UniX”\r\nSNOBOL — StriNg Oriented symBOlic Language\r\nSPITBOL — SPeedy ImplemenTation of snoBOLThe rules used in these examples seem to be:Insignificant words (such as “of”, “a”, “the”, etc.) are ignored.The letters of the abbreviation must appear, in the correct order, as an ordered sublist of the\r\nletters in the significant words of the phrase to be abbreviated.At least one letter of the abbreviation must come from every significant word (multiple occurrences\r\nof a letter are, of course, treated as distinct).Of course these rules are often broken in real life. For instance, RADAR is an abbreviation for “RAdio\r\nDetecting And Ranging”. Under our rules (assuming that “and” is an insignificant word), this would\r\nnot be a valid abbreviation (however, RADR or RADRAN or DODGING would be valid). You have\r\nbeen asked to take a list of insignificant words and a list of abbreviations and phrases and to determine\r\nin how many ways each abbreviation can be formed from the corresponding phrase according to the\r\nrules above.InputThe input file consists of multiple scenarios. Each scenario begins with an integer 1 ≤n≤ 100 followed\r\nbyninsignificant words, all in lower case, one per line with no extra white space. (A line containing\r\n0 indicates end of input.) Following this are one or more test cases for this scenario, one per line,\r\nfollowed by a line containing the phrase “LAST CASE”. Each line containing a test case begins with\r\nan abbreviation (uppercase letters only) followed by a phrase (lowercase letters and spaces only). The\r\nabbreviation has length at least 1 and the phrase contains at least one significant word. No input line\r\n(including abbreviation, phrase, and spaces) will contain more than 150 characters. Within these limits,\r\nhowever, abbreviations and phrase words may be any length.OutputFor each test case, output the abbreviation followed by eitheris not a valid abbreviationorcan be formed in i wayswhereiis the number of different ways in which the letters of the abbreviation may be assigned to the\r\nletters in the phrase according to the rules above. The value ofiwill not exceed the range of a 32-bit\r\nsigned integer.ExampleInput:2\r\nand\r\nof\r\nACM academy of computer makers\r\nRADAR radio detection and ranging\r\nLAST CASE\r\n2\r\na\r\nan\r\nAPPLY an apple a day\r\nLAST CASE\r\n0Output:ACM can be formed in 2 ways\r\nRADAR is not a valid abbreviation\r\nAPPLY can be formed in 1 ways",
  "sample_input": "GDB — Gnu DeBugger\r\nLINUX — either “LINus’s UniX” or “LINUs’s miniX” or “Linux Is Not UniX”\r\nSNOBOL — StriNg Oriented symBOlic Language\r\nSPITBOL — SPeedy ImplemenTation of snoBOL",
  "sample_output": "Input:2\r\nand\r\nof\r\nACM academy of computer makers\r\nRADAR radio detection and ranging\r\nLAST CASE\r\n2\r\na\r\nan\r\nAPPLY an apple a day\r\nLAST CASE\r\n0Output:ACM can be formed in 2 ways\r\nRADAR is not a valid abbreviation\r\nAPPLY can be formed in 1 ways",
  "link": "https://www.spoj.com/problems/ACMAKER",
  "scraped_at": "2025-08-17 00:33:46"
}