{
  "problem_code": "problems",
  "title": "Two Ends",
  "tags": [],
  "text": "In the two-player game “Two Ends”, an even number of cards is laid out in a row. On each card, face\r\nup, is written a positive integer. Players take turns removing a card from either end of the row and\r\nplacing the card in their pile. The player whose cards add up to the highest number wins the game.\r\nNow one strategy is to simply pick the card at the end that is the largest — we’ll call this the greedy\r\nstrategy. However, this is not always optimal, as the following example shows: (The first player would\r\nwin if she would first pick the 3 instead of the 4.)3 2 10 4You are to determine exactly how bad the greedy strategy is for different games when the second player\r\nuses it but the first player is free to use any strategy she wishes.InputThere will be multiple test cases. Each test case will be contained on one line. Each line will start with\r\nan even integer n followed by n positive integers. A value ofn= 0 indicates end of input. You may\r\nassume thatnis no more than 1000. Furthermore, you may assume that the sum of the numbers in\r\nthe list does not exceed 1,000,000.OutputFor each test case you should print one line of output of the form:In game m, the greedy strategy might lose by as many as p points.wheremis the number of the game (starting at game 1) andpis the maximum possible difference\r\nbetween the first player’s score and second player’s score when the second player uses the greedy strategy.\r\nWhen employing the greedy strategy, always take the larger end. If there is a tie, remove the left end.ExampleInput:4 3 2 10 4\r\n8 1 2 3 4 5 6 7 8\r\n8 2 2 1 5 3 8 7 3\r\n0Output:In game 1, the greedy strategy might lose by as many as 7 points.\r\nIn game 2, the greedy strategy might lose by as many as 4 points.\r\nIn game 3, the greedy strategy might lose by as many as 5 points.",
  "sample_input": "Input:4 3 2 10 4\r\n8 1 2 3 4 5 6 7 8\r\n8 2 2 1 5 3 8 7 3\r\n0Output:In game 1, the greedy strategy might lose by as many as 7 points.\r\nIn game 2, the greedy strategy might lose by as many as 4 points.\r\nIn game 3, the greedy strategy might lose by as many as 5 points.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TWENDS",
  "scraped_at": "2025-08-17 00:33:35"
}