{
  "problem_code": "problems",
  "title": "Queens, Knights and Pawns",
  "tags": [],
  "text": "You all are familiar with the famous 8-queens problem which asks you to place 8 queens on a chess\r\nboard so no two attack each other. In this problem, you will be given locations of queens and knights\r\nand pawns and asked to find how many of the unoccupied squares on the board are not under attack\r\nfrom either a queen or a knight (or both). We’ll call such squares “safe” squares. Here, pawns will\r\nonly serve as blockers and have no capturing ability. The board below has 6 safe squares. (The shaded\r\nsquares are safe.)Recall that a knight moves to any unoccupied square that is on the opposite corner of a 2x3 rectangle\r\nfrom its current position; a queen moves to any square that is visible in any of the eight horizontal,\r\nvertical, and diagonal directions from the current position. Note that the movement of a queen can be\r\nblocked by another piece, while a knight’s movement can not.InputThere will be multiple test cases. Each test case will consist of 4 lines. The first line will contain\r\ntwo integers n and m, indicating the dimensions of the board, giving rows and columns, respectively.\r\nNeither integer will exceed 1000. The next three lines will each be of the formk r1c1r2c2· · · rkckindicating the location of the queens, knights and pawns, respectively. The numbering of the rows and\r\ncolumns will start at one. There will be no more than 100 of any one piece. Values of n = m = 0\r\nindicate end of input.OutputEach test case should generate one line of the formBoard b has s safe squares.wherebis the number of the board (starting at one) and you supply the correct value fors.Example4 4\r\n2 1 4 2 4\r\n1 1 2\r\n1 2 3\r\n2 3\r\n1 1 2\r\n1 1 1\r\n0\r\n1000 1000\r\n1 3 3\r\n0\r\n0\r\n0 0Output:Board 1 has 6 safe squares.\r\nBoard 2 has 0 safe squares.\r\nBoard 3 has 996998 safe squares.",
  "sample_input": "4 4\r\n2 1 4 2 4\r\n1 1 2\r\n1 2 3\r\n2 3\r\n1 1 2\r\n1 1 1\r\n0\r\n1000 1000\r\n1 3 3\r\n0\r\n0\r\n0 0Output:Board 1 has 6 safe squares.\r\nBoard 2 has 0 safe squares.\r\nBoard 3 has 996998 safe squares.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/QKP",
  "scraped_at": "2025-08-17 00:33:27"
}