{
  "problem_code": "problems",
  "title": "Exchange",
  "tags": [],
  "text": "There are 3 kinds of money in a planet far away from the earth: Mone, Luck, and Rpin. There's a money exchange company in this planet. You must go to this company if you want to do some money exchange, and, more autocratically, this company regulate the exchange rate of each pair of these 3 kinds of money.The money exchange will be done in the following two ways:(A) You give the company a real numberxin the range (0,100], the company will exchangex% of your Mone andx% of your Luck to equal Rpin according to the exchange rate of that day.(B) You give the company a real numberx, the company will exchange yourxRpin to some Mone and Luck, whose value is equal toxRpin according to the exchange rate of that day, and, the value of Mone isRatetimes of the value of Luck.You can do many exchange operations in the same day.Now, as the excellent spy in this planet, you know the exchange rate between Mone and Rpin of each of the nextndays(aiRpin per Mone), and the exchange rate between Luck and Rpin of each of the nextndays(biRpin per Luck), and, each Rate of the nextndays (Ratei). you haveSRpin in the start, and you want to get most Rpin in thenth day later.InputMultiple test cases, the number of them (≤ 5) is given in the very first line.For each test case:The first line contains a integer number n (1 ≤ n ≤ 100000) and a real number S.n lines follow, each contains 3 real numbers: ai(between 0 and 10), bi(between 0 and 10), Ratei(between 0 and 100).OutputFor each test case, output one line contains a real number with 3 digits after decimal point, which denotes to the answer. You can assume it is less than 1000000000.ExampleInput:1\r\n3 100\r\n1 1 1\r\n1 2 2\r\n2 2 3Output:225.000NoteFor the example, one optimal way to gain 225 Rpin is as follows:Day 1: Exchange all Rpin to Mone and Luck (1 : 1). Gain 50 Mone and 50 Luck.Day 2: Exchange all Mone and Luck to Rpin. Gain 50×1 + 50×2 = 150 Rpin. Then exchange all Rpin to Mone and Luck(2 : 1). Gain 75 Mone and 37.5 Luck.Day 3: Exchange all Mone and Luck to Rpin. Gain 75×2 + 37.5×2 = 225 Rpin.Warning: large input/output data, be careful with certain languages; the time limit is somewhat strict for this problem",
  "sample_input": "Input:1\r\n3 100\r\n1 1 1\r\n1 2 2\r\n2 2 3Output:225.000",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/EXCHANGE",
  "scraped_at": "2025-08-17 00:33:42"
}