{
  "problem_code": "problems",
  "title": "Encode Message",
  "tags": [],
  "text": "Everyone knows that how much Shahjahan loved Mumtaaz, that he got built the Taj Mahal in the memory of his beloved Mumtaaz. Once Mumtaaz had fight with Shahjahan and she went to her father's home. Shahjahan then wrote a letter to Mumtaaz requesting her to come back, but then suddenly he realized that it is not safe to write letter in plain format (non-encoded message), so he thought whole day for a good method of encryption and then came up with a great idea of decoding his messages.The technique of encoding messages used by Shahejahan is describes as-1. Akey Kis set of digits (0-9) such that its value doesn't exceed106.2. Amessage Mis set of small letters (a-z) such that its length doesn't exceed500.3. Theencoding function F(m, k) = m'is a function that takes one digit from key and one character from message and encode it to another character.The encoding algorithm is given by following pseudo code-start of code1. Repeat until message has characters to be encoded.2. Read nextcharacter c, of message.3. Read nextdigit k, of key.4. Encode using thefunction F(m, k) = m' : m' = m + k.5. If last digit k, of key is read then start reading in reverse order.6. If first digit k, of key is read while reading in reverse order, then start again reading in forward direction.end of codeThe addition operation to characters is cyclic. Consider the following examples demonstrating the operator-1. 'a' + 2 = 'c'2. 't' + 1 = 'u'3. 'z' + 2 = 'b'4. 'y' + 0 = 'y'Consider the following encoding of message\"mumtaaz\"with key132-Character cDigit kF(c, k)m1nu3xm2ot2va3da1bz1aSo message \"mumtaaz\" is encoded as\"nxovdba\".InputFirst line of input itT(T < 10001), total number of test cases.Each test case is consist of two lines, the first line contains key and second line contains encoded message.OutputFor each test cases, output the original message in single line.ExampleInput:6\r\n132\r\nnxovdba\r\n212\r\nuitktjvjmc\r\n011\r\nlfbejngafspsasfjnposubot\r\n123\r\njnrygzpw\r\n11\r\nlfbejngafspsasfjnposubot\r\n130\r\nbehipbobuOutput:mumtaaz\r\nshrishtika\r\nleadingzerosareimportant\r\niloveyou\r\nkeadimfzerorzreimonrtans\r\nabhimanyu",
  "sample_input": "Input:6\r\n132\r\nnxovdba\r\n212\r\nuitktjvjmc\r\n011\r\nlfbejngafspsasfjnposubot\r\n123\r\njnrygzpw\r\n11\r\nlfbejngafspsasfjnposubot\r\n130\r\nbehipbobuOutput:mumtaaz\r\nshrishtika\r\nleadingzerosareimportant\r\niloveyou\r\nkeadimfzerorzreimonrtans\r\nabhimanyu",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SNGMSG",
  "scraped_at": "2025-08-17 00:33:43"
}