{
  "problem_code": "problems",
  "title": "Radiation",
  "tags": [],
  "text": "Nuclear power plants (NPP) are a blessing and curse of modern civilization. NPPs have some risks but still it is one of the cheapest ways to produce electricity in the developed world. In this problem we will discuss a situation related to two nuclear plants, which are not far away from each other.We will describe the entire scenario in a flat land, so two-dimensional Cartesian coordinate system is used to denote each location. Lets assume that the coordinate of the two nuclear power plants are (ax; ay) and (bx; by). Houses that are located within distance R1 (inclusive) of the power plant at (ax; ay) are under high risk of radiation. Similarly, houses that are located within distance R2 (inclusive) of the power plant at (bx; by) are under high risk of radiation. So the authorities of power plant 1 and power plant 2 distribute special protective equipment to the houses that are within radius (inclusive) R1 and R2 of the respective power plants. As a result each of the houses that are endangered by both the plants actually receive two sets of equipment to protect their house.Given the location of the houses and the values of ax; ay; bx; by and possible values of R1 and R2 your job is to find out the number of houses that are endangered by both the plantsInputThe input file contains at most 3 test cases. The description of each test case is given below:A test case starts with a line containing a positive integer N (0 < N ≤ 200000) that denotes the number of houses that are under either low risk or high risk of radiation. Each of the next N lines contains two integers xi, yi (0 ≤ xi, yi ≤ 20000) that denotes the coordinate of the i-th house.No two houses are at the same location. The next line contains five integers ax, ay, bx, by and q (0 ≤ ax, ay, bx, by ≤ 20000, 0 < q ≤ 20000). The meaning of ax, ay, bx and by are given in the problem statement. Here q denotes the total number of queries. Each of the next q lines contains two integers, which denote the values of R1 and R2 (0 < R1, R2 ≤ 13000) respectively.A line containing a single zero terminates input. This line should not be processed.OutputFor each test case produce q+ 1 lines of output. The first line is the serial of output. For each query (given value of R1 and R2) determine the number of houses that are endangered by both the plants. You may consider using faster IO as judge input file is large.Note: First query in the sample input corresponds to Figure 1.ExampleInput:11\r\n95 75\r\n27 6\r\n93 5\r\n124 13\r\n34 49\r\n65 61\r\n81 49\r\n77 33\r\n110 50\r\n91 22\r\n110 25\r\n57 42 97 36 1\r\n31 25\r\n0Output:Case 1:\r\n2",
  "sample_input": "Input:11\r\n95 75\r\n27 6\r\n93 5\r\n124 13\r\n34 49\r\n65 61\r\n81 49\r\n77 33\r\n110 50\r\n91 22\r\n110 25\r\n57 42 97 36 1\r\n31 25\r\n0Output:Case 1:\r\n2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/UVA1",
  "scraped_at": "2025-08-17 00:33:52"
}