{
  "problem_code": "problems",
  "title": "Milk Scheduling",
  "tags": [],
  "text": "(For Vietnamese version, see below.)Farmer John has N cows that need to be milked (1 ≤ N ≤ 10,000), each of which takes only one unit of time to milk.Being impatient animals, some cows will refuse to be milked if Farmer John waits too long to milk them. More specifically, cow i produces gigallons of milk (1 ≤ gi≤ 1000), but only if she is milked before a deadline at time di(1 ≤ di≤ 10,000). Time starts at t=0, so at most x total cows can be milked prior to a deadline at time t=x.Please help Farmer John determine the maximum amount of milk that he can obtain if he milks the cows optimally.InputLine 1: The value of N.Lines 2..1+N: Line i+1 contains the integers giand di.OutputA single numbers denotes the maximum number of gallons of milk Farmer John can obtain.SampleInput:4\r\n10 3\r\n7 5\r\n8 1\r\n2 1Output :25ExplanationThere are 4 cows. The first produces 10 gallons of milk if milked by time 3, and so on.Farmer John milks cow 3 first, giving up on cow 4 since she cannot be milked by her deadline due to the conflict with cow 3. Farmer John then milks cows 1 and 2.***Nông dân John có N con bò, để vắt sữa một con bò cần 1 đơn vị thời gian.Vốn là loài vật lười, những con bò sẽ không chịu để vắt sữa nếu John bắt chúng chờ quá lâu. Cụ thể, con bò i cho gigallon sữa, nhưng chỉ khi nó được vắt sữa trước thời gian di. Thời gian bắt đầu ở T = 0, nên có tối đa X con bò có thể được vắt sữa trước thời hạn T = X.Hãy giúp nông dân John tính lượng sữa tối đa mà ông có thể vắt được nếu như ông chọn được cách vắt hiệu quả nhất.Input :- Dòng 1 : chứa số nguyên dương N.- Dòng 2 -> n + 1 : dòng thứ i + 1 chứa 2 số nguyên givà di.Output :- Lượng sữa nhiều nhất mà John có thể vắt.Giới hạn :- 1 ≤ n ≤ 10000- 1 ≤ gi≤ 1000- 1 ≤ di≤ 10000Ví dụ :Input :410 37 58 12 1Output :25Giải thích : John vắt sữa con bò 3, sau đó đến con 1 rồi con 2.",
  "sample_input": "Input:4\r\n10 3\r\n7 5\r\n8 1\r\n2 1Output :25",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MSCHED",
  "scraped_at": "2025-08-17 00:33:50"
}