{
  "problem_code": "problems",
  "title": "Terrorist Attack",
  "tags": [],
  "text": "In his final interview Digo is given a map of a city containing N junctions connected by roads of length 1.\r\nThere is only one path between any two junctions. Each junction has a unique index between 1 and N (inclusive).\r\nThere are M civilians in the city. Everyday, each civilian visits a set of junctions.There are military camps built at certain junctions.\r\nThe terrorists are planning to attack the city by targeting some junctions.\r\nHowever due to the presence of military camps,\r\nthere is a limit to the size of explosion they can make at any particular junction.\r\nThe intensity of the bomb planted at a junction is equal to the minimum distance from\r\nany military camp to the targeted junction.\r\nThe damage of all civilians passing through a targeted junction increases by\r\nthe intensity of the bomb dropped at the junction.\r\nThe military camps set up and the terrorist targets are given in the form of the following queries:1 J : Meaning that a new military camp is set up at junction J.2 J : Meaning that the junction J is targeted by terrorists.3 J : Print the total damage done until now to all civilians visiting junction J.Initially there is exactly one military camp at junction 1.\r\nThe initial damage of all civilians is given to you.InputFirst line contains 3 integers N, M, Q. N is the number of junctions, M is the number of civilians and Q is the number of queries to follow.Next N-1 lines contains 2 integers U and V (denoting that there is a road connecting U and V).Next M lines contains one integer each. The ith line contains integer a[i] representing the initial damage of the ith civilian. Next M lines contain the description of the junctions visited by the ith civilian (First integer of every line is X, the number of junctions visited by the ith civilian, followed by X integers representing the respective junctions).Next Q lines give the corresponding queries. Each query can be described by two integers T, J, where T is the type of query (which can be 1 or 2 or 3) and J is the respective junction of the query.OutputFor all the queries of type 3 print an integer answering the query.Constraints1 ≤ N ≤ 500001 ≤ M ≤ 100001 ≤ Q ≤ 500001 ≤ X, V, U, J ≤ N1 ≤ a[i] ≤ 1000Sum of all the junctions crossed by all the civilians is less than 50001Note: The Final answer will fit in 64 bit signed integer.ExampleInput:3 1 3\r\n1 2\r\n2 3\r\n5\r\n2 2 3\r\n3 3\r\n2 3\r\n3 3Output:5\r\n7",
  "sample_input": "Input:3 1 3\r\n1 2\r\n2 3\r\n5\r\n2 2 3\r\n3 3\r\n2 3\r\n3 3Output:5\r\n7",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/INS14M",
  "scraped_at": "2025-08-17 00:33:38"
}