{
  "problem_code": "problems",
  "title": "Machau vs Maggu",
  "tags": [],
  "text": "You will find three types of people in an engineering collegeMaggu,MachauandOthers. We all know how much hard Maggu people try to portray themselves as Machau but they never succeed. Today Machau people have decided to recruit few Maggus and convert them to Machau. All the Maggus who wanted to become Machau had to reach Machau Club situated at \"YAY MACHAU\" from their currentlocation A. Machau people had laid many books everywhere on the campus to distract Maggus and make it difficult for them to reach Machau club. The campus can be imagined as a largeN x N gridin which Maggu is located at positionAwhich is denoted by(Ax, Ay)coordinate and the Machau Club is located at positionBwhich is denoted by(Bx, By)coordinate. Machau people had laid books atMrandom locations denoted by(Xi, Yi)where1<=i<=M. Additionally to prevent Maggus who take up the challenge to runaway Machau people laid bookseverywhere outside the rectangular area where Maggu's location A and Machau Club's location B are are ends of the diagonal of that rectangular area. A Maggu can only walk inleft, right, up or downdirections from his current place as long as he doesn't leave the campus i.e. he stays inside theN x Ngrid. If a Maggu wants to become Machau he must reach Machau Club without touching a single book in his path and without leaving the campus grid.More formally stating the problem: Given anN x Ngrid withMnon-reachable cells. Test whether cell\"B\"can be reached from cell\"A\"provided only left, right, up and down movements are valid.You must print \"YAY MACHAU\" if it is possible for a Maggu to reach Machau Club else print \"MAGGU FOREVER\"InputFirst line will contain 6 integersN,M,Ax,Ay,BxandByWhereN=Number of rows and columns in campus grid,M=Total number of books laid on the campus,Ax, Ay=Coordinates of Maggu,Bx, By=Coordinates of Machau Club.NextMlines will containXiandYidenoting coordinates onN x Ngrid which contain books to distract MAGGUSNOTE: If any book is placed in position A or B MAGGU will always be distracted. All(Xi, Yi)pairs are not guaranteed to be distinct.OutputPrint \"YAY MACHAU\" if Maggu can reach Machau club otherwise print \"MAGGU FOREVER\" [without quotes]Constraints1<=N<=10^91<=M<=10^51<=Ax, Ay, Bx, By, Xi, Yi<=NSampleInput1000 2 10 1000 1000 10\r\n1 1\r\n100 100OutputYAY MACHAU",
  "sample_input": "Input1000 2 10 1000 1000 10\r\n1 1\r\n100 100OutputYAY MACHAU",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MACVSMAG",
  "scraped_at": "2025-08-17 00:33:38"
}