{
  "problem_code": "problems",
  "title": "Tabovi",
  "tags": [],
  "text": "Zvonkec is yet another programmer employed in a small company. Every day he has to refactor one file of source code. Much to his dismay, the source is usually far from being clear and tidy. He is especially bothered by uneven indentation, i.e. the number of tabulators (tabs) indenting each line.Fortunately, his editor has a command to select a group of consecutive lines and add or delete a character from the start of each one. Help Zvonkec tidy up the code as quickly as possible.You are given the number of lines N, a sequence specifying the current number of tabs at the start of each line, and a sequence specifying the required number of tabs at the start of each line.Zvonkec can execute any number of commands consisting of:selecting any number of consecutive linesadding or deleting a single tab to/from the front of each of the selected linesThe two actions above comprise a single command, regardless of the number of selected lines. It should be noted that it is forbidden to delete more tabs from a line than are actually present at the start of a line, as the editor would start deleting characters other than tabs.You are asked to calculate the minimum number of commands required to tidy up the code.InputThe first line of input contains a positive integer N (N ≤ 1000).The second line contains a sequence of N integers Pi (0 ≤ Pi ≤ 80), specifying the number of tabs at the start of i-th line before any editing.The third line contains a sequence of N integers Ki (0 ≤ Ki ≤ 80), specifying the number of tabs that Zvonkec would like at the start of i-th line.OutputThe first and only line of output must contain the required number, as specified in the problem statement.ExampleInput:3\r\n3 4 5\r\n6 7 8Output:3Input:4\r\n1 2 3 4\r\n3 1 1 0Output:6Input:4\r\n5 4 5 5\r\n1 5 0 1Output:10",
  "sample_input": "Input:3\r\n3 4 5\r\n6 7 8Output:3",
  "sample_output": "Input:4\r\n1 2 3 4\r\n3 1 1 0Output:6",
  "link": "https://www.spoj.com/problems/C1TABOVI",
  "scraped_at": "2025-08-17 00:33:37"
}