{
  "problem_code": "problems",
  "title": "Check Ramsey",
  "tags": [],
  "text": "From Ramsey theorem we know that for everyk, lpair there exists an integer:R(k, l) for that ifn ≥ R(k, l), then if you color the edges of a complete graph onnvertices with red and blue then it contains a complete subgraph onkvertices whose edges are blue or a complete subgraph onlvertices whose edges are red. To get an impression of the theorem you have to count the number of complete subgraphs havingknodes with blue edges -K(k) and the number of complete subgraphs havinglnodes with red edges -K(l) for each edge coloring.To make the problem somewhat easier (or harder?) for each test the probability that an edge is red (or blue) is close to 1/2. This means that onnvertices you will see aboutn(n-1)/4 red edges.InputThe first line contains the number of test casesT, whereT≤ 100. After it there is a blank line and also after every test. Each test starts with four integersn,k,l,ein this order, where 3 ≤k≤l≤n< 100, hereeis the number of red edges (we are not interested in very large monochromatic complete subgraphs, so you can assume thatk,l≤ 10 is also true). Then followelines, each of them gives two integers:x,y, it means that there is a red edge between points 0 ≤x,y<n. All other edges are blue.OutputFor each test print the case number then the count of blueK(k) and redK(l) for the edge coloring.ExampleInput:35 3 3 50 11 22 33 44 06 3 3 60 11 22 33 44 55 08 3 4 70 10 20 30 41 21 32 3Output:Case #1:The number of blue K(3) is 0 and the number of red K(3) is 0.Case #2:The number of blue K(3) is 2 and the number of red K(3) is 0.Case #3:The number of blue K(3) is 25 and the number of red K(4) is 1.",
  "sample_input": "Input:35 3 3 50 11 22 33 44 06 3 3 60 11 22 33 44 55 08 3 4 70 10 20 30 41 21 32 3Output:Case #1:The number of blue K(3) is 0 and the number of red K(3) is 0.Case #2:The number of blue K(3) is 2 and the number of red K(3) is 0.Case #3:The number of blue K(3) is 25 and the number of red K(4) is 1.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HS10RMSY",
  "scraped_at": "2025-08-17 00:33:30"
}