{
  "problem_code": "problems",
  "title": "Friendly Knights",
  "tags": [],
  "text": "Gurram land is the city of knights and is shaped exactly like a chess board. Some of the cells in this city contains knights. Due to scarcity of grass (Global Warming!), there have been fights between every pair of neighboring knights. Knight A is a neighbor of knight B, if A can reach B in exactly one step (see notes for clarity).To spread peace in the Gurram land, the United Nations has organized a 'Friendship Mela' and wants to distribute friendship neck straps to the knights. Each pair of neighboring knights then exchange neck strap of same color and wear it around their neck, to promote friendship :). To make it more colorful, the UN also wants each knight to have distinct colored neck straps around its neck. The UN is ready to produce any number of straps of a particular color, but can you help them to find out the minimum number of colors to be used.Notes:A knight in cell (x, y) can move in one step to any of the cells (x+2, y+1), (x+2, y-1), (x+1, y+2), (x+1, y-2), (x-2, y+1), (x-2, y-1), (x-1, y+2), (x-1, y-2) i.e., the normal rule in standard chess.InputFirst line contains T (around 10), the number of test cases. Each test case starts with an integer N (0 ≤ N ≤ 10000) the number of knights in the city. Each of the next N lines contains two integers X Y the row and the column number of a knight (1 ≤ X, Y ≤ 100). No two knights are on a same cell.OutputFor each test case, print the minimum number of colors needed, in a separate line.ExampleInput:2\r\n3\r\n1 1\r\n2 3\r\n3 2\r\n4\r\n1 1\r\n2 3\r\n2 1\r\n1 3Output:2\r\n1Case 1 : (1, 1) and (2, 3) can exchange a Red strap, (1, 1) and (3, 2) can exchange a Green Strap.Case 2 : (1, 1) and (2, 3) can exchange a Red strap, (2, 1) and (1, 3) can exchange a Red Strap.",
  "sample_input": "Input:2\r\n3\r\n1 1\r\n2 3\r\n3 2\r\n4\r\n1 1\r\n2 3\r\n2 1\r\n1 3Output:2\r\n1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/KFRIENDS",
  "scraped_at": "2025-08-17 00:33:39"
}