{
  "problem_code": "problems",
  "title": "Mass of Molecule",
  "tags": [],
  "text": "EnglishVietnameseA molecule can be defined as a sequence of atoms and represented by \na chemical formula consisting of letters denoting these atoms. E.g. \nletter H denotes atom of hydrogen, C denotes atom of carbon, O denotes\natom of oxygen, formula COOH represents molecule consisting of \none atom of carbon, two atoms of oxygen and one atom of hydrogen.To write some formulas efficiently, we use the following rules.\nLetters denoting some atoms can be grouped by enclosing in parentheses, \ne.g. formula CH(OH) contains group OH. Groups can be nested – a \ngroup can also contain other groups. To simplify a formula, \nconsecutive occurrences of the same letter can be replaced with \nthat letter followed by a number of these occurrences. E.g. formula \nCOOHHH can be written as CO2H3 and it represents a molecule consisting\nof one atom of carbon, two atoms of oxygen and three atoms of hydrogen. \nFurthermore, consecutive occurrences of the same group can be replaced\nwith that group followed by a number of these occurrences. \nE.g. formula CH (CO2H) (CO2H) (CO2H) can be written as CH(CO2H)3 and  \nmolecule represented by both those formulas consists of four atoms of \ncarbon, four atoms of hydrogen and six atoms of oxygen.\nA number written \nafter a letter or a group is always greater than or equal to 2 and less \nthan or equal to 9.\nA mass of a molecule is a sum of masses of all its atoms. One atom of \nhydrogen has mass 1, one atom of carbon has mass 12 and one atom of oxygen\nhas mass 16.Write a program that will calculate a mass of a molecule.InputThe first and only line of input file contains a formula of a molecule whose\nmass needs to be determined. A formula of a molecule will consist of \ncharacters H, C, O, (, ) , 2, 3 ... 9 only. Its length will be less \nor equal to 100 characters.OutputThe first and only line of output file should contain a mass of a molecule\nrepresented with a given formula. The result will always be less than or \nequal to 10,000.SampleInput:COOHOutput:45Input:CH(CO2H)3Output:148Input:((CH)2(OH2H)(C(H))O)3Output:222",
  "sample_input": "Input:COOHOutput:45",
  "sample_output": "Input:CH(CO2H)3Output:148",
  "link": "https://www.spoj.com/problems/MMASS",
  "scraped_at": "2025-08-17 00:33:42"
}