{
  "problem_code": "problems",
  "title": "GALLUP",
  "tags": [],
  "text": "Often, we see results of gallups, like this:\r\nPrefer red: 3.5%\r\nPrefer green: 4.5%\r\nPrefer yellow: 22.0%\r\nPrefer blue: 70.0%\r\nand you begin to wonder: how many people did they really ask? If the numbers are simple, like 20%, 40%, and 40%, you know that they asked 5 people (or 10, or 15, or more, but we are interested in the minimum number of people).\r\nYour task is to write a program that reads sets of percentages and calculates the smallest number of people that could produce the given percentages. We know that this number is always less than 10 000.InputThe input is a set of percentages. Each set is on a line of its own. Every line starts with an integer n (0 <= n <= 20) giving the number of percentages in the set. If n > 0, the percentages follow as n numbers; these numbers may have 0–5 decimals, and all percentages in a set have the same number of decimals. (If there are no decimals, there is no decimal point.) The percentages always add up to about 100% as there may be small rounding\r\nerrors. Numbers are rounded when digits are removed; they are rounded upwards if the first removed digit is 5 or more. Thus, 4.472 is rounded to 4.47, 4.5, or 4, depending on how many digits you want.OutputFor each set of data, print a line starting with “Case i :”, where “i” is the data set’s number. Then follows a space and an integer giving the computed number of people. If no legal answer in the range 1–9999 exists,\r\nprint “error” instead of the number.ExampleInput:3 20 40 40\r\n3 33.3 33.3 33.3\r\n2 33 67\r\n1 100.0000\r\n4 3.75 4.25 22.00 70.00\r\n2 49 51\r\n2 50 51\r\n2 49 50\r\n0Output:Case 1: 5\r\nCase 2: 3\r\nCase 3: 3\r\nCase 4: 1\r\nCase 5: 400\r\nCase 6: 35\r\nCase 7: 200\r\nCase 8: error",
  "sample_input": "Input:3 20 40 40\r\n3 33.3 33.3 33.3\r\n2 33 67\r\n1 100.0000\r\n4 3.75 4.25 22.00 70.00\r\n2 49 51\r\n2 50 51\r\n2 49 50\r\n0Output:Case 1: 5\r\nCase 2: 3\r\nCase 3: 3\r\nCase 4: 1\r\nCase 5: 400\r\nCase 6: 35\r\nCase 7: 200\r\nCase 8: error",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GALLUP",
  "scraped_at": "2025-08-17 00:33:26"
}