{
  "problem_code": "problems",
  "title": "Morphing is Fun",
  "tags": [],
  "text": "Morphic is a tree that grows very rapidly, bringing happiness to its owner. It has a single trunk\r\nconsisting of a number of cells stacked one on top of another. Each cell has one of n possible colors\r\nwhich determine the way it mutates during the night, while nobody can see it. Florists denote these\r\ncolors by the firstnsmall letters of the English alphabet and know exactly into how many cells, and of\r\nwhat colors, a cell of each color divides. In fact, they have wrote their knowledge down simply withnnonempty words, each word representing the resulting sequence of colors.A seed of a Morphic has a single cell of color a and is rooted firmly in the ground. As long as the\r\nMorphic is still alive, each night all its cells simultaneously morph according to the aforementioned rules,\r\npossibly causing an exponential growth because each new cell is of the same size as the original one. For\r\nexample, if rules say that a becomes ab, and b becomes ca, then after two nights a seed will evolve to\r\na trunk consisting of 4 cells: abca.Therefore the top of a Morphic is usually hidden in clouds. The only way to tell if it is still alive is\r\nto check if visible part of the trunk is changing colors. In order to do so, one can build enormously high\r\n(yet still of constant height) tower, and watch from its top a fixed fragment of the trunk.As you can easily see, it is either sufficient to observe firstkcells from the bottom for some fixedk,\r\nor no matter how high the tower is, you will not be able to tell for sure if a Morphic died. The latter\r\nhappens when for everyk, rules cause thek-th cell to eventually stop changing colors, even though the\r\ntree is still alive and mutating.To prevent waste of money on building such enormous towers, you are to write a program that\r\ndetermines if it is possible to monitor health of a Morphic.InputThe input contains several Morphics descriptions. The first line contains the number of descriptionst(t≤ 10000) that follow. Each of them begins with the number of colorsn(1 ≤n≤ 26). Nextnlines\r\ncontain the rules by which the Morphic grows. The i-th one describes the sequence of colors in bottom-up\r\norder obtained from a single cell of i-th color. Each line contains at most 100 lowercase English letters.OutputFor each test case output one line containing YES if building of a tower is pointless (as in: YES, we can\r\nsave money!). Otherwise output NO.ExampleInput:4\r\n2\r\nab\r\na\r\n3\r\nba\r\nc\r\nc\r\n3\r\nba\r\nc\r\nb\r\n3\r\nbbbbbbbbbbbbbbb\r\nccccccccccccccc\r\ncOutput:YES\r\nYES\r\nNO\r\nYESWarning: enormous input/output data, be careful with certain languages",
  "sample_input": "Input:4\r\n2\r\nab\r\na\r\n3\r\nba\r\nc\r\nc\r\n3\r\nba\r\nc\r\nb\r\n3\r\nbbbbbbbbbbbbbbb\r\nccccccccccccccc\r\ncOutput:YES\r\nYES\r\nNO\r\nYES",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MORPH",
  "scraped_at": "2025-08-17 00:33:58"
}