{
  "problem_code": "problems",
  "title": "Sell Pigs",
  "tags": [],
  "text": "EnglishVietnameseMirko works on a pig farm that consists of M  locked pig-houses \r\nand Mirko  can't unlock any pig-house because he doesn't have the keys. \r\nCustomers come to the farm one after another. Each of them has keys \r\nto some pig-houses and wants to buy a certain number of pigs. \r\nAll data concerning customers planning to visit the farm on that \r\nparticular day are available to Mirko early in the morning so that \r\nhe can make a sales-plan in order to maximize the number of pigs sold. \r\nMore precisely, the procedure is as following: the customer arrives, \r\nopens all pig-houses to which he has the key, Mirko sells a certain number \r\nof pigs from all the unlocked pig-houses to him, and, if Mirko wants, \r\nhe can redistribute the remaining pigs across the unlocked pig-houses. \r\nAn unlimited number of pigs can be placed in every pig-house. \r\nWrite a program that will find the maximum number of pigs that he can \r\nsell on that dayInputThe first line of input file contains two integers M and N, 1 ≤ M ≤ 1000,\r\n1 ≤ N ≤ 100, number of pig-houses and  number of customers. Pig \r\nhouses are numbered from 1 to M and customers are numbered \r\nfrom 1 to N. \r\nThe next line contains M integers, for each pig-house initial number\r\nof pigs. The number of pigs in each pig-house is greater or equal to \r\n0 and less or equal to 1000. \r\nThe next N lines contains records about the customers in the following \r\nform ( record about the i-th customer is written in the (i+2)-th line): \r\nA K1 K2 ... KA B \r\nIt means that this customer has key to the pig-houses marked with \r\nthe numbers K1, K2, ..., KA \r\n(sorted non-decreasingly ) and that he wants to buy B pigs. Numbers \r\nA and B can be equal to 0.OutputThe first and only line of the output file should contain the number of \r\nsold pigs.SampleInput:3 3\r\n3 1 10\r\n2 1 2 2\r\n2 1 3 3\r\n1 2 6Output:7Input:6 6\r\n6 3 2 0 1 3\r\n2 1 2 0\r\n1 3 3\r\n1 1 1\r\n2 2 3 8\r\n2 4 5 2\r\n2 4 6 6Output:15Input:11 5\r\n1 2 2 1 0 2 4 1 1 1 2\r\n5 1 2 3 4 5 3\r\n4 1 2 6 7 5\r\n2 3 8 1\r\n3 3 6 11 5\r\n3 8 9 10 3Output:17",
  "sample_input": "Input:3 3\r\n3 1 10\r\n2 1 2 2\r\n2 1 3 3\r\n1 2 6Output:7",
  "sample_output": "Input:6 6\r\n6 3 2 0 1 3\r\n2 1 2 0\r\n1 3 3\r\n1 1 1\r\n2 2 3 8\r\n2 4 5 2\r\n2 4 6 6Output:15",
  "link": "https://www.spoj.com/problems/MPIGS",
  "scraped_at": "2025-08-17 00:33:56"
}