{
  "problem_code": "problems",
  "title": "Locomotive",
  "tags": [],
  "text": "Mirko and Slavko have finally gotten jobs as locomotive drivers on\r\nthe Croatian Railroad. As early as the first day of work, they got an\r\nassignment. Each of them was to take their locomotive from a certain\r\ntown and visit as many towns as possible.Mirko is an experienced driver, so he is afraid of nothing.\r\nThis was, however, Slavko’s first train ride and he can do absolutely\r\nnothing by himself. Luckily, all the locomotives have radios, so Slavko\r\ncan drive the locomotive normally as long as he is within the range\r\nof Mirko’s radio to give him instructions.N towns have been given in a coordinate plane. Some of the towns are\r\nconnected by railroad. Mirko and Slavku start their tour in different\r\ntowns, and so that they are at most D kilometers away from each other.The locomotives can use all railroads, at any speed and in any\r\ndirection. Locomotives can switch railroad tracks in towns only.\r\nMirko and Slavko may be at most D kilometers away from each other at\r\nany moment in time.Write a program that will determine all possible towns that Slavko\r\ncan visit, as was described above.InputThe first line of the input file contains the numbers N and P, and\r\na real number D, 2 ≤ N ≤ 100, 1 ≤ P ≤ 3000, 1 ≤ D ≤ 10,000.\r\nThe number N is the number of towns, the number P is the number of\r\nrailroads, and D is the range of the radio in kilometers (a decimal\r\nnumber two digits precise). The towns are numbered 1 to N. Each of\r\nthe following N lines contains data describing one town, i.e. two\r\nintegers, X and Y, -5000 ≤ X, Y ≤ 5000, representing the town’s coordinates.Each of the following P lines contains data describing one railroad\r\ntrack, i.e. two integers G1 and G2, saying there is a railroad\r\ntrack connecting G1 i G2.The next line contains the starting positions of Mirko and Slavku,\r\nthe integers U and V. Mirko starts from town U, Slavko from town V.\r\nU and V will represent two towns separated at most D kilometers\r\nin distance.OutputThe output file should contain the numbers of all the towns Slavko\r\ncan reach. These numbers should be sorted in increasing order, each of\r\nthem written on a separate line.SampleInput:5 4 1.5\r\n0 1\r\n0 0\r\n4 1\r\n4 0\r\n2 2\r\n1 3\r\n1 5\r\n3 5\r\n2 4\r\n2 1Output:1\r\n3Input:8 6 4\r\n0 0\r\n4 3\r\n8 0\r\n16 0\r\n0 -1\r\n8 -1\r\n12 -4\r\n16 -1\r\n1 2\r\n2 3\r\n3 4\r\n5 6\r\n6 7\r\n7 8\r\n1 5Output:5\r\n6\r\n7\r\n8Input:8 6 2\r\n0 0\r\n1 0\r\n2 0\r\n1 1\r\n0 1\r\n1 3\r\n2 1\r\n1 -10\r\n1 2\r\n2 4\r\n2 3\r\n5 6\r\n6 7\r\n2 8\r\n5 1Output:1\r\n2\r\n3\r\n4",
  "sample_input": "Input:5 4 1.5\r\n0 1\r\n0 0\r\n4 1\r\n4 0\r\n2 2\r\n1 3\r\n1 5\r\n3 5\r\n2 4\r\n2 1Output:1\r\n3",
  "sample_output": "Input:8 6 4\r\n0 0\r\n4 3\r\n8 0\r\n16 0\r\n0 -1\r\n8 -1\r\n12 -4\r\n16 -1\r\n1 2\r\n2 3\r\n3 4\r\n5 6\r\n6 7\r\n7 8\r\n1 5Output:5\r\n6\r\n7\r\n8",
  "link": "https://www.spoj.com/problems/MTRAIN",
  "scraped_at": "2025-08-17 00:33:45"
}