{
  "problem_code": "problems",
  "title": "Tele Broadcast",
  "tags": [],
  "text": "EnglishVietnameseA TV-network plans to broadcast an important football match. Their\nnetwork of transmitters and users can be represented as a  tree. The\nroot of the tree is a transmitter that emits the football match, the \nleaves of the tree are the potential users and other vertices \nin the tree are relays (transmitters). \nThe price of transmission of a signal from one transmitter \nto another or to the user is given. A price of \nthe entire \nbroadcast is the sum of prices of all individual signal transmissions. \nEvery user is ready to pay a certain amount of money to watch the \nmatch and the TV-network then decides whether or not to provide the\nuser with the signal. \nWrite a program that will find the maximal number of users able \nto watch the match so that the TV-network’s doesn’t lose money from \nbroadcasting the match.InputThe first line of the input file contains two integers N and M, 2 ≤ N ≤ 3000,\n1 ≤ M ≤ N-1, the number of vertices in the tree and the number of \npotential users. \nThe root of the tree is marked with the number 1, while other transmitters\nare numbered 2 to N-M and potential users are numbered N-M+1 to N. \nThe following N-M lines contain data about the transmitters \nin the following form: \nK A1 C1 A2 C2 ... AK CK \nMeans that a transmitter transmits the signal to K transmitters or \nusers, every one of them described by the pair of numbers A and C, the \ntransmitter or user’s number and the cost of transmitting the signal to \nthem. \nThe last line contains the data about users, containing M integers \nrepresenting respectively the price every one of them is willing to \npay to watch the match.OutputThe first and the only line of the output file should contain the \nmaximal number of users described in the above text.SampleInput:5 3\n2 2 2 5 3\n2 3 2 4 3\n3 4 2Output:2Input:5 3\n2 2 2 5 3\n2 3 2 4 3\n4 4 2Output:3Input:9 6\n3 2 2 3 2 9 3\n2 4 2 5 2\n3 6 2 7 2 8 2\n4 3 3 3 1 1Output:5",
  "sample_input": "Input:5 3\n2 2 2 5 3\n2 3 2 4 3\n3 4 2Output:2",
  "sample_output": "Input:5 3\n2 2 2 5 3\n2 3 2 4 3\n4 4 2Output:3",
  "link": "https://www.spoj.com/problems/MTELE",
  "scraped_at": "2025-08-17 00:33:43"
}