{
  "problem_code": "problems",
  "title": "OTOCI",
  "tags": [],
  "text": "EnglishVietnameseSome time ago Mirko founded a new tourist agency named \"Dreams of Ice\". The agency purchased N\nicy islands near the South Pole and now offers excursions. Especially popular are the emperor\npenguins, which can be found in large numbers on the islands.Mirko's agency has become a huge hit; so big that it is no longer cost-effective to use boats for the\nexcursions. The agency will build bridges between islands and transport tourists by buses. Mirko\nwants to introduce a computer program to manage the bridge building process so that fewer mistakes\nare made.The islands are numbered 1 through N. No two islands are initially connected by bridges. The initial\nnumber of penguins on each island is known. That number may change, but will always be between 0\nand 1000 (inclusive).Your program must handle the following three types of commands:\"bridge A B\" – an offer was received to build a bridge between islands A and B (A and B will\nbe different). To limit costs, your program must accept the offer only if there isn't already a\nway to get from one island to the other using previously built bridges. If the offer is accepted,\nthe program should output \"yes\", after which the bridge is built. If the offer is rejected, the\nprogram should output \"no\".\"penguins A X\" – the penguins on island A have been recounted and there are now X of them.\nThis is an informative command and your program does not need to respond.\"excursion A B\" – a group of tourists wants an excursion from island A to island B. If the\nexcursion is possible (it is possible to get from island A to B), the program should output the\ntotal number of penguins the tourists would see on the excursion (including islands A and B).\nOtherwise, your program should output \"impossible\".InputThe first line contains the integer N (1 ≤ N ≤ 30 000), the number of islands.The second line contains N integers between 0 and 1000, the initial number of penguins on each of the\nislands.The third line contains an integer Q (1 ≤ Q ≤ 300 000), the number of commands.Q commands follow, each on its own line.OutputOutput the responses to commands \"bridge\" and \"excursion\", each on its own line.ExampleInput:5\n4 2 4 5 6\n10\nexcursion 1 1\nexcursion 1 2\nbridge 1 2\nexcursion 1 2\nbridge 3 4\nbridge 3 5\nexcursion 4 5\nbridge 1 3\nexcursion 2 4\nexcursion 2 5Output:4\nimpossible\nyes\n6\nyes\nyes\n15\nyes\n15\n16Input:6\n1 2 3 4 5 6\n10\nbridge 1 2\nbridge 2 3\nbridge 4 5\nexcursion 1 3\nexcursion 1 5\nbridge 3 4\nexcursion 1 5\npenguins 3 10\nexcursion 1 3\nbridge 1 5Output:yes\nyes\nyes\n6\nimpossible\nyes\n15\n13\nno",
  "sample_input": "Input:5\n4 2 4 5 6\n10\nexcursion 1 1\nexcursion 1 2\nbridge 1 2\nexcursion 1 2\nbridge 3 4\nbridge 3 5\nexcursion 4 5\nbridge 1 3\nexcursion 2 4\nexcursion 2 5Output:4\nimpossible\nyes\n6\nyes\nyes\n15\nyes\n15\n16",
  "sample_output": "Input:6\n1 2 3 4 5 6\n10\nbridge 1 2\nbridge 2 3\nbridge 4 5\nexcursion 1 3\nexcursion 1 5\nbridge 3 4\nexcursion 1 5\npenguins 3 10\nexcursion 1 3\nbridge 1 5Output:yes\nyes\nyes\n6\nimpossible\nyes\n15\n13\nno",
  "link": "https://www.spoj.com/problems/OTOCI",
  "scraped_at": "2025-08-17 00:33:59"
}