{
  "problem_code": "problems",
  "title": "A1 Road",
  "tags": [],
  "text": "Our country needs to be connected by highways that need to be repaired\r\nevery once in a while. A committee chosen by the government of\r\nour country tries to continually improve the condition of the main highway\r\nimaginatively named “A1” by finding the first damage that needs to\r\nbe fixed.Starting with the first damage the highway is divided into\r\nsegments of the same length. A damage fixing team is then being\r\nsent to each segment containing damage. Since there usually are\r\nmuch more damages than teams available, it would be advisable to\r\ndivide the highway into segments of given length in such a way that\r\nthe number of segments containing damages is as small as possible.There are N known damages on the highway, each described by an integer\r\nrepresenting its distance from the beginning of the highway in\r\nmeters. The length of a segment is M meters (an integer).\r\nThere are no damages within the first M meters. The first segment has\r\nto start within the first M meters of the highway. If the first segment\r\nstarts at the Kth meter then Lth segment starts at the (K+(L-1)*M)th\r\nmeter of the highway. A team can fix all damages occurring within\r\none segment starting with the first meter of the segment and ending\r\nwith the last meter of that segment.Write a program that will determine the minimal number of damage fixing\r\nteams needed to fix all damages occurring on the highway “A1” and all\r\npossible beginnings of the first segment.InputThe first line of the input file contains two whole numbers M and\r\nN separated by a space character, 1 ≤ M, N ≤ 100 000, where M is a\r\nlength of a segment and N is a number of damages occurring on the highway.The second line contains N whole numbers separated by a space character\r\nrepresenting the positions of all damages. Each of those numbers is\r\ngreater than M and less than or equal to 2 000 000 000 (two billion).\r\nThe sequence of N numbers given in the second line will always be\r\nstrictly increasing sequence.OutputThe first line of the output file should contain the minimal number\r\nof damage fixing teams.The second line should contain all the positions where the first\r\nsegment can begin. These numbers should be separated by a space character\r\nand they must form a strictly increasing sequence.SampleInput 1:3 5\r\n4 5 7 8 9Output 1:2\r\n1Input 2:4 3\r\n7 14 15Output 2:2\r\n1 2 4Input 3:2 10\r\n3 4 7 8 12 13 14 15 20 21Output 3:7\r\n1 2",
  "sample_input": "Input 1:3 5\r\n4 5 7 8 9Output 1:2\r\n1",
  "sample_output": "Input 2:4 3\r\n7 14 15Output 2:2\r\n1 2 4",
  "link": "https://www.spoj.com/problems/MA1",
  "scraped_at": "2025-08-17 00:33:30"
}