{
  "problem_code": "problems",
  "title": "Ada and Palace Game",
  "tags": [],
  "text": "Ada the Ladybug is celebrating holidays with her good friend Velvet Mite Vinit. They were playing chess all the morning so they have decided to switch games. If you search in your memory (or in SPOJ archive), you'll find out, they invented a new chess-piece:palace. For those, who can't remember the rules of palace (and were not able to find it): The movement of palace is simple - it combines movement ofKingandTower.The game they invented is simple: A fewpalacesare placed onto chessboard. Ada and Vinit alternate in moves. In each move one can choose anypalaceon chessboard and move it toward bottom-left corner. Moving closer means, that theManhattan     distancefrom bottom-left corner will decrease. A player who can't make move will lose. Can you decide the winner?NOTE: Two palaces can share a chess-field (they will just stack them above each other). Also note that as Ada is a lady she goes first!Little Warning: The chessboard was a gift from Ada's good friend Flea Feodorv, who is indeed a great programmer yet not as good chess-player, so the bottom-left corner is not traditional \"a1\" but \"[0,0]\". Also the upper-right corner is not traditional \"h8\" but \"[2999,2999]\".InputThe first line of input will contain1 ≤ T ≤ 3×105, the number of test-cases.The nextTlines will contain1 ≤ N ≤ 3×105, the number of palaces placed on chessboard.Each test-case will containNlines containing two integers:0     ≤ x, y < 3000, the coordinates of palaces.The sum ofNover all test-cases will not exceed3×105OutputFor each test-case output the name of winner, so either \"Ada\" or \"Vinit\".Example Input5\r\n1\r\n3 2\r\n1\r\n3 3\r\n1\r\n6 6\r\n3\r\n7 4\r\n3 7\r\n1 0\r\n5\r\n4 2\r\n6 9\r\n7 8\r\n2 1\r\n5 5Example OutputAda\r\nVinit\r\nVinit\r\nVinit\r\nAda",
  "sample_input": "5\r\n1\r\n3 2\r\n1\r\n3 3\r\n1\r\n6 6\r\n3\r\n7 4\r\n3 7\r\n1 0\r\n5\r\n4 2\r\n6 9\r\n7 8\r\n2 1\r\n5 5",
  "sample_output": "Ada\r\nVinit\r\nVinit\r\nVinit\r\nAda",
  "link": "https://www.spoj.com/problems/ADAGAME5",
  "scraped_at": "2025-08-17 00:33:29"
}