{
  "problem_code": "problems",
  "title": "Ada and Christmas",
  "tags": [],
  "text": "Ada the Ladybug was recently unwrapping presents and guess what? She got a new chessboard from her good friend Flea Feodorv. As he thought \"the bigger chessboard the better the chess game will be\", he gave Ada a chessboard even bigger than last time: Now the upper-right corner is [999999999, 999999999] (109-1).As you might guess, she can't play classical (nor rapid) chess on such board. But as she doesn't want to throw such valuable (well.. at least big) gift away, she's decided to playPalace Gameagain. She invited her friend Velvet Mite Vinit. As they played this game recently, they decided to expand the rules a little bit. They have decided to play this game with five most important chess-pieces:Rook,Bishop,King,Knightand obviously, thePalace.The game rules are simple: A fewchess-piecesare placed onto chessboard. Ada and Vinit alternate in moves. In each move one can choose anypieceon chessboard and move it toward bottom-left corner. Moving toward means, that theManhattan     distancefrom bottom-left corner will decrease and also that none of the coordinates of chess-piece will increase. A player who can't make a move will lose. Can you tell who'll be the winner if both of them play optimally? As Ada is a lady, she goes first.NOTE: Rules areslightlydifferent than in original Palace Game (even though it wouldn't affect the original game, this game might yield slightly different results).InputThe first line of input will contain1 ≤ T ≤ 3×105, the number of test-cases.The nextTlines will contain1 ≤ N ≤ 3×105, the number of chess pieces placed on chessboard.Each test-case will containNlines containing two integers and a character:0     ≤ x, y < 109, the coordinates of chess-piece andc ∈{T, B, K, N, P} (stands for rook(T),Bishop,King, kNight andPalace).The sum ofNover all test-cases will not exceed3×105OutputFor each test-case output the name of winner, so either \"Ada\" or \"Vinit\".Example Input10\r\n2\r\n7 0 B\r\n3 4 T\r\n2\r\n6 7 K\r\n9 1 B\r\n3\r\n8 7 B\r\n9 4 K\r\n4 4 T\r\n2\r\n8 5 T\r\n6 5 K\r\n3\r\n1 2 P\r\n6 1 B\r\n4 4 P\r\n2\r\n1 2 B\r\n0 9 K\r\n1\r\n1 9 K\r\n3\r\n5 0 K\r\n0 4 B\r\n9 1 K\r\n3\r\n0 4 K\r\n0 5 K\r\n3 2 K\r\n3\r\n6 4 N\r\n1 2 N\r\n0 7 NExample OutputAda\r\nVinit\r\nAda\r\nAda\r\nAda\r\nVinit\r\nAda\r\nAda\r\nVinit\r\nVinit",
  "sample_input": "10\r\n2\r\n7 0 B\r\n3 4 T\r\n2\r\n6 7 K\r\n9 1 B\r\n3\r\n8 7 B\r\n9 4 K\r\n4 4 T\r\n2\r\n8 5 T\r\n6 5 K\r\n3\r\n1 2 P\r\n6 1 B\r\n4 4 P\r\n2\r\n1 2 B\r\n0 9 K\r\n1\r\n1 9 K\r\n3\r\n5 0 K\r\n0 4 B\r\n9 1 K\r\n3\r\n0 4 K\r\n0 5 K\r\n3 2 K\r\n3\r\n6 4 N\r\n1 2 N\r\n0 7 N",
  "sample_output": "Ada\r\nVinit\r\nAda\r\nAda\r\nAda\r\nVinit\r\nAda\r\nAda\r\nVinit\r\nVinit",
  "link": "https://www.spoj.com/problems/ADAXMAS",
  "scraped_at": "2025-08-17 00:33:31"
}