{
  "problem_code": "problems",
  "title": "Prime Pesticide",
  "tags": [],
  "text": "NSlovakistan farmers own neighbouring fields alongside a river, forming a straight line. Each field is infested with (possibly zero) pests.Thanks to ingenious Slovakistan science, each species of pest can be assigned a prime number. Each field can then be assigned a positive number, representative of the pests that are infesting it - the prime factorization of this number indicates which pests are present, with the powers of each prime number representing how strongly the field is infested with that pest. The resulting number indicates how much damage is done to the crops on that field.To help the farmers, the government is planning to spray pesticide on some contiguous segment of fields. Due to environmental concerns, the pesticide can only be effective against a single species of pest. However, what segment of fields to spray and with what pesticide has given rise to a huge debate in the parliament - there simply isn't enough data to decide. GivenQproposalsL R p, meaning that pesticide against the pest assigned prime numberpcould be sprayed on fieldsLthroughR, find out how much damage to crops it would prevent.InputThe first line of input contains two integersNandQ(1 ≤ N,Q ≤ 500,000): the number of fields and the number of proposals.The second line containsNnumbersf1, ... , fN-the numbers assigned to the fields. They will be positive and not greater than106.Qlines follow, each containing three numbersL R p(1  ≤ L ≤ R ≤ N, 1 ≤ p≤ 106,pis a prime number), meaning that the government proposes to spray pesticide against pestpon fields [L,R]OutputFor each proposalL R p, output how much crop damage is mitigated; that is, output  (fL+ ... + fR-f'L- ... - f'R), wheref'iisfiafter all factors ofphave been removed from it.ExampleInput:5 5\r\n10 20 30 40 50\r\n1 1 2\r\n1 5 5\r\n1 5 47\r\n2 4 3\r\n2 4 2Output:5\r\n128\r\n0\r\n20\r\n65In the fourth proposal, the result is (20 + 30 + 40 - 20 - 10 - 40) = 20.",
  "sample_input": "Input:5 5\r\n10 20 30 40 50\r\n1 1 2\r\n1 5 5\r\n1 5 47\r\n2 4 3\r\n2 4 2Output:5\r\n128\r\n0\r\n20\r\n65",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PRIMEP",
  "scraped_at": "2025-08-17 00:33:40"
}