{
  "problem_code": "problems",
  "title": "Game Store",
  "tags": [],
  "text": "This day is a very special day, especially for all gamers around the world. The clock now is showing at 8 am and the queue in front of the game store is getting crazy. It is like a hundred of people standing in a line waiting for something big. Then what is that ? Yes, of course the people are going to buy the very new game, just released yesterday. It is the first first-person shooting (FPS) game with very incredible price. Brembo, one of the skillfull FPS gamers, of course he doesn't want to miss this. He also buys the game and then plays the game.After one hour playing the games, Brembo feels that the game is very difficult, but sometimes is very easy. He doesn't feel good about that, and decided to replay the game from the beginning. However, now he wants to play the game in more balanced ways. He first plays the easy-difficulty levels and then go harder until the he reaches the hardest-difficulty level. Poor Brembo, he finds out that the levels are placed randomly and gets confused on choosing the levels.You as his friends, called by Brembo to help him out. There are N levels in the game. Basically, in every level you are given the information about some specific elements. You will notice the bar under the map's levels that contain the information. First, is the number of Health Pack that will be placed in a level. Second, is the number of enemies in a level. And third, is the number of ammo available in a level. A level is said to be easier than another level if it follows these priority, it has more Health Pack, less enemies, and more ammo.Now, you are about to analyze the situation based on the description above. Given the information of N levels, find the easiest and the hardest level based on the information. Since you are Brembo's best friend, you don't want to make him disappointed and you will help him.InputThe first line of input is N, the number of levels in the game. (1 <= N <= 100)The next N lines contain three integers separated by space Hi, Ei, Ai, represent the number of Health Pack, enemies, and ammo for i-th level. ( 1 <= Hi,Ei,Ai <= 10000)It is guaranteed that every level has different information.OutputThe output contain two lines or one line if there is only one level.First line : \"Easiest is level a\" (a for the level number)Second Line : \"Hardest is level b\" (b for the level number)Print them without quotes.Example 1Input:4\r\n3 2 3\r\n3 4 1\r\n1 4 5\r\n2 2 2Output:Easiest is level 1\r\nHardest is level 3Example 2Input:1\r\n2 3 1Output:Easiest and Hardest is level 1",
  "sample_input": "Input:4\r\n3 2 3\r\n3 4 1\r\n1 4 5\r\n2 2 2Output:Easiest is level 1\r\nHardest is level 3",
  "sample_output": "Input:1\r\n2 3 1Output:Easiest and Hardest is level 1",
  "link": "https://www.spoj.com/problems/GMSTRE",
  "scraped_at": "2025-08-17 00:33:38"
}