{
  "problem_code": "problems",
  "title": "Tower of Hanoi Movement",
  "tags": [],
  "text": "The easier version of this problem can be foundhereThe Tower of Hanoi (also called the Tower of Brahma or Lucas' Tower and sometimes pluralized) is a mathematical game or puzzle. It consists of three rods and a number of disks of different sizes, which can slide onto any rod. The puzzle starts with the disks in a neat stack in ascending order of size on one rod, the smallest at the top, thus making a conical shape.The objective of the puzzle is to move the entire stack to another rod, obeying the following simple rules:Only one disk can be moved at a time.Each move consists of taking the upper disk from one of the stacks and placing it on top of another stack.No disk may be placed on top of a smaller disk.With 3 disks, the puzzle can be solved in 7 moves. The minimal number of moves required to solve a Tower of Hanoi puzzle is 2N− 1, where n is the number of disks.The description is retrieved from WikipediaFrom the description above, AVM wants to know theathstep of optimal solution. The set of Tower of Hanoi consists ofNdisks and 3 rods (A as the source rod, B as the spare rod, and C as the target rod).InputThe input file consists of several lines.\r\nThe first line contains a single numberTrepresenting the number of test cases.\r\nThe nextTlines containsNandarepresenting the number of disk and theathmove.OutputThe output file should containsTlines.\r\nThei-th line should containP : A => C, thePthdisk, the rod ofPthdisk before the movement, and the rod ofPthdisk after the movement.Constraint1 <=T<= 10001 <=N<= 501 <=a<= 2N- 1ExampleInput:3\r\n2 3\r\n3 5\r\n3 7Output:1 : B => C\r\n1 : B => A\r\n1 : A => CExplanationThe 2-disks Tower of Hanoi optimal solution is:1 : A => B\r\n2 : A => C\r\n1 : B => CTherefore, the first test case answer is1 : B => CThe 3-disks Tower of Hanoi optimal solution is:1 : A => C\r\n2 : A => B\r\n1 : C => B\r\n3 : A => C\r\n1 : B => A\r\n2 : B => C\r\n1 : A => CTherefore, the second test case answer is1 : B => Aand the last test case answer is1 : A => C",
  "sample_input": "Input:3\r\n2 3\r\n3 5\r\n3 7Output:1 : B => C\r\n1 : B => A\r\n1 : A => C",
  "sample_output": "1 : A => B\r\n2 : A => C\r\n1 : B => C",
  "link": "https://www.spoj.com/problems/TOHMOVE2",
  "scraped_at": "2025-08-17 00:33:25"
}