{
  "problem_code": "problems",
  "title": "Incomplete hierarchy",
  "tags": [],
  "text": "After many years of art, young Florian wants to work in a conglomerate. This company consists of N employees denoted 1, 2 ... N, of which some areinterns. Florian knows all interns in this company. In the hierarchy, every employee has a single boss, except for one employee (the CEO) who does not have a boss. There is no cycle within the hierarchy; in other words, the hierarchy is a tree. Also,anintern cannot be superior to a non-intern.Speaking to interns, Florian has collected a wealth of information aboutpartsof the hierarchy. Namely, for every intern he knows who his/her boss is (this boss could also be an intern).Florian now counts the distance of two interns in the hierarchy, which is the number of bosses between these interns. More precisely, thedistance in the hierarchybetween two employees is obtained by climbing the hierarchy starting with them, and counting all their direct or indirect superiors up to their first common superior (including him). If one of the observed two employees is superior to another (directly or indirectly), we only count the employees who are strictly between them in the hierarchy.Help young Florian determine thelargest distance of two internsacross the hierarchy, if this number can be uniquely determined from the known data.InputThe first line contains two integers N and M, the total number of employees in the company and the number of interns (2 ≤ M < N ≤ 100 000).Each of the following M lines contains two integers A and B, intern and his boss (1 ≤ A, B ≤ N, A ≠ B). No intern will have two bosses.OutputPrint the required largest intern distance, or -1 if the answer cannot be determined.ExamplesInput:5 4\r\n2 1\r\n3 2\r\n4 3\r\n5 4Output:2Input:7 4\r\n1 2\r\n2 3\r\n4 5\r\n5 6Output:-1Input:3 2\r\n2 1\r\n3 1Output:1",
  "sample_input": "Input:5 4\r\n2 1\r\n3 2\r\n4 3\r\n5 4Output:2",
  "sample_output": "Input:7 4\r\n1 2\r\n2 3\r\n4 5\r\n5 6Output:-1",
  "link": "https://www.spoj.com/problems/PODUZECE",
  "scraped_at": "2025-08-17 00:33:41"
}