{
  "problem_code": "problems",
  "title": "Spaceships in Space",
  "tags": [],
  "text": "Aliens attack! Run for your lives!... or not, it's only a video game. And even then, although alien spaceships are flying straight for the Earth, it's not terribly important to destroy them all. Gregory the Gamer only wants that sweet high score.To be more precise, there arenenemy spaceships, flying in a row. Every spaceship is of one of three colours. Our own spaceship is flying opposite of those, from left to right, and can destroy any of them. Destroying a spaceship of colour i is worth pipoints. If you destroy more than one spaceship of the same color in a row, you get more points - second spaceship in sequence is worth \r\n2pipoints, for the third one you get 3piand so on. The maximum number of points you can get for one spaceship is limited byM- if the previous rule dictates more than that, you get exactlyMpoints instead.What is the highest score Gregory can get?InputThe first line contains a single integert, denoting number of test cases. Thenttest cases follow.The first line of a test case contains two integersn,M- number of spaceships and points limit for one spaceship (1 ≤n≤ 105, 1 ≤M≤ 100).In the next line there are three integers 1 ≤pA,pB,pC≤M- point values for destroying spaceships of different colours.In the last line there is a string of lengthn- description of subsequent spaceships. Every character is one of the following: A, B, C. Different characters correspond to different colours.OutputFor every test case you should output one integer - highest score you can get.ExampleInput:2\r\n7 5\r\n1 1 5\r\nAAACAAA\r\n6 10\r\n1 1 10\r\nABABABOutput:20\r\n7ExplanationIn the first test case we destroy all six spaceships of colour A, and we get 1+2+3+4+5+5 = 20 points. If we destroyed all of them instead, we'd get (1+2+3)+5+(1+2+3) = 17 points.In the second test case we can first destroy all spaceships of colour A, and then the last spaceship of colour B, which will give us (1+2+3)+1 = 7.",
  "sample_input": "Input:2\r\n7 5\r\n1 1 5\r\nAAACAAA\r\n6 10\r\n1 1 10\r\nABABABOutput:20\r\n7",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SPA",
  "scraped_at": "2025-08-17 00:33:45"
}