{
  "problem_code": "problems",
  "title": "Galactic Division",
  "tags": [],
  "text": "The scientists of UEA (Universal  Environment Association) are currently researching the outer space, they found out that a plane in the space had some interesting properties on a set of planes based on itsbalance factor. Thebalance factoris equal to the absolute value of the differente between the sum of distances of the planets which are on one side of the plane and the sum of the distances of the planets which are on the other side, the distance of a planet to the plane is calculated as the distance from the center of the planet to the plane.The scientists are marveled with the results they found when thebalance factorof a plane is minimal, but as they are manually calculating thebalance factor, when the set of planets become larger, they find it harder to calculate. So they hired you to build a program that given a set ofNplanets and a 3D vector(vx, vy,vz)returns the coefficients of the general equation of the plane that has minimalbalance factorand is normal to the vector given.InputThe input contains several test cases. The first line of a test case contains an integerN(1 ≤N≤ 106), indicating the number of planets. The second line contains three integers which are the componentsvx, vyevzof the vector (-103≤vx,vy,vz≤ 103). Each of the followingNlines contains three integersX,YandZ(−104≤X,Y,Z≤ 104), representing the position (X,Y,Z) of the center of a planet. There won't be a vector which components arevx = vy=vz= 0.OutputFor each test case in the input your program must produce a single line containing four integer which are the coefficientsa,b,canddof the general plane equation (ax+by+cz=d). As there may be several planes that meet the specifications, print the  coefficients which absolute values are the smallest possible anda,bandchave the same sign asvx, vyandvz, respectively.ExampleInput:11 2 30 0 020 1 00 0 02 2 2Output:1 2 3 00 1 0 1",
  "sample_input": "Input:11 2 30 0 020 1 00 0 02 2 2Output:1 2 3 00 1 0 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GALACDIV",
  "scraped_at": "2025-08-17 00:33:46"
}