{
  "problem_code": "problems",
  "title": "NARUTO AND HILLS",
  "tags": [],
  "text": "There arenhills in Konohagakure, the Hidden Village of the Land of Fire.Naruto is standing on the peak of 1sthill and wants to see the peak of the nthhill. He can see the peak of hills ahead of him which have a height smaller than or equal to the one he is standing on, up to the next strictly taller hill. Naruto has the ability to jump from one hill to another. He can also use his chakra to cut a hill and reduce its height.You are given two arraysAandH. ArrayHrepresents the height of hills.The energy used in jumping from ithhill to jthhill is2 timesthe absolute difference ofA[i]andA[j].If Naruto is standing on ithhill, he can cut any hill from (i+1)thto nthwhich has a height greater than ithhill. He can only reduce the height of a hill up to the height of ithhill. The energy used in cutting jth(i < j ≤ n) hill the absolute difference ofH[i]andH[j].You have to tell the minimum energy which will be used in order for Naruto to see the nthhill.Note:Naruto can’t jump on the nthhill nor can he cut the nthhill.Constraints1 ≤ t ≤ 202 ≤ n ≤ 1051 ≤ A[i] ≤ 1000001 ≤ H[i] ≤ 100000InputThe first line of the input contains a single integertdenoting the number of test cases. The description ofttest cases follows.The first line of each test case contains a single integerndenoting the number of hills.The second line contains n space-separated integersA1, A2, A3... An.The third line contain n space-separated integersH1, H2, H3... Hnrepresenting the height of ithhill.OutputYour program should print one line of output for each test case.Output minimum energy which will be used in order for Naruto to see the nthhill. If it is not possible for Naruto to see the peak of nthhill then output -1.ExampleInput:3\r\n5\r\n1 7 6 12 8\r\n2 9 4 3 1\r\n7\r\n3 8 6 7 19 18 9\r\n1 3 5 2 10 4 5\r\n6\r\n2 7 4 5 9 3\r\n1 2 3 4 5 6Output:10\r\n11\r\n-1Explanation:Test case 1: Naruto can jump to 3rdhill from where he can see the peak of 5thhill. Energy= 2 * |1-6| = 10.ORNaruto can cut 2nd, 3rd, and 4thhill without jumping anywhere. Energy = |2-9| + |2-4| + |2-3| = 10.Test case 3: Naruto cannot see the peak of 6thhill whatever he may do.",
  "sample_input": "Input:3\r\n5\r\n1 7 6 12 8\r\n2 9 4 3 1\r\n7\r\n3 8 6 7 19 18 9\r\n1 3 5 2 10 4 5\r\n6\r\n2 7 4 5 9 3\r\n1 2 3 4 5 6Output:10\r\n11\r\n-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NARHIL",
  "scraped_at": "2025-08-17 00:33:38"
}