{
  "problem_code": "problems",
  "title": "Seven",
  "tags": [],
  "text": "David Mills and William Somerset have teamed up again to catch a criminal. This criminal is a bit different from others, he challenges the detectives by leaving a puzzle at the crime scene which is the clue to his next crime. Both the detectives work hard to crack the puzzle, but the criminal is always one step ahead. For his 7thand last crime, he left a problem for the detectives. David wants your help for this one to catch the criminal.The criminal gave you a tree havingnnodes with1as the root. Each node is numbered from 1 to n. Every node has a value represented by the arrayA.You are given another arrayB.You have to convert the node values from A to B by performing the minimum number of operations. In one operation you can select any nodeiand add or subtract any value. And the same value will get added to or subtracted from the special node in the subtree of the nodei.Special nodeqin the subtree ofpis defined as node such that:(Number of set bits in p) mod 2 = (Number of set bits in q) mod 2You have to tell the minimum operations to convert node values from A to B and the sum of values added or subtracted in these operations.Constraints1 ≤ t ≤ 111 ≤ n ≤ 1000001 ≤ A[i] ≤ 1000001 ≤ B[i] ≤ 100000InputThe first line of the input contains a single integertdenoting the number of test cases. The description ofttest cases follows.The first line of each test case contains a single integerndenoting the number of nodes.Each of the next  n - 1 lines contains two integersuiandvi(1 ≤ui,vi≤n;ui≠vi) meaning there is an edge between nodesuiandvi.Next line has n space-separated integersA1, A2, A3, ... Andenoting the initial value of nodes.Next line has n space-separated integersB1, B2, B3, ... Bndenoting the final values of nodes.OutputOutput the minimum number of operations required and the sum of values added or subtracted in these operations.ExampleInput:1\r\n8\r\n1 3\r\n3 2\r\n3 7\r\n6 2\r\n4 1\r\n8 4\r\n4 5\r\n9 3 5 6 2 3 8 10\r\n9 3 3 5 2 1 8 10Output:3 -2ExplanationYou can select node 3 with value 5 and subtract 2, it will also get subtracted from the special node 6 in its subtree.Values after 1stoperation: 9 3 3 6 2 1 8 10Now select node 4 with value 6 and subtract 1, it will also get subtracted from the special node 8 in its subtree.Values after 2ndoperation: 9 3 3 5 2 1 8 9Now select node 8 and add 1. There is no special node in its subtree.Values after 3rdoperation: 9 3 3 5 2 1 8 10Sum of values added/subtracted = -2-1+1 = -2",
  "sample_input": "Input:1\r\n8\r\n1 3\r\n3 2\r\n3 7\r\n6 2\r\n4 1\r\n8 4\r\n4 5\r\n9 3 5 6 2 3 8 10\r\n9 3 3 5 2 1 8 10Output:3 -2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SE7EN",
  "scraped_at": "2025-08-17 00:33:35"
}