{
  "problem_code": "problems",
  "title": "Help Robin!!",
  "tags": [],
  "text": "Ra's al Ghul has attacked Gotham city and wants to kill Batman.Now you, being Robin, want to help Batman by killing Ra's al Ghul and his army.Ra's al Ghul has army of soldiers commanded by certain chiefs amongst them. The soldiers are motivated by them and are geared up to follow their instructions on one say.You have to identify chief soldiers and use them to misdirect maximum number of soldiers. This will reduce the chance of Ra's al Ghul to kill Batman.Chief soldiers are those who are followed by the maximum number of soldiers.Once, identified you can play trick (magic) on them and misdirect soldiers following them.You are given two integers N (denoting number of soldiers) and M (number of relation between 'N' soldiers).Further, M lines contains two integers l1 and l2 meaning soldier l1 follows soldier l2.Constraints1 ≤ T ≤ 1001 ≤ N ≤ 99991 ≤ M ≤ 1000001 ≤ l1, l2 ≤ NInputThe first line of the input contains a single integer T denoting number of test cases. Description of each test case are as follows:First line contain integers N (denoting the number of soldiers) and M (number of pairs).Further, M lines contains two integers l1 and l2, meaning soldier l1 follows soldier l2.OutputPrint the chief soldiers in ascending order.ExampleInput:1\r\n5 4\r\n1 5\r\n1 2\r\n3 1\r\n4 1Output:2 5Explanation:1st soldier follows 5th soldier1st soldier follows 2nd soldier3rd soldier follows 1st soldier4th soldier follows 1st soldierNumber of soldiers following 4 = 0Number of soldiers following 3 = 0Number of soldiers following 1 = 2 (4th and 3rd soldiers)Number of soldiers following 2 = 3 (4th, 3rd and 1st soldiers)Number of soldiers following 5 = 3 (4th, 3rd and 1st soldiers)Answer is soldiers 2 and 5.Contributed by: Paras Jain",
  "sample_input": "Input:1\r\n5 4\r\n1 5\r\n1 2\r\n3 1\r\n4 1Output:2 5",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CHUNK1",
  "scraped_at": "2025-08-17 00:33:30"
}