{
  "problem_code": "problems",
  "title": "Playing With Subarray",
  "tags": [],
  "text": "Alice loves to play with array of integers. He has an array A[ ] of integers. Bob, friend of Alice is a smart guy. Seeing Alice’s curiousness about array Bob decided to give Alice a task. Before giving the task Bob ask Alice if he knows about K_min_subarray? A K_min_subarray is the minimum value of a K length subarray of array A[ ]. After Bob knows about K_min_subarray, Alice gives Bob Q queries about array A[ ]. In each query she will give two integers L, R. Alice have to answer the largest value of all possible K_min_subarray in between L to R. Here each subarray’s starting position must be ≥ L, ending position must be ≤ R and the length of the subarray must be K.InputIn the first line given t, the number of test cases.For each test case there will be the following:In the first line given two integers n (size of the array) and K (length of the subarray).In the second line given the elements (A[i]) of the array.In the next line given an integer Q (the number of queries).In the next Q lines are given two integers L, R.Constraints1 ≤ t ≤ 101 ≤ n ≤ 1051 ≤ K ≤ n-1018≤ A[i] ≤ 10181 ≤ Q ≤ 1051 ≤ L ≤ R ≤ nt × max(n, Q) ≤ 105Here all positions are 1 based.OutputFor each test case you have to print the test case number in one line in the format “Case x:” without quote, where x is the case number.For each query output the largest value of all possible K_min_subarray in between L to R in each line. If answer is not possible print “Impossible” without quote.For better understanding see the sample input output and the explanation of sample.ExampleInput:2\r\n7 3\r\n10 5 15 -5 3 11 2\r\n4\r\n1 4\r\n2 3\r\n3 6\r\n5 7\r\n5 1\r\n1 2 3 4 5\r\n3\r\n1 3\r\n2 5\r\n4 4Output:Case 1:\r\n5\r\nImpossible\r\n-5\r\n2\r\nCase 2:\r\n3\r\n5\r\n4ExplanationTest Case 1:Query 1:Here 2 subarray possible of length 3 between positions 1 to 4: {10, 5, 15}, {5, 15, -5}.Minimum value in {10, 5, 15} is 5 Minimum value in {5, 15, -5} is -5 Maximum of 5 and -5 is 5.So answer is 5.Query 2:Here no subarray is possible of length 3 between positions 2 to 3.So you have to print “Impossible”.Query 3:Here 2 subarray possible of length 3 between positions 3 and 6: {15, -5, 3}, {-5, 3, 11}.Minimum value in {15, -5, 3} is -5 Minimum value in {-5, 3, 11} is -5 Maximum of -5 and -5 is -5.So the answer is -5.This problem originally contributed byMd. Mozahidul Islam (kissu_pari_na), ICT, CoU",
  "sample_input": "Input:2\r\n7 3\r\n10 5 15 -5 3 11 2\r\n4\r\n1 4\r\n2 3\r\n3 6\r\n5 7\r\n5 1\r\n1 2 3 4 5\r\n3\r\n1 3\r\n2 5\r\n4 4Output:Case 1:\r\n5\r\nImpossible\r\n-5\r\n2\r\nCase 2:\r\n3\r\n5\r\n4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MOZPWS",
  "scraped_at": "2025-08-17 00:33:47"
}