{
  "problem_code": "problems",
  "title": "Minimum Stocks",
  "tags": [],
  "text": "Himanshu wants to invest into stock market and his friend Navneet helps him by providing him instruction for nextNdays.Navneet gives Himanshu 3 types of instruction,1XYThere is a stock X available at price Y. Here X is a string and Y is an integer.2XZThe price of stock X has changed to Z. Here X is a string and Z is an integer.3 BUYBuy the stock which has the lowest price.You as a programmer, are given all the instructions ofNdays. Can you tell,which stock did Himanshu buy on which day. Print the output in same order as Himanshu bought the stock. See sample input and output for clarification.At any point of time, there isatmost one stock ofX. However,Xcan be made available to market again through another instruction of type 1.All instructions are valid.i.e. There is always some stock to buy having the minimum price of all. Also if the price ofXhas changed, thenXis already known and hasn't been bought yet.InputFirst line containsN. (1 ≤N≤ 106)NextNlines, each of them contains an instruction of any of 3 types. (Look at instruction format above.)In any instruction, (X is a string of length upto 10 characters. All characters are from English alphabet, both small and capital), and (0 ≤Y≤ 109) and (0 ≤Z≤ 109).OutputFor each instruction of type 3, output two valuesXandY. WhereXis the name of Stock having minimum price andYis the day on which it was bought.ExampleInput:7\r\n1 ABC 32\r\n1 XDC 54\r\n3 BUY\r\n1 XCD 32\r\n1 ABC 12\r\n2 XDC 10\r\n3 BUYOutput:ABC 3\r\nXDC 7ExplanationOn day 3, there is instruction to buy. There are two stocks available \"XDC\" and \"ABC\", since price of \"ABC\" is less, he buys it. After this \"ABC\" is not available in market anymore.On day 7, there is instruction to buy. Of all stocks available, \"XDC\" has the least price and hence he buys \"XDC\".",
  "sample_input": "Input:7\r\n1 ABC 32\r\n1 XDC 54\r\n3 BUY\r\n1 XCD 32\r\n1 ABC 12\r\n2 XDC 10\r\n3 BUYOutput:ABC 3\r\nXDC 7",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MINSTOCK",
  "scraped_at": "2025-08-17 00:33:27"
}