{
  "problem_code": "problems",
  "title": "Gas Wars",
  "tags": [],
  "text": "As the result of the gas wars the following agreement was made. The transit of the gas was allowed under the following conditions. There arentransit nodes andmpipes connecting those nodes. Thereknodes where the gas enters andlnodes where it should be moved. Each pipe has a carrying capacity ofcicubic meters of gas per day. Gas can go through the pipes in either direction. It is needed to movegcubic meters of gas in total through the pipeline every day. The cost of the transit is defined asmaxC*100 thousand dollars, wheremaxC– maximum of carrying capacities of the used in the transit pipes (even those which are not fully used). You are to find the minimum possible cost of transit for the given pipeline.InputThe first line of the input file containst– the amount of test cases. The description of each test case follows. The first line of each test case contains five integers separated by spaces –n,m,k,l,g. Thenmlines containing three integersa,b,cfollow. Each lines means that nodes with numbersaandbare connected by the pipe with the carrying capacity ofc. Next line containskintegers – the numbers of nodes where the gas should enter the pipeline. The last line of the test case containslintegers – the numbers of nodes where the gas should be moved. The gas can enter the pipeline in any of thekentrance nodes and can be moved to any of thelexit nodes. The nodes are numbered from 1 ton.Constraints1 <=t<= 202 <=n<= 1001 <=m<=n*(n-1)/21 <=k,l<=n/21 <=g,c<= 1000000OutputFor each test case output a single integer on a separate line – the minimum cost of transit in thousands of dollars. If the transit of the needed volume is impossible, then output -1.ExampleInput:1\r\n6 8 1 1 1\r\n1 2 1\r\n1 3 2\r\n2 4 3\r\n2 5 3\r\n3 4 4\r\n3 5 2\r\n4 6 4\r\n5 6 1\r\n1\r\n6Output:200",
  "sample_input": "Input:1\r\n6 8 1 1 1\r\n1 2 1\r\n1 3 2\r\n2 4 3\r\n2 5 3\r\n3 4 4\r\n3 5 2\r\n4 6 4\r\n5 6 1\r\n1\r\n6Output:200",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GASWARS",
  "scraped_at": "2025-08-17 00:33:38"
}