{
  "problem_code": "problems",
  "title": "Yet Another Subset Sum Problem",
  "tags": [],
  "text": "You are given aN × Ngrid, where each cell in the grid is either blocked or free. You can place any number between1toNin the free cells. You are required to assign numbers to the free cells. No free cells should be left empty after the assignment, i.e. each free cell must contain exactly one number from the range[1-N].You are also given a target valueV. Find out how many ways we can assign numbers to the free cells such that their sum equalsV. It is also required to satisfy the following constraints:For any row, all the numbers present in that row should be distinct.For any column, all the numbers present in that column should be distinct.Two ways are considered different ifanyparticular cell has different values assigned.LetMdenote the total number of free cells. It is guaranteed that there will be at least1and no more than12free cells.InputThe first line contains an integerT, denoting the number of test cases. The next line contains two integers,NandV. The nextNlines contains the grid, each line contains the corresponding row of the grid.Cells marked with a'.'indicates free cells, and cells marked as'X'denotes blocked cells. Each cell can be either blocked or free so the grid will not contain any other extra characters.Constraints1 < T ≤ 1201 < N ≤ 121 < V ≤ 1441 < M ≤ 12For60%of the test cases, the following constraints will hold:1 < N ≤ 81 < M ≤ 8OutputFor each test case, output the case number followed by the number of ways to create the assignment. Please check the sample input/output for more clarity.ExampleInput:5\r\n1 1\r\n.\r\n2 2\r\n.X\r\n.X\r\n2 3\r\n.X\r\nX.\r\n3 7\r\n.X.\r\nX.X\r\nXX.\r\n5 15\r\nXX.XX\r\nXX.XX\r\n.XXX.\r\nXX.XX\r\nXX.XXOutput:Case 1: 1\r\nCase 2: 0\r\nCase 3: 2\r\nCase 4: 9\r\nCase 5: 192",
  "sample_input": "Input:5\r\n1 1\r\n.\r\n2 2\r\n.X\r\n.X\r\n2 3\r\n.X\r\nX.\r\n3 7\r\n.X.\r\nX.X\r\nXX.\r\n5 15\r\nXX.XX\r\nXX.XX\r\n.XXX.\r\nXX.XX\r\nXX.XXOutput:Case 1: 1\r\nCase 2: 0\r\nCase 3: 2\r\nCase 4: 9\r\nCase 5: 192",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SUBSUMP",
  "scraped_at": "2025-08-17 00:33:24"
}