{
  "problem_code": "problems",
  "title": "Strategy game",
  "tags": [],
  "text": "Julia and Robert are playing a game, in which they pick up sticks from heaps. The game starts withnheaps, thei-th heap containsa[i] sticks. In each turn the players choose a heap and take away 2, 3 or 5 sticks from it (removed sticks do not return to the game). Julia starts the game making the first move. The one, who cannot make a move, loses the game, and the other player wins.   Can you decide who will win the game, assuming that both players follow a perfect strategy ? If Julia is the winner, point out her winning move! If there are several possibilities for such a move, then choose the one in which the largest number of sticks is taken away. If there are still several such moves, choose the one, in which sticks are taken from the heap of the smallest number.InputAn integerT, denoting the number of test cases (T≤ 1000).  Each test case contains one integern, the number of heaps, followed bynnon-negative integers:a[1],a[2] ...a[n], wherea[i] is the number of sticks of thei-th heap.Constraints:1 ≤n≤ 1000,0 ≤a[i] ≤ 1000000000.OutputPlease consult the example below for a specification of the required output format. Print a blank line after each test case.ExampleInput:5\r\n1\r\n5\r\n1\r\n7\r\n4\r\n1 2 3 4\r\n10\r\n1 2 3 4 5 6 7 8 9 10\r\n2\r\n1000000 1000001Output:Julia wins.\r\nTake 5 sticks from heap number 1.\r\n\r\nRobert wins.\r\n\r\nJulia wins.\r\nTake 3 sticks from heap number 4.\r\n\r\nJulia wins.\r\nTake 5 sticks from heap number 6.\r\n\r\nJulia wins.\r\nTake 5 sticks from heap number 1.",
  "sample_input": "Input:5\r\n1\r\n5\r\n1\r\n7\r\n4\r\n1 2 3 4\r\n10\r\n1 2 3 4 5 6 7 8 9 10\r\n2\r\n1000000 1000001Output:Julia wins.\r\nTake 5 sticks from heap number 1.\r\n\r\nRobert wins.\r\n\r\nJulia wins.\r\nTake 3 sticks from heap number 4.\r\n\r\nJulia wins.\r\nTake 5 sticks from heap number 6.\r\n\r\nJulia wins.\r\nTake 5 sticks from heap number 1.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HS09GAME",
  "scraped_at": "2025-08-17 00:33:35"
}