{
  "problem_code": "problems",
  "title": "Gremlins",
  "tags": [],
  "text": "Gremlins are small funny furry creatures. Once they were considered to be evil but that time has past and most gremlins live a decent family life now. There are N distinct types of gremlins.Their origin is rather mysterious. Legend says that T years ago, N gremlins, one of each type, were born in a lab accident.Their reproduction method is, however, well studied. No mating ritual is required for gremlins to multiply. All they need is a few drops of water and the magic happens.Once atype igremlin starts its reproduction process, Kismall furry balls are created. For each furry ball we know what is the type of gremlin that will hatch from the furry ball and how long will it take for that to happen. Unfortunately, the original gremlin dies in the process. Atype igremlin will start its reproduction process exactly Yiyears after it isborn(ie. hatched from the furry ball).Knowledge about the ancestors of a gremlin is passed on genetically, so each gremlin knows a list of his ancestors as soon as it is born.Write a program that will find the length of the longest list of ancestors among all gremlins that ever lived (gremlins that still live are included, but unhatched furry balls are not), given the information about reproduction process and time elapsed since the lab accident that created initial gremlins, assumingall gremlins that were supposed to hatch this year have already hatched.InputThe first line contains two integers N and T (1 ≤ N ≤ 100, 1 ≤ T ≤ 1015), the number of gremlin types and the number of year that has passed since the lab accident.The next 3·N lines give reproduction details for each gremlin type.The first line of i-th block contains two integers Kiand Yi(1 ≤ Yi≤ 1000, 1 ≤ Ki≤ 1000).The second line contains Kiintegers representing gremlin type for each furry ball.The third line contain Kiintegers between 1 and 1000 representing hatching time for each furry ball, in years.OutputOutput the length of the longest list of ancestors among all gremlins that ever lived in a single line.ExamplesInput:1 42\r\n1 10\r\n1\r\n5Output:2Input:2 42\r\n1 10\r\n1\r\n5\r\n1 5\r\n1\r\n5Output:3Input:3 8\r\n4 5\r\n1 2 3 2\r\n1 2 1 3\r\n1 1\r\n3\r\n1\r\n2 1\r\n1 2\r\n2 1Output:4",
  "sample_input": "Input:1 42\r\n1 10\r\n1\r\n5Output:2",
  "sample_output": "Input:2 42\r\n1 10\r\n1\r\n5\r\n1 5\r\n1\r\n5Output:3",
  "link": "https://www.spoj.com/problems/GREMLINS",
  "scraped_at": "2025-08-17 00:33:24"
}