{
  "problem_code": "problems",
  "title": "Wireless",
  "tags": [],
  "text": "Bob is sitting at home with his computer. He would like to experience more social interaction, so he is planning a trip to a coffee shop with his computer.Bob has lots of data about wireless networks and coffee shops in the city. In Bob’s city, there is one coffee shop at every intersection of streets. Specifically, Bob happens to live in a city withMstreets (1 ≤M≤ 30000) that run east and west, andNstreets (1 ≤N≤ 1000) that run north and south. As an added benefit, the distance between consecutive parallel streets is 1 metre (it is a very compact city).It also turns out that insideK(1 ≤K≤ 1000) of the coffee shops, there is a wireless network station. Each wireless network station will have a particular bitrateB(1 ≤B≤ 1000) and can reachRmetres (1 ≤R≤ 30000) from the coffee shop. In other words, a wireless network station from one coffee shop forms a circle with radiusRcentered at that particular coffee shop. Moreover, if someone is at distanceR, the wireless network would be available, but if someone is at a distance larger thanR, they cannot access that wireless point.You can assume that each coffee shop has at most one wireless network stationed in it, but that multiple wireless networks may be available while sitting in that one coffee shop, due to the proximity of other wireless network stations.Bob has a special device in his computer that can use all of the available bitrates of as many wireless networks as he can connect to.Bob would like to find out the maximum bitrate he can obtain, and how many coffee shops would have that maximum capacity.InputOn the first line of input, you will be given the integerM, the number of east-west streets. On the second line of input, you will be given the integerN, the number of north-south streets. On the third line of input, you will be given the integerK, the number of coffee shops with a wireless network. On the nextKlines, you will have 4 integers per line. The first integerxon each line represents the north-south street on which the coffee shop is located, where 1 ≤x≤N. The second integer,y, on each line represents the east-west street on which the coffee shop is located, where 1 ≤y≤M. The third integer,R, on each line represents the radius of the wireless network from this particular coffee shop. The fourth integer,B, on each line represents the bitrate of the wireless network from this particular coffee shop.OutputThe output will be two lines long. The first line of output will be the integer representing the maximum bitrate that can be obtained over all coffee shops. The second line of output will be the number of coffee shops where this maximum bitrate can be obtained.Sample Input:3\r\n5\r\n3\r\n1 3 2 5\r\n3 1 2 7\r\n5 1 1 5Sample Output:12\r\n5Explanation:In the figure below, notice that the five coffee shops/intersections marked with a dark circle have total bitrates of 12.",
  "sample_input": "3\r\n5\r\n3\r\n1 3 2 5\r\n3 1 2 7\r\n5 1 1 5",
  "sample_output": "12\r\n5",
  "link": "https://www.spoj.com/problems/WIRELESS",
  "scraped_at": "2025-08-17 00:33:45"
}