{
  "problem_code": "problems",
  "title": "Goal for Raúl",
  "tags": [],
  "text": "What would a Madrid programming contest be without some task about Real Madrid? It's a team with a marvellous history of records. For example, the team's top scorer Raúl González has scored 318 goals so far (in 704 games). In this task you are going to help Raúl shoot his 319th.Consider a game between Real Madrid and FC Barcelona. The match is in a critical situation: 10 seconds before the end, the score is 3:3 and Raúl has the opportunity of a direct free kick. The question you have to answer is: Is it possible for Raúl to score a goal by kicking the ball in a straight line?To model a soccer game, think of the pitch as a rectangle in a coordinate grid, aligned to the axes. The pitch is centred at (0, 0). It is 105m long and 68m wide, thus x ∈ [-52.5, +52.5] and y ∈ [-34, +34]. The goal is 7.32m long and centred on the short side of the field. The coordinates of the four goal posts are thus (±52.5, ±3.66). Real Madrid is on the left side and has to shoot the ball into the right goal (where x>0).To simplify things a bit, we think of the ball and the goal posts as points in space without any volume. Players, on the other hand, have an action radius, i.e. the maximum distance from their position where they can still reach the ball.InputThe input consists of several test cases. The first line of the input file contains one integer N, the number of cases that follow.Each test case starts with a blank line. Then follow the x and y coordinates of the ball. The third line contains the x coordinate, y coordinate and action radius of the FC Barcelona Goalkeeper.Have a look at the images and the corresponding sample input given:Sample input 1Sample input 2GoalNo GoalOutputFor each test case, print a line containing one of the following words:\"Goal!\" if it is possible to shoot the ball in a straight line into the goal, without the goalkeeper intercepting it.\"No goal...\" if it is not possible to do so.ExampleInput:2\r\n\r\n15.0 -20.0\r\n42.5 2.0 5.0\r\n\r\n20.0 11.0\r\n34.0 6.0 5.0Output:Goal!\r\nNo goal...",
  "sample_input": "Input:2\r\n\r\n15.0 -20.0\r\n42.5 2.0 5.0\r\n\r\n20.0 11.0\r\n34.0 6.0 5.0Output:Goal!\r\nNo goal...",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GOALFR",
  "scraped_at": "2025-08-17 00:33:39"
}