{
  "problem_code": "problems",
  "title": "Street Gambler",
  "tags": [],
  "text": "Madrid is a tremendously historic and monumental city that attracts several millions of visitors each year. Where there are tourists, there are also artists that entertain the crowds in the streets and gamblers that challenge pedestrians to often snaky games. One of them is just about to ask you for a game. Although you learned in problem X some basics of Spanish conjugation, you are not proficient enough to understand the rules of the game. This is why you decide to observe first some games, from which you succeeded to extract the rules correctly:12345678OOOOOHere are the turns you observed for the initial game constellation of the above figure:XXOXOOOO                Tourist empties 7 and puts a coin in 4\r\nXXOOOOXO                Gambler empties 8 as well as 4\r\nXXOXOOXX                Tourist empties 6 and puts a coin in 1\r\nOXOXOXXX                Gambler empties 5 and puts a coin in 2\r\nOOOXXXXX                Tourist empties 1\r\nXOOXXXXX                Gambler empties 3 as well as 2\r\nXXXXXXXX                Tourist lost the game, as no coin is leftYou are a bit surprised that the gambler wins most of the games. He must indeed have several years of experience and know some tricks. As you are smart, you discover his trick. Supposing that both of you play optimally, that is, once you are in a winning constellation, you’ll find the correct moves to win the game, can you tell for a given constellation whether you should make the first move or leave it to the gambler? Of course you want to win!InputThe input consists of several test cases (T ≤ 300), one per line that describes the initial board constellation as a string of ‘O’s and ‘X’s. Read from left to right, this string describes the board constellation from position 1 to position N (N ≤ 255). ‘O’ stands for a square with coin, ‘X’ for an empty square. The input terminates on the string “end” that should obviously not be processed.OutputOutput “I’d like to play first” or “After you”, so that you will win the game.ExampleInput:XXOOOX\r\nOOOXX\r\nXOOOOOOOO\r\nXXXXOXXXXXXXOXOXXXXXXOXXXXXXXXX\r\nendOutput:I'd like to play first\r\nAfter you\r\nAfter you\r\nI'd like to play first",
  "sample_input": "XXOXOOOO                Tourist empties 7 and puts a coin in 4\r\nXXOOOOXO                Gambler empties 8 as well as 4\r\nXXOXOOXX                Tourist empties 6 and puts a coin in 1\r\nOXOXOXXX                Gambler empties 5 and puts a coin in 2\r\nOOOXXXXX                Tourist empties 1\r\nXOOXXXXX                Gambler empties 3 as well as 2\r\nXXXXXXXX                Tourist lost the game, as no coin is left",
  "sample_output": "Input:XXOOOX\r\nOOOXX\r\nXOOOOOOOO\r\nXXXXOXXXXXXXOXOXXXXXXOXXXXXXXXX\r\nendOutput:I'd like to play first\r\nAfter you\r\nAfter you\r\nI'd like to play first",
  "link": "https://www.spoj.com/problems/STRGAMB",
  "scraped_at": "2025-08-17 00:33:38"
}