{
  "problem_code": "problems",
  "title": "Guernica",
  "tags": [],
  "text": "Guernica is a famous painting by Pablo Picasso, depicting the bombing of the Basque town of Guernica during the Spanish Civil War. It shows the tragedies war inflicts upon individuals, particularly innocent civilians. The work has gained a monumental status, becoming a perpetual reminder of the tragedies of war, an anti-war symbol and an embodiment of peace.After you were told that the painting was moved from the Museo del Prado to the Museo Nacional Centro de Arte Reina Sofia in 1992, you are on your way to that place. At your arrival, a creepy sight awaits you: Malicious vandals have cut the Guernica painting into several pieces and distributed them throughout the whole museum. A team already gathered all N pieces they could find. All these pieces have the same dimensions! Observing the dimensions, they conclude that there are far too many pieces to rebuild only Guernica. The vandals did in fact not only disassemble the original painting by Picasso but also several copies of it! Exactly P pieces are needed to reconstruct Guernica (or any of its copies).Now experts have to evaluate how probable it is that sets of P pieces belonged to one and the same initial painting and assigned each such combination a matching score. By maximizing the total matching score, they would be able to determine which pieces belonged to the same initial painting. Can you help them calculating the overall maximum matching score for all of the paintings?InputThe input consists of several test cases (T ≤ 10), each of which starts by 3 integers on a line: the number of pieces found N, the number of pieces per painting P and Z, the number of possible combinations. (P, N ≤ 15, Z ≤ 1’000) The next Z lines each contains P+1 positive integers (i1, i2 … iP, s), that means a score of s is given to the combination (i1, i2 … iP). (i1 ... iP ≤ N, 0 < s < 10’000) The last test case is followed by a single line with 3 zeros, which should not be processed.OutputFor each test case, print the case number and the largest score. If it is impossible to group all pieces so that entire paintings result out of them, print -1.ExampleInput:9 3 31 2 3 14 5 6 27 8 9 39 3 41 2 3 11 4 5 21 6 7 31 8 9 43 3 11 2 3 95 4 12 1 5 3 100 0 0Output:Case 1: 6Case 2: -1Case 3: 9Case 4: -1",
  "sample_input": "Input:9 3 31 2 3 14 5 6 27 8 9 39 3 41 2 3 11 4 5 21 6 7 31 8 9 43 3 11 2 3 95 4 12 1 5 3 100 0 0Output:Case 1: 6Case 2: -1Case 3: 9Case 4: -1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GUERNICA",
  "scraped_at": "2025-08-17 00:33:35"
}