{
  "problem_code": "problems",
  "title": "Madrids One Way Streets",
  "tags": [],
  "text": "As you know, PolyProg wants to send EPFL's best coders to Madrid. Now an important question that arises is where they should stay. Apart from being a cheap place, it should also be close to the contest location and the main tourist spots.Now the problem is that there are mostly one-way streets in Madrid (actually there aren't, but this problem is so nice that we wanted to include it in this contest nevertheless). We would like to get to the contest and back to the hotel without breaking any traffic rules... can you help finding a hotel that allows to do so?To be precice, we'd like to find a hotel that allows us to go to each place of interest and back again. If that's not possible, we'd like a hotel that allows us to travel to and from as many places of interest as possible. If the same number of places can be accessed from several hotels, you should choose the hotel with the smallest id.InputThe first line of the input contains 1 ≤N≤ 10, the number of test cases. Then follow three numbers 1 ≤H≤ 1000, 1 ≤P≤ 100'000 and 1 ≤S≤ 1'000'000 denoting the number of hotels, places of interest and streets, respectively.In order to simplify things, we just represent hotels and places of interests as numbers: Hotels are numbered from 1 toH, whereas places are numbered from 1001 to 1000 +P.Each of the followingSlines contains two numbersAsandBs, indicating that there is a one-way street from objectAstoBs.A blank line precedes each test case.The sample input corresponds to the following graph:OutputFor each testcase, print the id of the best hotel followed by the number of places of interest accessible from this hotel (and vice versa) on a line.ExampleInput:12 4 101 10012 10012 10022 10032 10041001 10021002 11002 10031004 21004 1001Output:1 2",
  "sample_input": "Input:12 4 101 10012 10012 10022 10032 10041001 10021002 11002 10031004 21004 1001Output:1 2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MOWS",
  "scraped_at": "2025-08-17 00:33:42"
}