{
  "problem_code": "problems",
  "title": "Top 10",
  "tags": [],
  "text": "Given a dictionary containing N (≤ 20000) words labeled from 1 to N. Each word consists of lowercase characters (from 'a' to 'z') with arbitrary length. The total number of characters in the dictionary is at most 100,000.Your task is to answer Q (≤ 100000) queries. Each query qi is also a word (as defined above). For each query, you have to print the \"Top 10\" words in the dictionary with the following rules:All the words in the \"Top 10\" have to contain the substring qi.All the words in the \"Top 10\" have to be sorted in this order:The words with shorter length come first, if they have equal length thenThe lexicographically smaller words come first, otherwiseThe words with smaller label come first.If the number of words in the dictionary that contains the substring qi is less than 10 then print all the words otherwise, print only the top 10 words (note: the words are printed using their labels).If there is no word in the dictionary that contains the substring qi then print \"-1\" (without the quotes).InputThe first line contains the number N. The next N lines contains the N words in the dictionary (the ith line is the word with label i). The next line contains the number Q followed by the Q lines containing the queries.OutputFor each query, print one line containing the labels of the \"Top 10\" words (separated by a space) in the dictionary using the rules defined above.ExampleInput:17\r\nacm\r\nicpc\r\nregional\r\nasia\r\njakarta\r\ntwo\r\nthousand\r\nand\r\nnine\r\narranged\r\nby\r\nuniversitas\r\nbina\r\nnusantara\r\nespecially\r\nfor\r\nyou\r\n5\r\na\r\nan\r\nwin\r\nb\r\nzOutput:1 8 4 13 5 10 3 7 14 15\r\n8 10 7 14\r\n-1\r\n11 13\r\n-1",
  "sample_input": "Input:17\r\nacm\r\nicpc\r\nregional\r\nasia\r\njakarta\r\ntwo\r\nthousand\r\nand\r\nnine\r\narranged\r\nby\r\nuniversitas\r\nbina\r\nnusantara\r\nespecially\r\nfor\r\nyou\r\n5\r\na\r\nan\r\nwin\r\nb\r\nzOutput:1 8 4 13 5 10 3 7 14 15\r\n8 10 7 14\r\n-1\r\n11 13\r\n-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TOP10",
  "scraped_at": "2025-08-17 00:33:27"
}