{
  "problem_code": "problems",
  "title": "Experiment on a … Cable",
  "tags": [],
  "text": "The head technical person, Joey, at ACM (Association for Cyberspace Management)\r\nhas just received a weird cable-like device – supposedly invented by programmers\r\nduring a competition – for inspection.The device may be viewed as a straight bi-directional cable, which can be used\r\nfor transmitting arbitrary number of data packages simultaneously. The speed with\r\nwhich each package is sent will be pre-determined by the device and furthermore may\r\nvary within a certain range; however it will remain constant throughout each\r\npackage’s entire transmission process. The time it takes for a single data package with\r\nspeed V to arrive at the opposite end of the cable is thus L / V, where L is the length of\r\nthe cable.In addition, the user may sometimes send a fixed-speed “detector” package,\r\nwhich is capable of reporting the number of data packages alongside itself at any time.Finding this device highly amusing, Joey decides to perform an experiment on the\r\nodd “cable”. He has scheduled N packages to be sent from the left side and another M\r\nto be sent from the other side of the cable; also, he has calculated the possible speed\r\nrange for each data package. With this information in hand, Joey wants to estimate\r\nthe effectiveness of a detector he will send. For a detector that departs at a certain\r\ntime, its effectiveness can be represented as a real number in the range [0..1], which\r\nis simply the ratio of the time during which the detector has a chance ofreporting all\r\nN + M packages(explained below) to the total time.If Joey sends the detector at an arbitrary time in [S, T] with speed V from the left\r\nside of the cable, what is theaverageeffectiveness he can achieve?Note: For a detector to have a chance ofreporting all N + M packagesat time T0,\r\nthe device must be able to schedule all data packages with such speeds so that all can\r\nshare the same position with the detector at time T0.InputThere are multiple test cases in the input file.Each test case starts with one integer, L (1 ≤ L ≤ 106), the length of the cable.\r\nThe next line contains one integer, N, the number of packages Joey will send from the\r\nleft side, followed by N lines, the ith line with three real numbers,MinVi,MaxVi, andLeavei(1 ≤MinVi≤MaxVi), which are the minimum speed, maximum speed, and\r\ndeparture time for packagei, respectively. Another (M + 1) lines follow, describing the\r\npackages departing from the right side. The last line of the input contains three real\r\nnumbers, S, T and V (T - S ≥ 1), whose meanings are described above.The total number of packages Joey sent will be in the interval [1, 5000]. It is\r\nguaranteed that the speed of any data packet, including that of the detector, will be\r\nno less than 0.01; also, all real numbers in the input will be given with at most two\r\ndigits after the decimal point, and will belong to the interval: [0, 106].Two successive test cases are separated by a blank line. A case with L = 0\r\nindicates the end of the input file, and should not be processed by your program.OutputPlease print the average effectiveness of the detector’s trip, with precision up to\r\n0.00001.ExampleInput:5\r\n1\r\n5.00 10.00 2.00\r\n2\r\n10.05 11.50 0.05\r\n1.68 2.00 0.01\r\n3.00 4.00 1000\r\n\r\n5\r\n1\r\n1.25 2.50 1.0\r\n0\r\n1.00 5.00 2.50\r\n\r\n0Output:Case #1: 0.00000\r\nCase #2: 0.25000",
  "sample_input": "Input:5\r\n1\r\n5.00 10.00 2.00\r\n2\r\n10.05 11.50 0.05\r\n1.68 2.00 0.01\r\n3.00 4.00 1000\r\n\r\n5\r\n1\r\n1.25 2.50 1.0\r\n0\r\n1.00 5.00 2.50\r\n\r\n0Output:Case #1: 0.00000\r\nCase #2: 0.25000",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CABLEXPR",
  "scraped_at": "2025-08-17 00:33:37"
}