{
  "problem_code": "problems",
  "title": "Tower of Vientiane",
  "tags": [],
  "text": "The Tower of Hanoi is a mathematical game or puzzle. It consists of three rods, and a number of disks of different sizes which can slide onto any rod. The puzzle starts with the disks neatly stacked in order of size on one rod, the smallest at the top, thus making a conical shape.\r\nThe objective of the puzzle is to move the entire stack to another rod, obeying the following rules:Only one disk may be moved at a time.Each move consists of taking the upper disk from one of the rods and sliding it onto another rod, on top of the other disks that may already be present on that rod.No disk may be placed on top of a smaller disk.It is known that the puzzle can be solved in2n-1steps for n disks.Now consider the puzzle called The Tower of Vientiane. The rules are almost the same as for The Tower of Hanoi. But additionally there are limitations on the allowed moves. Let the initial rod be numbered 1, the target rod - 3, and the auxiliary rod - 2. The matrix of allowed moves is given. For example is can be allowed to move disks from rod 1 to rod 2 only, from rod 2 to rod 3 and from rod 3 to rod 1. You are to find out the minimal number of moves in which the puzzle can be solved given some limitations on the allowed moves.InputThe first line of the input contains numbert– the amount of tests. Thenttest descriptions follow. The test starts with a3×3matrix, consisting of1sand0s. The1ini-throw andj-thcolumn of the matrix means that the move from rodito rodjis allowed, otherwise it is not allowed. The next line of each test contains the numbern- the amount of disks for the corresponding testcase.Constraints1 ≤t≤ 100002 ≤n≤ 39OutputFor each test print the minimal number of moves in which the puzzle can be solved or \"Epic Fail...\" if it's impossible to solve the puzzle under such limitations.ExampleInput:3\r\n011\r\n101\r\n110\r\n5\r\n010\r\n101\r\n010\r\n5\r\n010\r\n001\r\n010\r\n5Output:31\r\n242\r\nEpic Fail...",
  "sample_input": "Input:3\r\n011\r\n101\r\n110\r\n5\r\n010\r\n101\r\n010\r\n5\r\n010\r\n001\r\n010\r\n5Output:31\r\n242\r\nEpic Fail...",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/VIENTIAN",
  "scraped_at": "2025-08-17 00:33:37"
}