{
  "problem_code": "problems",
  "title": "Cryptography Reloaded (Act II)",
  "tags": [],
  "text": "In the game BioHazard 4, the American president's daughter has been abducted by some crazy villagers. Leon S. Kennedy, the secret agent of White House, goes to rescue her. He keeps in contact with Hunnigan, the president's secretary. But the time in their contact log has been encrypted, using the following method:\r\nCount the number of seconds from 2000.01.01 00:00:00 to that time, assume this number isx. Then calculatexq, modulo it by a prime numberp. The remainderais the encrypted number.Your task is to help Leon write a program to decrypt the contact log, and tell him all the possible original times.Remember that if the year can be divided evenly by 4 but can't be divided evenly by 100, or it can be divided evenly by 400, this year is a leap year. The February of a leap year has 29 days, while the February of other years has 28 days.In this problem, if the year modulo 10 is 5 or 8, at the end of this year, there is one \"leap second\", i.e., the second after 2005.12.31 23:59:59 is 2005.12.31 23:59:60, and after that second, it's 2006.01.01 00:00:00.You may assume that from 2000.01.01 00:00:00 till that time, less than p seconds have passed.InputThere are multiple test cases.The first line of the input contains an integer T, meaning the number of the test cases.For each test case, a single line of three integers: p, q, and a. (2 < p ≤ 1000000007, 1 < q ≤ 10, 0 ≤ a < p, p is always a prime.)OutputThe time. If there are multiple solutions, you must output all possible solutions in chronological order.If the solution doesn't exist, outputTransmission errorinstead.See the sample output for further details.SampleInput:2\r\n3 2 1\r\n3 2 2Output:Case #1:\r\n2000.01.01 00:00:01\r\n2000.01.01 00:00:02\r\nCase #2:\r\nTransmission error",
  "sample_input": "Input:2\r\n3 2 1\r\n3 2 2Output:Case #1:\r\n2000.01.01 00:00:01\r\n2000.01.01 00:00:02\r\nCase #2:\r\nTransmission error",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CRYPTO7",
  "scraped_at": "2025-08-17 00:33:25"
}