{
  "problem_code": "problems",
  "title": "Double Sorting",
  "tags": [],
  "text": "Here we describe a typical problem. There arenballs andnboxes. Each ball is labeled by a unique\r\nnumber from 1 ton. Initially each box contains one of these balls. We can swap two balls in adjacent\r\nboxes. We are to sort these balls in increasing order by swaps, i.e. move the ball labeled by 1 to the first\r\nbox, labeled by 2 to the second box, and so forth. The question is how many swaps are needed.Now let us consider the situation where the balls are doubled, that is, there are2nballs andnboxes,\r\nexactly two balls are labeled bykfor each 1 ≤k≤n, and the boxes contain two balls each. We can swap\r\ntwo balls in adjacent boxes, one ball from each box. We are to move the both balls labeled by 1 to the\r\nfirst box, labeled by 2 to the second box, and so forth. The question is again how many swaps are needed.Here is one interesting fact. We need 10 swaps to sort [5; 4; 3; 2; 1] (the state with 5 in the first box, 4 in\r\nthe second box, and so forth): swapping 5 and 4, then 5 and 3, 5 and 2, 5 and 1, 4 and 3, 4 and 2, 4 and\r\n1, 3 and 2, 3 and 1,and finally 2 and 1. Then how many swaps we need to sort [5, 5; 4, 4; 3, 3; 2, 2; 1, 1]\r\n(the state with two 5’s in the first box, two 4’s in the second box, and so forth)? Some of you might think\r\n20 swaps — this is not true, but the actual number is 15.Write a program that calculates the number of swaps for the two-ball version and verify the above fact.InputThe input has the following format:n\r\n       ball1,1ball1,2ball2,1ball2,2...\r\n       balln,1balln,2nis the number of boxes (1 ≤n≤ 8). balli,1and balli,2, for 1 ≤i≤n, are the labels of two balls initially\r\ncontained by thei-th box.OutputPrint the minimum possible number of swaps.ExampleInput:5\r\n5 5\r\n4 4\r\n3 3\r\n2 2\r\n1 1Output:15",
  "sample_input": "n\r\n       ball1,1ball1,2ball2,1ball2,2...\r\n       balln,1balln,2",
  "sample_output": "Input:5\r\n5 5\r\n4 4\r\n3 3\r\n2 2\r\n1 1Output:15",
  "link": "https://www.spoj.com/problems/PAIRSORT",
  "scraped_at": "2025-08-17 00:33:39"
}