{
  "problem_code": "problems",
  "title": "Differential Diagnosis",
  "tags": [],
  "text": "Daniel enjoys watching TV series. One of his favorite is \"Doctor Chaos\". In this series the medical genius is saving people by making difficult diagnosis. In his work he employs the differential diagnosis method. Doctor Chaos writes all the symptoms the patient have on the white board and his team tries to find out the disease which explains those symptoms best. Sometimes some symptoms are not caused by the disease itself. Sometimes some symptoms are not revealed yet and are not written on the board. Anyhow the team chooses come candidate-diseases and then runs the tests to identify the right one. Help Doctor Chaos by making a program which find out the diseases that are explaining the set of symptoms the best way. We'll say that the disease explains the set of symptoms the best way if it explains the most symptoms from the set among all known diseases.InputThe first line of the input file contains numbern- the amount of diseases known to Chaos and his team. Thennlines follow describing each disease. The description of the disease starts with the name of the disease. Then numberkfollows, that is the amount of different symptoms caused by the disease. Then there go the names of the symptoms separated by spaces. After the description of all the diseases there is numbert- the amount of cases to diagnose. After thattlines follow each containing a set of symptoms. Each set starts with the numberq- the amount of different symptoms. Thenqnames of the symptoms follow separated by spaces. The names of all diseases and symptoms consist of only small latin letters and don't exceed 20 characters. Each symptom in each set is explained by at least one disease.Constraints1 ≤n≤ 10001 ≤k≤ 101 ≤t≤ 100001 ≤q≤ 10There are no more than 1000 different symptoms.OutputFor each case to diagnose first print the line \"Diagnosis #x:\" wherexis the case number starting from one. Then list all the diseases which explains the corresponding set of symptoms best. The diseases should be listed one in line and in the same order in which they were given in the input file.ExampleInput:3\r\nmigraine 2 headache nausea\r\npoisoning 3 nausea stomachache fever\r\nflu 3 fever cough headache\r\n4\r\n1 fever\r\n2 nausea headache\r\n2 nausea cough\r\n4 fever nausea cough headacheOutput:Diagnosis #1:\r\npoisoning\r\nflu\r\nDiagnosis #2:\r\nmigraine\r\nDiagnosis #3:\r\nmigraine\r\npoisoning\r\nflu\r\nDiagnosis #4:\r\nflu",
  "sample_input": "Input:3\r\nmigraine 2 headache nausea\r\npoisoning 3 nausea stomachache fever\r\nflu 3 fever cough headache\r\n4\r\n1 fever\r\n2 nausea headache\r\n2 nausea cough\r\n4 fever nausea cough headacheOutput:Diagnosis #1:\r\npoisoning\r\nflu\r\nDiagnosis #2:\r\nmigraine\r\nDiagnosis #3:\r\nmigraine\r\npoisoning\r\nflu\r\nDiagnosis #4:\r\nflu",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DIFFDIAG",
  "scraped_at": "2025-08-17 00:33:27"
}