{
  "problem_code": "problems",
  "title": "Fishing Net",
  "tags": [],
  "text": "In a highly modernized fishing village, inhabitants there make a living on fishery. Their major tools, fishing nets, are produced and fixed by computer. After catching fishes each time, together with plenty of fishes, they will bring back the shabby fishing nets, which might be full of leaks. Then they have to inspect those nets. If there exist large leaks, they have to repair them before launching out again.Obviously, the smaller the leaks in the fishing nets are, the more fishes they will catch. So after coming back, those fishermen will input the information of the fishing nets into the computer to check whether the nets have leaks. The checking principle is very simple: The computer regards each fishing net as a simple graph constructed by nodes and edges. In the graph, if any circle whose length (the number of edges) is larger than 3 must has at least one chord, the computer will output \"Perfect\" indicating that the net has no leaks. Otherwise, \"Imperfect\" will be displayed and the computer will try to repair the net.Note: A circle is a closed loop, which starts from one node, passes through other distinct nodes and back to the starting node. A chord is an edge, which connects two different nodes on the circle, but it does not belong to the set of edges on the circle.InputThe input file contains several test cases representing different fishing nets. The last test case in the input file is followed by a line containing0 0.The first line of each test case contains two integers,nandm, indicating the number of nodes and edges on the net respectively, 1 ≤n≤ 1000. It is followed bymlines accounting for the details of the edges. Each line consists of two integersxiandyi, indicating there is an edge between nodexiand nodeyi.OutputFor each test case, display its checking results. The word \"Imperfect\" suggests that the corresponding fishing net is leaking, while the word \"Perfect\" stands for a fishing net in good condition.Follow the output for each net with a blank line.ExampleInput:4 4\r\n1 2\r\n2 3\r\n3 4\r\n4 1\r\n3 3\r\n1 2\r\n2 3\r\n3 1\r\n0 0Output:Imperfect\r\n\r\nPerfect",
  "sample_input": "Input:4 4\r\n1 2\r\n2 3\r\n3 4\r\n4 1\r\n3 3\r\n1 2\r\n2 3\r\n3 1\r\n0 0Output:Imperfect\r\n\r\nPerfect",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/FISHNET",
  "scraped_at": "2025-08-17 00:33:28"
}