{
  "problem_code": "problems",
  "title": "Art Plagiarism",
  "tags": [],
  "text": "You have pictures of two sculptures. The sculptures consist of several solid metal spheres, and some rubber pipes connecting pairs of spheres. The pipes in each sculpture are connected in such a way that for any pair of spheres, there is exactly one path following a series of pipes (without repeating any) between those two spheres. All the spheres have the same radius, and all the pipes have the same length.You suspect that the smaller of the two sculptures was actually created by simply removing some spheres and pipes from the larger one. You want to write a program to test if this is possible.The input will contain several test cases. One sculpture is described by numbering the spheres consecutively from 1, and listing the pairs of spheres which are connected by pipes. The numbering is chosen independently for each sculpture.InputOne line containing an integer C, the number of test cases in the input file.For each test case, there will be:One line containing the integer N, the number of spheres in the large sculpture.N − 1 lines, each containing a pair of space-separated integers, indicating that the two spheres with those numbers in the large sculpture are connected by a pipe.One line containing the integer M, the number of spheres in the small sculpture.M − 1 lines, each containing a pair of space-separated integers, indicating that the two spheres with those numbers in the small sculpture are connected by a pipe.OutputC lines, one for each test case in the order they occur in the input file, containing:\"Case #X: YES\" if the small sculpture in case X could have been created from the large sculpture in case X\"Case #X: NO\" if it could not.X is the number of the test case, between 1 and C.Limits1 ≤ C ≤ 502 ≤ N ≤ 1001 ≤ M ≤ NSample input\r\n2\r\n5\r\n1 2\r\n2 3\r\n3 4\r\n4 5\r\n4\r\n1 2\r\n1 3\r\n1 4\r\n5\r\n1 2\r\n1 3\r\n1 4\r\n4 5\r\n4\r\n1 2\r\n2 3\r\n3 4\r\n\r\nSample output\r\nCase #1: NO\r\nCase #2: YES",
  "sample_input": "Sample input\r\n2\r\n5\r\n1 2\r\n2 3\r\n3 4\r\n4 5\r\n4\r\n1 2\r\n1 3\r\n1 4\r\n5\r\n1 2\r\n1 3\r\n1 4\r\n4 5\r\n4\r\n1 2\r\n2 3\r\n3 4\r\n\r\nSample output\r\nCase #1: NO\r\nCase #2: YES",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/AP",
  "scraped_at": "2025-08-17 00:33:39"
}