{
  "problem_code": "problems",
  "title": "Great Warrior",
  "tags": [],
  "text": "This problem is about an imaginary game. First of all, define aWar Boardthat is aN × N square matrix. Each matrix cell represents a warrior and the value written in the cell is the power of that particular warrior.Rules for Assigning Powers of Each WarriorFirst start filling the main diagonal with numbers1, 2, 3, 4 ... Kaccording to requirement. Starting of filling always be at the top corner.Now start filling the anti diagonal with numbersk + 1, k + 2, k + 3, k + 4 ... Laccording to requirement. Starting of filling always be at the bottom corner.Don't forget that in case of filling the anti diagonal if there is any number already filled it will be modified by the current number that is to be filled, if that particular cell was empty.Now fill all the empty cells, inanti-clockwise spiralfilling manner. The first cell to be filled will be2nd last column of first row.5 × 5 War BoardDescription of GameThe greatest warriorWof king Pushyamitra Shunga is having fight with Yavana warriors. W fights with one Yavana warriorYat a time. Consider the followings:Power_of_W is more than Yavanas.W can defeat Y ifPower_of_W > Power_of_Y - 1After each winPower_of_W decreases by Power_of_YW can move to cells adjacent to it. IfCurrent_Cell_Location_of_Wis(i, j)thenNext_Cell_Location_of_Wwill be one of(i ± 1, j ± 1)or(i ± 1, j)or(i, j ± 1)W will win if W defeats Y such thatPower_of_Y = 1, otherwise W is defeated.What to CodeYou have to code to verify whether W wins or get defeated but don't forget the followings:The one cell location is of W and other cell locations are of YavanasIt's up to W to choose the Yavana warrior Y to fight withIt's not necessary that W has to defeat all Yavanas,W just want to win[All the information required to solve this problem is provided in the description]InputFirst line of input is t, total number of test cases (t < 1001). Next t lines contains value ofN (2 < N < 1000).OutputOutput for each test case is single line printing eitherDWONFinal_Power_of_W(If W wins) orDDOWN(If W is defeated).ExampleInput:1\r\n5Output:DWON 15",
  "sample_input": "Input:1\r\n5Output:DWON 15",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SNGGW",
  "scraped_at": "2025-08-17 00:33:35"
}