{
  "problem_code": "problems",
  "title": "Help Donn",
  "tags": [],
  "text": "Enigma Treasure HuntKaushikRamDonn went to Enigma and registered for the Treasure Hunt. Following are the rules for Enigma Treasure hunt,Donn has to go from 1st stage to nth stage in a sequential order (only after completing stage 1, he can go to stage 2, then to stage 3) and collect treasures in a bag.Donn will be given only k bags at the time of registration.There are bags capable of holding all possible weights and is infinite in number. Donn is free to choose any bags capable of holding any weight (but all the k bags should be capable of holding the same weight.) Pandian, the organiser will give the bag to Donn.once the game is started, Donn cant exchange his bag.While going through different stages, if Donn couldn't accommodate the treasure in a bag, he will tie the bag and give it to Pandian. (This bag can't be used any more). Then he starts collecting the treasures in a new bag.The cost of the bag is directly proportional to the weight it can hold, so try to reduce the cost.Fortunately, Donn knows the weights of the treasure in each stage, help Donn choose his bag.Example:Consider there are 3 stages (n = 3) in the Hunt. The weight of the treasures in each of these stages (which are known to Donn before the hunt starts) are 1, 2 and 3. Donn is allowed to get 2 bags (k = 2) in this example.n = 3, k= 2stages = {1, 2, 3}Donn could accomplish his target if each of his bag can accommodate 3 kg or 5 kg.Explanation:If the weight of the bag is 3 - Stage 1 weight + stage 2 weight = 1+2 = 3 <= 3 in one bag, stage 3 weight = 3 <= 3 in another bag. Thus they fit in the bagsIf the weight of the bag is 5 - Stage 1 weight = 1 <= 5 in one bag, stage 2 + stage 3 weight = 2+3 = 5 <= 5 in another bag. Thus they fit in the bags but consider a bag size of 2:1 + 2 > 2 so put stage 1 treasure alone in 1st bag2 + 3 > 2 so put stage 2 treasure alone in 2nd bagNow we need one more bag to put in the 3rd treasure.This is not possible so you can't choose a bag of size 2, and a bag of size >= 3 can be used. Donn is intelligent and so he wants to pay the minimum cost so Donn will purchase a bag of size 3. Help Donn solve his problem.Input:0 < T <= 100, number of test cases.Each test case contains:0 < N <= 1000, number of stages and then a space followed by 0 < k <= 1000, number of bags allowed.the next N lines contains the weights of the treasures in each stage. The weight of the treasure <= 1000.Output:Output a single line containing the minimum size of the bag needed.ExampleInput:1\r\n3 2\r\n1\r\n2\r\n3output:3",
  "sample_input": "Input:1\r\n3 2\r\n1\r\n2\r\n3output:3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HELPDONN",
  "scraped_at": "2025-08-17 00:33:48"
}