{
  "problem_code": "problems",
  "title": "Boxes of Chocolate",
  "tags": [],
  "text": "Choco-moo has gone to the super market to buy chocolates for his friends. He entered a shop and found that they sell many boxes of chocolates. All the chocolate boxes are lined up on the display and there are exactlyN (0 < N ≤ 100000)chocolate boxes. The i-th number box containsAi (0 < Ai ≤ 100000)amount of chocolates inside. Choco-moo loves chocolates and wants to buy all of the boxes, but he won’t. He will only buy boxes that contains amount of chocolates that can be divided byK (0 < K ≤ 100000)since he has K number of friends and wants to divide the chocolates equally without wasting any chocolates.Now, you are given the value N and then N numbers indicating the amount of chocolates inside the N boxes. You have to answer some queries for Choco-moo. You will be givenQ (0 < Q ≤ 100000)queries.In each query, Choco-moo will provide you with three integers,A,B (0 < A ≤ B ≤ N)and K. Here A and B are index number and K is the number of friends Choco-moo has. Now you have to find how many chocolate boxes Choco-moo can buy between Ath box to Bth box (inclusive)?InputThe first line contains an integerT(T≤ 2), which is the number of test cases.Each test case starts with a numberN. After that N positive numbers follow indicating amount of chocolates inside each box. After that an integerQis provided indicating number of queries to be answered. Each query has three integers, A, B and K. The ranges of the variables are described in the description.OutputFor each test case, print case number (Check sample output) and then for every query print the number of chocolate box Choco-moo can buy for his K friends from Ath box to Bth box (inclusive) in a newline.ExampleInput:2\r\n5\r\n1 2 3 4 5\r\n2\r\n1 5 1\r\n1 5 2\r\n5\r\n12 32 5 12 9\r\n3\r\n1 5 2\r\n3 5 3\r\n2 5 2Output:Case 1:\r\n5\r\n2\r\nCase 2:\r\n3\r\n2\r\n2ExplanationIn Case 1: Query 1 Choco-moo buys all the boxes since all boxes are divisible by 1. In query 2 he buys second and fourth box since they are divisible by 2 (2 and 4).Note: Let me know if you think the judge data is weak or there is ambiguity/mistake in the problem statement.",
  "sample_input": "Input:2\r\n5\r\n1 2 3 4 5\r\n2\r\n1 5 1\r\n1 5 2\r\n5\r\n12 32 5 12 9\r\n3\r\n1 5 2\r\n3 5 3\r\n2 5 2Output:Case 1:\r\n5\r\n2\r\nCase 2:\r\n3\r\n2\r\n2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BOXSCHOC",
  "scraped_at": "2025-08-17 00:33:29"
}