{
  "problem_code": "problems",
  "title": "Fone Frequencies",
  "tags": [],
  "text": "When relay towers for mobile telephones communicate with the mobile phones in their area, there is\r\nalways the possibility of interference. So, when assigning the transmission frequency, the FCC makes\r\nsure that nearby towers have frequencies that aren't too close. On the other hand, the FCC does not\r\nwant to assign too many different frequencies; they want to save as many as possible for other uses.Your job is to find an optimal assignment of frequencies.In this problem, the frequencies will be integers. Nearby towers must be assigned frequencies that differ\r\nby at least 2. You'll find an assignment using as few frequencies as possible. For example, consider the\r\nfollowing two arrangements of towers. Two towers near each other are indicated by the connecting line.Note that the following are legal frequency assignments to these two tower configurations. However,\r\nthe second arrangement does not use the fewest number of frequencies possible, since the tower with\r\nfrequency 5 could have frequency 1.InputThere will be multiple test cases. Input for each test case will consist of two lines: the first line will\r\ncontain the integer n, indicating the number of towers. The next line will be of the form x1 y1 x2 y2 ...\r\nxn yn where xi yi are the coordinates of tower i. A pair of towers are considered \"near\" each other\r\nif the distance between them is no more than 20. There will be no more than 12 towers and no tower\r\nwill have more than 4 towers near it. A value of n = 0 indicates end of input.OutputFor each test case, you should print one line in the format:The towers in case n can be covered in f frequencies.where you determine the value for f. The case numbers, n, will start at 1.ExampleInput:5\r\n0 0 5 7.5 1 -3 10.75 -20.1 12.01 -22\r\n6\r\n0 1 19 0 38 1 38 21 19 22 0 21\r\n0Output:The towers in case 1 can be covered in 3 frequencies.\r\nThe towers in case 2 can be covered in 2 frequencies.",
  "sample_input": "The towers in case n can be covered in f frequencies.",
  "sample_output": "Input:5\r\n0 0 5 7.5 1 -3 10.75 -20.1 12.01 -22\r\n6\r\n0 1 19 0 38 1 38 21 19 22 0 21\r\n0Output:The towers in case 1 can be covered in 3 frequencies.\r\nThe towers in case 2 can be covered in 2 frequencies.",
  "link": "https://www.spoj.com/problems/OU7",
  "scraped_at": "2025-08-17 00:33:26"
}