{
  "problem_code": "problems",
  "title": "Horace and his primes",
  "tags": [],
  "text": "Horace likes to play writing natural numbers in the blackboard in his bedroom. One of his favourite games consists in first writing a numbern, then the sum of all the different prime numbers that dividen, and so on until the number written on the board becomes a prime number. For example, if Horace begins writing the numbern = 90, because90 = 2 × 32× 5the next number to be written will be2 + 3 + 5 = 10; then, as10 = 2 × 5Horace will write the number2 + 5 = 7; finally, because7is a prime number the game will end here.Formally, in this game each natural number n >= 2 defines a sequence whose first element is n, and each new element is the sum of all the prime numbers that divide the previous element in the sequence. The order of the game is the position of the first prime number in the sequence, and coincides with the total number of numbers written on the blackboard one the game has ended. In the example from the previous paragraph, with n = 90 the order of the game is K = 3, because the numbers that are written will be 90, 10 and 7.Now, not all games are equally entertaining to Horace, and in this case he prefers to begin by writing a number n such that the order of the corresponding game is a particular value K. Horace would like to know how many different values of n between A and B inclusive satisfy this condition, but because he does not know how to code he needs someone to do this calculation for him. Can you help him?INPUTThe first line contains an integer P which indicates the number of questions Horace wants to ask you (1 <= P <= 10^5). Each of the next P lines describes a question using three integer numbers A, B and K, which mean that Horace would like to know how many different values of n satisfy that A <= n <= B and the order of the game beggining with n is K (2 <= A <= B <= 10^6 and 1 <= K <= 10^6).OUTPUTYou should print P lines, each one containing an integer number with the answer to one of the questions made by Horace, in the order in which they appear in the input.Formally, in this game each natural numbern ≥ 2defines a sequence whose first element isn, and each new element is the sum of all the prime numbers that divide the previous element in the sequence. The order of the game is the position of the first prime number in the sequence, and coincides with the total amount of numbers written on the blackboard once the game has ended. In the example from the previous paragraph, withn = 90the order of the game isK = 3, because the numbers that are written will be90,10and7.Now, not all games are equally entertaining to Horace, and in this case he prefers to begin by writing a numbernsuch that the order of the corresponding game is a particular valueK. Horace would like to know how many different values ofnbetweenAandBinclusive satisfy this condition, but because he does not know how to code he needs someone to do this calculation for him. Can you help him?InputThe first line contains an integerPwhich indicates the number of questions Horace wants to ask you (1≤P ≤ 105). Each of the nextPlines describes a question using three integer numbersA,BandK, which mean that Horace would like to know how many different values ofnsatisfy thatA≤n≤Band the order of the game beginning withnisK(2≤A≤B≤106and1≤K≤106).OutputYou should printPlines, each one containing an integer number with the answer to one of the questions made by Horace, in the order in which they appear in the input.Example 1Input:1\r\n90 90 3Output:1Example 2Input:5\r\n2 9 1\r\n2 9 2\r\n800 810 4\r\n999999 1000000 2\r\n100000 1000000 1000000Output:4\r\n4\r\n5\r\n2\r\n0",
  "sample_input": "Input:1\r\n90 90 3Output:1",
  "sample_output": "Input:5\r\n2 9 1\r\n2 9 2\r\n800 810 4\r\n999999 1000000 2\r\n100000 1000000 1000000Output:4\r\n4\r\n5\r\n2\r\n0",
  "link": "https://www.spoj.com/problems/TAP2013H",
  "scraped_at": "2025-08-17 00:33:45"
}