{
  "problem_code": "problems",
  "title": "Help Your Commander",
  "tags": [],
  "text": "A good war commander must take quick decisions, and at the same time be a good strategist. One of the functions of the commander is to delegate soldiers to several strategic points, such that the enemy can be caught surprised and be defeated. There are several strategic points at the battle field, as well as several routes that connect these points.Your field is, however, being bombarded, and these routes are not so safe as they were. Once a bomb falls at one route, such terrain becomes irregular and your crossing becomes impossible. To deal with such problem, the commander ordered a new task to some soldiers: find new routes.The commander asked your help to calculate the shortest path between the base of operation and the strategic points. You will be informed about the initial state of the battle field, withNstrategic points (being the point 1 the base of operation) andMroutes. As the bombs falls over some routes, and other routes are found by the soldiers, you must update your map such that your commander can make good use of such information.Good luck, the country depends on you.InputThe input contains several test cases. Each test case begins with two integers,NandM(2 ≤N≤ 1000 and 1 ≤M≤ 10000), representing, respectively, the number of strategic points and the number of routes that connects two strategic points. After that, there will beMlines, each one with three integersU,VandW(1 ≤U,V≤Nand 1 ≤W≤ 100) each, representing that there is a route that connects the pointUto the pointV, in unique direction, with distanceW.There will be, then, an integerQ(1 ≤Q≤ 1000), that represents the number of consults or updates that will be done over the routes. At the nextQlines there will be a letter and a determined number of integers.If the letter is aR, there will be two integersUandV(1 ≤U,V≤N), indicating that the route that used to connect the pointUto the pointVwas bombed.In the case that the letter is aI, there will be three integersU,VandW(1 ≤U,V≤Nand 1 ≤W≤ 100), indicating that a new route was found, which connects the pointUto the pointV, with distanceW.And in the case that the letter is aP, there will be one integerV(1 ≤V≤N), and you must inform to the commander what is the shortest distance between the base of operation and the strategic pointV.The input ends whenN=M= 0.OutputFor each test case there will be a not defined number of output lines. When the commander order to know the shortest distance between the base of operation and a strategic point (letterP), such distance must be print in an unique line. If it is not possible to reach such strategic point, the number -1 must be printed. There must have a blank line after each test case.ExampleInput:3 3\r\n1 2 2\r\n2 3 3\r\n1 3 4\r\n5\r\nP 3\r\nR 2 3\r\nP 3\r\nI 2 3 1\r\nP 3Output:4\r\n4\r\n3",
  "sample_input": "Input:3 3\r\n1 2 2\r\n2 3 3\r\n1 3 4\r\n5\r\nP 3\r\nR 2 3\r\nP 3\r\nI 2 3 1\r\nP 3Output:4\r\n4\r\n3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HELPCOMM",
  "scraped_at": "2025-08-17 00:33:39"
}