{
  "problem_code": "problems",
  "title": "Some Sums",
  "tags": [],
  "text": "After giving a heart-warming, inspirational speech to the sorority sisters of Delta Gamma at the University of Maryland, Michael Shannon was assaulted on the street by an armed mathematician, who defined a functionfas follows:The mathematician presented Shannon with an ultimatum: You will write a program to calculate this function modulo 109+7 for various values ofm,n, andkwithin the given constraints XOR I will shoot you with this gun!As the mathematician lay recovering in his hospital bed, a Sigma Nu brother who had witnessed the event gingerly approached him and said, \"Professor Martinson, I've written a program to solve your problem, but the online judge on your website keeps telling me the answer is wrong. Please tell me what the problem is. Submission ID 571972597.\"Wearily, Martinson replied, \"Have you written a brute force program to verify your program's output for smaller cases?\"The Sigma Nu brother replied, \"Sorry, what did you say? I wasn't listening. Hey, are you going to eat that?\" He then took the professor's chocolate pudding and went home to his lovely girlfriend from Zeta to enjoy the rest of the evening.InputIn the first line, an integerT, the number of test cases. ThenTlines containing integersm,n, andkseparated by spaces.OutputTlines containing the value off(m,n,k) modulo 109+7 for each test case.Constraints1 ≤T≤ 200000 ≤m≤ 10000 ≤n≤ 1090 ≤k≤ 1000ExampleInput:5\r\n0 0 0\r\n1 100 1\r\n2 100 0\r\n2 100 1\r\n100 100 100Output:1\r\n5050\r\n5151\r\n171700\r\n143422859Additional InfoThere are two randomly generated data sets, one withT= 10000 and the other withT= 20000. The distributions are close to uniform random.At the time of publication, my C code runs in 0.69s and my Python 2.7 code runs in 24.70s. The Python code is about 1KB, not golfed.",
  "sample_input": "Input:5\r\n0 0 0\r\n1 100 1\r\n2 100 0\r\n2 100 1\r\n100 100 100Output:1\r\n5050\r\n5151\r\n171700\r\n143422859",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SOMESUMS",
  "scraped_at": "2025-08-17 00:33:32"
}