{
  "problem_code": "problems",
  "title": "Nadal vs Djokovic",
  "tags": [],
  "text": "Rafael Nadal vs Novak Djokovic is probably the fiercest rivalry in tennis right now. Now your task is very simple. You are given a string containing the scores of a single set (a set consists of many games) between these two stalwarts. N denotes Nadal and D denoted Djokovic. For those who are new to tennis, have a look of the rules online. Anyway small description about the rules:Now how a player wins a single game?In a game scores are incremented as follows: 15, 30, 40. A player wins if scores are like 40-0, 40-15, 40-30. If tied at 40-40, it is called deuce. If N wins next he has an advantage and if he loses the next volley he comes back to deuce. After advantage if the player wins the next volley he wins that game.Simply put the player who wins 6 games first (provided he has won two games more than his opponent) wins the set. For example, 6-1, 6-2, 6-3, 6-4 are all valid.If 1 player has won 6 games and the other has won 5 games the match continues. (7-5 is also a valid scoreline.)If both the players are deadlocked at 6-6, then we have a tiebreaker. In the tiebreaker the scores are counted normally (1, 2, 3...) The person who reaches 7 points first and is at least 2 more than his opponent wins the set. Example: 7-0, 7-1, 7-2 ... 7-5 are valid. If the score is 7-6 the match proceeds until one of the players scores two points more than the other, for example: even 10-8 is valid.Input1st line - number of test casesNext T lines consist of strings denoting who won a volley.OutputOutput the winner, their score, and the tie breaker score if any in the first line.Output the loser and their score on the second line.See the sample out for the required formatting.ExampleInput:2\r\nN N N N N N N N N N N N N N N N N N N N D D D D D D D D N N N N\r\nD D D D N N N N D D D D N N N N D D D D N N N N D D D D N N N N D D D D N N N N D D D D N N N N D D D D D D N N N N N DOutput:N 6\r\nD 2\r\nD 7 (7-5)\r\nN 6",
  "sample_input": "Input:2\r\nN N N N N N N N N N N N N N N N N N N N D D D D D D D D N N N N\r\nD D D D N N N N D D D D N N N N D D D D N N N N D D D D N N N N D D D D N N N N D D D D N N N N D D D D D D N N N N N DOutput:N 6\r\nD 2\r\nD 7 (7-5)\r\nN 6",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RAFANOLE",
  "scraped_at": "2025-08-17 00:33:35"
}