{
  "problem_code": "problems",
  "title": "Endless Knight",
  "tags": [],
  "text": "In the game of chess, there is a piece called the knight. A knight is special -- instead of moving in a straight line like other pieces, it jumps in an \"L\" shape. Specifically, a knight can jump from square (r1, c1) to (r2, c2) if and only if (r1 - r2)2+ (c1 - c2)2= 5.In this problem, one of our knights is going to undertake a chivalrous quest of moving from the top-left corner (the (1, 1) square) to the bottom-right corner (the (H,W) square) on a gigantic board. The chessboard is of heightHand widthW.Here are some restrictions you need to know.The knight is so straightforward and ardent that he is only willing to move towards the rightandthe bottom. In other words, in each step he only moves to a square with a bigger row number and a bigger column number. Note that, this might mean that there is no way to achieve his goal, for example, on a 3 by 10 board.There areRsquares on the chessboard that contain rocks with evil power. Your knight may not land on any of such squares, although flying over them during a jump is allowed.Your task is to find the number of unique ways for the knight to move from the top-left corner to the bottom-right corner, under the above restrictions. It should be clear that sometimes the answer is huge. You are asked to output the remainder of the answer when divided by 10007, a prime number.InputInput begins with a line containing a single integer,N.Ntest cases follow.The first line of each test case contains 3 integers,H,W, andR. The nextRlines each contain 2 integers each,randc, the row and column numbers of one rock. You may assume that (1, 1) and (H,W) never contain rocks and that no two rocks are at the same position.OutputFor each test case, output a single line of output, prefixed by \"Case #X: \", whereXis the 1-based case number, followed by a single integer indicating the number of ways of reaching the goal, modulo 10007.Limits1 ≤N≤ 1000 ≤R≤ 101 ≤W≤ 1081 ≤H≤ 1081 ≤r≤ H1 ≤c≤ WExampleInput:5\r\n1 1 0\r\n4 4 1\r\n2 1\r\n3 3 0\r\n7 10 2\r\n1 2\r\n7 1\r\n4 4 1\r\n3 2Output:Case #1: 1\r\nCase #2: 2\r\nCase #3: 0\r\nCase #4: 5\r\nCase #5: 1",
  "sample_input": "Input:5\r\n1 1 0\r\n4 4 1\r\n2 1\r\n3 3 0\r\n7 10 2\r\n1 2\r\n7 1\r\n4 4 1\r\n3 2Output:Case #1: 1\r\nCase #2: 2\r\nCase #3: 0\r\nCase #4: 5\r\nCase #5: 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/IE4",
  "scraped_at": "2025-08-17 00:33:30"
}