{
  "problem_code": "problems",
  "title": "Finding the Tesserect",
  "tags": [],
  "text": "Dr. Bruce Banner had estimated a coarse location of Tesseract through  gamma radiation emission tracing experiment. It was estimated that  Tesseract was hidden somewhere within the Alps mountains. Captain  America was given the assignment to look for the Tesseract and bring it  back to S.H.I.E.L.D. While roaming through the mountains of Alps, Captain America looked at the height of hills and clicked a panoramic photograph of mountains. This gives an idea of the heights of mountains.  Meanwhile Banner was able to determine a continuous pattern of  mountains behind which the Tesseract lies and transmitted a message  containing the pattern.The message is a string consisting of characters'G', 'L'and'E'whereGmeans greater,Lmeans less andEmeans equal. But this estimation is likely to go wrong due to not  considering environmental disturbances that may have arisen in the  medium during the experiment.Pattern estimate is correct only if one can find a set of consecutive heights out of the givenNheights satisfying the message pattern (ifGis first character of the message string then second height should be  greater than the first height of the selected set and so on) Captain  America seeks your help to find out whether the estimation is correct or  wrong so that Captain America could proceed his tasks.InputThe first line of the input contains an integerTdenoting the number of test cases. Each test case consists of 3 lines. The first line of each test case contains a single integerNdenoting the number of hills. Second line of each test case consists ofNintegers(a_1, a_2 ... a_n), the heights of hills. Third line contains the message pattern.1≤T≤1052≤N≤1051≤a_i≤1091≤Length of Message Pattern≤N-1OutputFor each test case print'YES'if the pattern estimation is correct. Else print'NO'.ExampleInput:1\r\n5\r\n1 2 3 4 1\r\nGGLOutput:YESExplanationAnswer is \"YES\", because 2 3 4 1 satisfies GGL pattern, i.e. 3 is greater than 2, 4 is greater than 3, 1 is less than 4.",
  "sample_input": "Input:1\r\n5\r\n1 2 3 4 1\r\nGGLOutput:YES",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TESSER",
  "scraped_at": "2025-08-17 00:33:46"
}