{
  "problem_code": "problems",
  "title": "Simple Arithmetics",
  "tags": [],
  "text": "One part of the new WAP portal is also a calculator computing expressions\r\nwith very long numbers. To make the output look better, the result is\r\nformated the same way as is it usually used with manual calculations.Your task is to write the core part of this calculator. Given two numbers and\r\nthe requested operation, you are to compute the result and print it in the\r\nform specified below. With addition and subtraction, the numbers are written\r\nbelow each other. Multiplication is a little bit more complex: first of all, we\r\nmake a partial result for every digit of one of the numbers, and then sum the\r\nresults together.InputThere is a single positive integerTon the first line of input (equal to about 1000). It stands\r\nfor the number of expressions to follow. Each expression consists of a single\r\nline containing a positive integer number, an operator (one of+,-and*) and the second positive integer number. Every number has\r\nat most 500 digits. There are no spaces on the line. If the operation is\r\nsubtraction, the second number is always lower than the first one. No number\r\nwill begin with zero.OutputFor each expression, print two lines with two given numbers, the second\r\nnumber below the first one, last digits (representing unities) must be\r\naligned in the same column. Put the operator right in front of the first\r\ndigit of the second number. After the second number, there must be\r\na horizontal line made of dashes (-).For each addition or subtraction, put the result right below the horizontal\r\nline, with last digit aligned to the last digit of both operands.For each multiplication, multiply the first number by each digit of the\r\nsecond number. Put the partial results one below the other, starting with the\r\nproduct of the last digit of the second number. Each partial result should be\r\naligned with the corresponding digit.\r\nThat means the last digit of the partial product must be in the same column\r\nas the digit of the second number. No product may begin with any additional\r\nzeros. If a particular digit is zero, the product has exactly one digit --\r\nzero. If the second number has more than one digit, print another horizontal\r\nline under the partial results, and then print the sum of them.There must be minimal number of spaces on the beginning of lines, with\r\nrespect to other constraints. The horizontal line is always as long as\r\nnecessary to reach the left and right end of both numbers (and operators)\r\ndirectly below and above it. That means it begins in the same column where the\r\nleftmost digit or operator of that two lines (one below and one above) is. It\r\nends in the column where is the rightmost digit of that two numbers. The line\r\ncan be neither longer nor shorter than specified.Print one blank line after each test case, including the last one.ExampleSample Input:4\r\n12345+67890\r\n324-111\r\n325*4405\r\n1234*4Sample Output:12345\r\n+67890\r\n------\r\n 80235\r\n\r\n 324\r\n-111\r\n----\r\n 213\r\n\r\n    325\r\n  *4405\r\n  -----\r\n   1625\r\n     0\r\n 1300\r\n1300\r\n-------\r\n1431625\r\n\r\n1234\r\n  *4\r\n----\r\n4936Warning: large Input/Output data, be careful with certain languages.",
  "sample_input": "4\r\n12345+67890\r\n324-111\r\n325*4405\r\n1234*4",
  "sample_output": "12345\r\n+67890\r\n------\r\n 80235\r\n\r\n 324\r\n-111\r\n----\r\n 213\r\n\r\n    325\r\n  *4405\r\n  -----\r\n   1625\r\n     0\r\n 1300\r\n1300\r\n-------\r\n1431625\r\n\r\n1234\r\n  *4\r\n----\r\n4936",
  "link": "https://www.spoj.com/problems/ARITH",
  "scraped_at": "2025-08-17 00:33:44"
}