{
  "problem_code": "problems",
  "title": "The Bulk!",
  "tags": [],
  "text": "ACM uses a new special technology of building its transceiver stations. This technology is calledModular Cuboid Architecture(MCA) and is covered by a patent of Lego company. All parts of the transceiver are shipped in unit blocks that have the form of cubes of exactly the same size. The cubes can be then connected to each other. The MCA is modular architecture, that means we can select preferred transceiver configuration and buy only those components we need .The cubes must be always connected \"face-to-face\", i.e. the whole side of one cube is connected to the whole side of another cube. One cube can be thus connected to at most six other units. The resulting equipment, consisting of unit cubes is calledThe Bulkin the communication technology slang.Sometimes, an old and unneeded bulk is condemned, put into a storage place, and replaced with a new one. It was recently found that ACM has many of such old bulks that just occupy space and are no longer needed. The director has decided that all such bulks must be disassembled to single pieces to save some space. Unfortunately, there is no documentation for the old bulks and nobody knows the exact number of pieces that form them. You are to write a computer program that takes the bulk description and computes the number of unit cubes.Each bulk is described by its faces (sides). A special X-ray based machine was constructed that is able to localise all faces of the bulk in the space, even the inner faces, because the bulk can be partially hollow (it can contain empty spaces inside). But any bulk must be connected (i.e. it cannot drop into two pieces) and composed of whole unit cubes.InputThere is a single positive integerTon the first line of input (equal to about 1000). It stands for the number of bulks to follow. Each bulk description begins with a line containing single positive integerF, 6 ≤F≤ 250, stating the number of faces. Then there areFlines, each containing one face description. All faces of the bulk are always listed, in any order. Any face may be divided into several distinct parts and described like if it was more faces. Faces do not overlap. Every face has one inner side and one outer side. No side can be \"partially inner and partially outer\".Each face is described on a single line. The line begins with an integer numberPstating the number of points that determine the face, 4 ≤P≤ 200. Then there are 3x Pnumbers, coordinates of the points. Each point is described by three coordinatesX,Y,Z(0 ≤X,Y,Z≤ 1000) separated by spaces. The points are separated from each other and from the numberPby two space characters. These additional spaces were added to make the input more human readable. The face can be constructed by connecting the points in the specified order, plus connecting the last point with the first one.The face is always composed of \"unit squares\", that means every edge runs either inX,YorZ-axis direction. If we take any two neighbouring pointsX1,Y1,Z1andX2,Y2,Z2, then the points will always differ in exactly one of the three coordinates. I.e. it is eitherX1≠X2, orY1≠Y2, orZ1≠Z2, other two coordinates are the same. Every face lies in an orthogonal plane, i.e. exactly one coordinate is always the same for all points of the face. The face outline will never touch nor cross itself.OutputYour program must print a single line for every test case. The line must contain the sentenceThe bulk is composed ofVunits., whereVis the volume of the bulk.ExampleSample Input:2\r\n12\r\n4  10 10 10  10 10 20  10 20 20  10 20 10\r\n4  20 10 10  20 10 20  20 20 20  20 20 10\r\n4  10 10 10  10 10 20  20 10 20  20 10 10\r\n4  10 20 10  10 20 20  20 20 20  20 20 10\r\n4  10 10 10  10 20 10  20 20 10  20 10 10\r\n5  10 10 20  10 20 20  20 20 20  20 15 20  20 10 20\r\n4  14 14 14  14 14 16  14 16 16  14 16 14\r\n4  16 14 14  16 14 16  16 16 16  16 16 14\r\n4  14 14 14  14 14 16  16 14 16  16 14 14\r\n4  14 16 14  14 16 16  16 16 16  16 16 14\r\n4  14 14 14  14 16 14  16 16 14  16 14 14\r\n4  14 14 16  14 16 16  16 16 16  16 14 16\r\n12\r\n4  20 20 30  20 30 30  30 30 30  30 20 30\r\n4  10 10 10  10 40 10  40 40 10  40 10 10\r\n6  10 10 20  20 10 20  20 30 20  30 30 20  30 40 20  10 40 20\r\n6  20 10 20  20 20 20  30 20 20  30 40 20  40 40 20  40 10 20\r\n4  10 10 10  40 10 10  40 10 20  10 10 20\r\n4  10 40 10  40 40 10  40 40 20  10 40 20\r\n4  20 20 20  30 20 20  30 20 30  20 20 30\r\n4  20 30 20  30 30 20  30 30 30  20 30 30\r\n4  10 10 10  10 40 10  10 40 20  10 10 20\r\n4  40 10 10  40 40 10  40 40 20  40 10 20\r\n4  20 20 20  20 30 20  20 30 30  20 20 30\r\n4  30 20 20  30 30 20  30 30 30  30 20 30Sample Output:The bulk is composed of 992 units.\r\nThe bulk is composed of 10000 units.Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "2\r\n12\r\n4  10 10 10  10 10 20  10 20 20  10 20 10\r\n4  20 10 10  20 10 20  20 20 20  20 20 10\r\n4  10 10 10  10 10 20  20 10 20  20 10 10\r\n4  10 20 10  10 20 20  20 20 20  20 20 10\r\n4  10 10 10  10 20 10  20 20 10  20 10 10\r\n5  10 10 20  10 20 20  20 20 20  20 15 20  20 10 20\r\n4  14 14 14  14 14 16  14 16 16  14 16 14\r\n4  16 14 14  16 14 16  16 16 16  16 16 14\r\n4  14 14 14  14 14 16  16 14 16  16 14 14\r\n4  14 16 14  14 16 16  16 16 16  16 16 14\r\n4  14 14 14  14 16 14  16 16 14  16 14 14\r\n4  14 14 16  14 16 16  16 16 16  16 14 16\r\n12\r\n4  20 20 30  20 30 30  30 30 30  30 20 30\r\n4  10 10 10  10 40 10  40 40 10  40 10 10\r\n6  10 10 20  20 10 20  20 30 20  30 30 20  30 40 20  10 40 20\r\n6  20 10 20  20 20 20  30 20 20  30 40 20  40 40 20  40 10 20\r\n4  10 10 10  40 10 10  40 10 20  10 10 20\r\n4  10 40 10  40 40 10  40 40 20  10 40 20\r\n4  20 20 20  30 20 20  30 20 30  20 20 30\r\n4  20 30 20  30 30 20  30 30 30  20 30 30\r\n4  10 10 10  10 40 10  10 40 20  10 10 20\r\n4  40 10 10  40 40 10  40 40 20  40 10 20\r\n4  20 20 20  20 30 20  20 30 30  20 20 30\r\n4  30 20 20  30 30 20  30 30 30  30 20 30",
  "sample_output": "The bulk is composed of 992 units.\r\nThe bulk is composed of 10000 units.",
  "link": "https://www.spoj.com/problems/BULK",
  "scraped_at": "2025-08-17 00:33:48"
}