{
  "problem_code": "problems",
  "title": "Direct Visibility",
  "tags": [],
  "text": "Building the GSM network is a very expensive and complex task. Moreover,\r\nafter theBase Transceiver Stations(BTS) are built and\r\nworking, we need to perform many various measurements to determine the state\r\nof the network, and propose effective improvements to be made.The ACM technicians have a special equipment for measuring the strength of\r\nelectro-magnetic fields, the transceivers' power and quality of the signal.\r\nThis equipment is packed into a huge knapsack and the technician must move\r\nwith it from one BTS to another. Unfortunately, the knapsack have not enough\r\nmemory for storing all of the measured values. It has a small cache only,\r\nthat can store values for several seconds. Then the values must be\r\ntransmitted to the BTS by an infrared connection (IRDA). The IRDA needs\r\ndirect visibility between the technician and the BTS.Your task is to find the path between two neighbouring BTSes such that at\r\nleast one of those BTSes is always visible.InputThere is a single positive integerTon the first line of input (equal to about 500). It stands\r\nfor the number of test cases to follow. Each test case consists of a town\r\ndescription. For simplicity, a town is modelled as a rectangular grid ofP x Qsquare fields. Each field is exactly 1 metre wide. For each\r\nfield, a non-negative integerZi,jis given, representing the height of\r\nthe terrain in that place, in metres. That means the town model is made of\r\ncubes, each of them being either solid or empty. There are no \"half solid\"\r\ncubes.The first line of each test case contains two integer numbersPandQ,\r\nseparated by a single space, \r\n1 <=P,Q<= 200. Then there arePlines\r\neach containingQinteger numbers separated by a space. These numbers areZi,j, where \r\n1 <=i<=P, \r\n1 <=j<=Qand\r\n\r\n0 <=Zi,j<= 5000. After the terrain\r\ndescription, there are four numbersR1,C1,R2,C2on the last line of\r\neach test case. These numbers represent position of two\r\nBTSes, \r\n1 <=R1,R2<=P, \r\n1 <=C1,C2<=Q. The first coordinate\r\n(R) determines the row of the town, the second coordinate determines the\r\ncolumn.The technician is moving in steps (stepsstands forStandard Technician's Elementary Positional Shift). Each step is made\r\nbetween two neighbouring square fields. That means the step is always in\r\nNorth, South, West or East direction. It is not possible to move diagonally.\r\nThe step between two fieldsAandB(step fromAtoB) is allowed\r\nonly if the height of the terrain in the fieldBis not very different from\r\nthe height in the fieldA. The technician can climb at most 1 metre up or\r\ndescend at most 3 metres down in a single step.At the end of each step, at least one of the two BTSes must be visible.\r\nHowever, there can be some point \"in the middle of the step\" where no BTS\r\nis visible. This is OK and the data is handled by the cache. The BTS is\r\nconsidered visible, if there is a direct visibility between the unit cube\r\njust above the terrain on the BTSes coordinates and the cube just above the\r\nterrain on the square field, where the technician is. Direct visibility\r\nbetween two cubes means that the line connecting the centres of the two cubes\r\ndoes not intersect any solid cube. However, the line can touch any number of\r\nsolid cubes. In other words, consider both the BTS and the technician being\r\npoints exactly half metre above the surface and in the centre of the\r\nappropriate square field.Note that the IRDA beam can go between two cubes that touch each other by\r\ntheir edge, although there is no space between them. It is because such\r\na beam touches both of these two cubes but does not intersect any of\r\nthem. See the last test case of the sample input for an example of such\r\na situation.OutputYou are to find the shortest possible path from BTS (R1,C1) to BTS (R2,C2), meeting the above criteria. All\r\nsteps must be done between neighbouring fields, the terrain must not elevate\r\nor descend too much, and at the end of each step, at least one BTS must be\r\nvisible.For each test case, print one line containing the sentenceThe shortest path isMsteps long., whereMis the number of\r\nsteps that must be made. If there is no such path, output the sentenceMission impossible!.ExampleSample Input:4\r\n5 5\r\n8 7 6 5 4\r\n2 2 2 2 2\r\n2 2 2 2 2\r\n2 2 2 2 2\r\n2 2 2 2 2\r\n1 1 5 1\r\n5 8\r\n2 2 2 2 2 2 2 2\r\n2 2 2 2 2 2 2 2\r\n2 2 2 2 2 2 2 2\r\n9 9 9 9 9 9 9 2\r\n2 2 2 2 2 2 2 2\r\n1 2 5 1\r\n5 8\r\n2 2 2 2 2 2 2 2\r\n2 2 2 2 2 2 2 2\r\n2 2 2 2 2 2 2 2\r\n9 9 9 9 9 9 9 2\r\n2 2 2 2 2 2 2 2\r\n1 5 5 1\r\n6 12\r\n5 5 5 5 1 5 5 5 5 5 5 5\r\n5 5 5 5 1 5 5 5 5 5 5 5\r\n5 5 5 5 9 5 5 5 5 5 5 5\r\n5 9 1 5 5 5 5 5 5 5 5 5\r\n5 5 9 5 5 5 5 5 5 5 5 5\r\n5 5 9 5 5 5 5 5 5 5 5 5\r\n6 1 3 12Sample Output:The shortest path is 10 steps long.\r\nMission impossible!\r\nThe shortest path is 14 steps long.\r\nThe shortest path is 18 steps long.",
  "sample_input": "4\r\n5 5\r\n8 7 6 5 4\r\n2 2 2 2 2\r\n2 2 2 2 2\r\n2 2 2 2 2\r\n2 2 2 2 2\r\n1 1 5 1\r\n5 8\r\n2 2 2 2 2 2 2 2\r\n2 2 2 2 2 2 2 2\r\n2 2 2 2 2 2 2 2\r\n9 9 9 9 9 9 9 2\r\n2 2 2 2 2 2 2 2\r\n1 2 5 1\r\n5 8\r\n2 2 2 2 2 2 2 2\r\n2 2 2 2 2 2 2 2\r\n2 2 2 2 2 2 2 2\r\n9 9 9 9 9 9 9 2\r\n2 2 2 2 2 2 2 2\r\n1 5 5 1\r\n6 12\r\n5 5 5 5 1 5 5 5 5 5 5 5\r\n5 5 5 5 1 5 5 5 5 5 5 5\r\n5 5 5 5 9 5 5 5 5 5 5 5\r\n5 9 1 5 5 5 5 5 5 5 5 5\r\n5 5 9 5 5 5 5 5 5 5 5 5\r\n5 5 9 5 5 5 5 5 5 5 5 5\r\n6 1 3 12",
  "sample_output": "The shortest path is 10 steps long.\r\nMission impossible!\r\nThe shortest path is 14 steps long.\r\nThe shortest path is 18 steps long.",
  "link": "https://www.spoj.com/problems/DIRVS",
  "scraped_at": "2025-08-17 00:33:54"
}