{
  "problem_code": "problems",
  "title": "Complicated Expressions",
  "tags": [],
  "text": "The most important activity of ACM is the GSM network. As the mobile phone\r\noperator, ACM must build its own transmitting stations. It is very important\r\nto compute the exact behaviour of electro-magnetic waves. Unfortunately,\r\nprediction of electro-magnetic fields is a very complex task and the\r\nformulas describing them are very long and hard-to-read. For\r\nexample, Maxwell's Equations describing the basic laws of\r\nelectrical engineering are really tough.ACM has designed its own computer system that can make some field\r\ncomputations and produce results in the form of mathematic expressions.\r\nUnfortunately, by generating the expression in several steps, there are\r\nalways some unneeded parentheses inside the expression. Your task is to take\r\nthese partial results and make them \"nice\" by removing all unnecessary\r\nparentheses.InputThere is a single positive integerTon the first line of input (equal to about 10000). It stands\r\nfor the number of expressions to follow. Each expression consists of a single\r\nline containing only lowercase letters, operators (+,-,*,/) and parentheses ((and)). The letters are variables\r\nthat can have any value, operators and parentheses have their usual meaning.\r\nMultiplication and division have higher priority then subtraction and\r\naddition. All operations with the same priority are computed from left to\r\nright (operators are left-associative). There are no spaces inside the\r\nexpressions. No input line contains more than 250 characters.OutputPrint a single line for every expression. The line must contain the same\r\nexpression with unneeded parentheses removed. You must remove as many\r\nparentheses as possible without changing the semantics of the expression.\r\nThe semantics of the expression is considered the same if and only if any of\r\nthe following conditions hold:The ordering of operations remains the same. That means \"(a+b)+c\" is\r\n  the same as \"a+b+c\", and \"a+(b/c)\" is the same as \"a+b/c\".The order of some operations is swapped but the result remains unchanged\r\n  with respect to the addition and multiplication associativity.\r\n  That means \"a+(b+c)\" and \"(a+b)+c\" are the same. We can also combine\r\n  addition with subtraction and multiplication with division, if the\r\n  subtraction or division is the second operation. For example, \"a+(b-c)\"\r\n  is the same as \"a+b-c\".You cannot use any other laws, namely you cannot swap left and right\r\noperands and you cannot replace \"a-(b-c)\" with \"a-b+c\".ExampleSample Input:8\r\n(a+(b*c))\r\n((a+b)*c)\r\n(a*(b*c))\r\n(a*(b/c)*d)\r\n((a/(b/c))/d)\r\n((x))\r\n(a+b)-(c-d)-(e/f)\r\n(a+b)+(c-d)-(e+f)Sample Output:a+b*c\r\n(a+b)*c\r\na*b*c\r\na*b/c*d\r\na/(b/c)/d\r\nx\r\na+b-(c-d)-e/f\r\na+b+c-d-(e+f)",
  "sample_input": "8\r\n(a+(b*c))\r\n((a+b)*c)\r\n(a*(b*c))\r\n(a*(b/c)*d)\r\n((a/(b/c))/d)\r\n((x))\r\n(a+b)-(c-d)-(e/f)\r\n(a+b)+(c-d)-(e+f)",
  "sample_output": "a+b*c\r\n(a+b)*c\r\na*b*c\r\na*b/c*d\r\na/(b/c)/d\r\nx\r\na+b-(c-d)-e/f\r\na+b+c-d-(e+f)",
  "link": "https://www.spoj.com/problems/CMEXPR",
  "scraped_at": "2025-08-17 00:33:29"
}