{
  "problem_code": "problems",
  "title": "The Game of Master",
  "tags": [],
  "text": "If you want to buy a new cellular phone, there are many various types to\r\nchoose from. To decide which one is the best for you, you have to consider\r\nseveral important things: its size and weight, battery capacity, WAP support,\r\ncolour, price. One of the most important things is also the list of games the\r\nphone provides. Nokia is one of the most successful phone makers because of\r\nits famous Snake and Snake II. ACM wants to make and sell its own phone and\r\nthey need to program several games for it. One of them is Master-Mind, the\r\nfamous board logical game.The game is played between two players. One of them chooses asecret codeconsisting ofPordered pins, each of them having one of the predefined set ofCcolours. The goal of the second player is to guess that secret sequence of\r\ncolours. Some colours may not appear in the code, some colours may appear more\r\nthan once.The player makes guesses, which are formed in the same way as the secret\r\ncode. After each guess, he/she is provided with an information on how\r\nsuccessful the guess was. This feedback is called ahint. Each hint\r\nconsists ofBblack points andWwhite points. The black point stands for\r\nevery pin that was guessed right, i.e. the right colour was put on the right\r\nposition. The white point means right colour but on the wrong position. For\r\nexample, if the secret code is \"white, yellow, red, blue, white\" and the\r\nguess was \"white, red, white, white, blue\", the hint would consist of one\r\nblack point (for the white on the first position) and three white points\r\n(for the other white, red and blue colours). The goal is to guess the\r\nsequence with the minimal number of hints.The new ACM phone should have the possibility to play both roles. It can make\r\nthe secret code and give hints, but it can also make its own guesses. Your\r\ngoal is to write a program for the latter case, that means a program that\r\nmakes Master-Mind guesses.InputThere is a single positive integerTon the first line of input. It stands\r\nfor the number of test cases to follow. Each test case describes one game\r\nsituation and you are to make a guess. On the first line of each test case,\r\nthere are three integer numbers,P,CandM.P(1 ≤P≤ 10) is\r\nthe number of pins,C(1 ≤C≤ 100) is the number of colours, andM(1 ≤M≤ 100) is the number of already played guesses.Then there are 2 ×Mlines, two lines for every guess. At the first line of\r\neach guess, there arePinteger numbers representing colours of the guess.\r\nEach colour is represented by a numberGi,\r\n1 ≤Gi≤C. The second\r\nline contains two integer numbers,BandW, stating for the number of\r\nblack and white points given by the corresponding hint.Let's have a secret codeS1,S2...SPand the guessG1,G2...GP. Then we can make a setHcontaining pairs of numbers\r\n(I,J) such thatSI=GJ, and that any number can appear at most once on\r\nthe first position and at most once on the second position. That means for\r\nevery two different pairs from that set, (I1,J1) and (I2,J2), we\r\nhaveI1≠I2andJ1≠J2. Then we denoteB(H) the number of\r\npairs in the set, that meet the conditionI=J, andW(H) the number of\r\npairs withI≠J.We define an ordering of every two possible setsH1andH2. Let's sayH1≤H2if and only if one of the following holds:B(H1) <B(H2), orB(H1) =B(H2) andW(H1) ≤W(H2)Then we can find a maximal setHmaxaccording to this ordering. The\r\nnumbersB(Hmax) andW(Hmax) are the black and white points for that\r\nhint.OutputFor every test case, print the line containingPnumbers representingPcolours of the next guess. Your guess must be valid according to all previous\r\nguesses and hints. The guess is valid if the sequence could be a secret code,\r\ni.e. the sequence was not eliminated by previous guesses and hints.If there is no valid guess possible, output the sentenceYou are cheating!. If there are more valid guesses, output the one\r\nthat is lexicographically smallest. I.e. find such guessGthat for every\r\nother valid guessVthere exists such a numberIthat:GJ=VJfor everyJ<I, andGI<VI.ExampleInput:3\r\n4 3 2\r\n1 2 3 2\r\n1 1\r\n2 1 3 2\r\n1 1\r\n4 6 2\r\n3 3 3 3\r\n3 0\r\n4 4 4 4\r\n2 0\r\n8 9 3\r\n1 2 3 4 5 6 7 8\r\n0 0\r\n2 3 4 5 6 7 8 9\r\n1 0\r\n3 4 5 6 7 8 9 9\r\n2 0Output:1 1 1 3\r\nYou are cheating!\r\n9 9 9 9 9 9 9 9Warning: large Input/Output data, be careful with certain languages.",
  "sample_input": "Input:3\r\n4 3 2\r\n1 2 3 2\r\n1 1\r\n2 1 3 2\r\n1 1\r\n4 6 2\r\n3 3 3 3\r\n3 0\r\n4 4 4 4\r\n2 0\r\n8 9 3\r\n1 2 3 4 5 6 7 8\r\n0 0\r\n2 3 4 5 6 7 8 9\r\n1 0\r\n3 4 5 6 7 8 9 9\r\n2 0Output:1 1 1 3\r\nYou are cheating!\r\n9 9 9 9 9 9 9 9",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MMIND",
  "scraped_at": "2025-08-17 00:33:32"
}