{
  "problem_code": "problems",
  "title": "Help the Military Recruitment Office!",
  "tags": [],
  "text": "At the end of year 2004, the regional agencies of the Polish Military Recruitment Office (known as WKU in Polish) is sending a call to all boys born in 1984. Every recruit has his personal 11-digit identification number (PESEL, format: YYMMDDXXXXX, where YYMMDD is the date of birth, and XXXXX is a zero-padded integer smaller than 100000). Every agency of the Military Recruitment Office has its own code (MRO, format: a place code consisting of 3 upper case letters and a one-digit number). But this year the army underwent some reforms and not all boys at conscription age are going to be recruited. \r\nThe list of closed down MRO points is as follows: the code of the closed down MRO is followed by the code of some other MRO, to which all the recruits are now going to be assigned. The list of recruits contains their PESEL codes. Your task is to prepare the complete list of \r\nrecruits and determine the codes of their new MRO-s.Inputs[the number of tests ≤10]p[the number of boys at conscription age ≤100000]PESEL and MRO codez[the number of closed down MRO points ≤100000]old_code new_code[old_code - the code of closed down MRO,\r\nnew_code - its new MRO code]p[the number of recruits ≤100000]PESEL[PESEL code of recruit]\r\n[empty line]\r\n[next tests]Outputone PESEL and MRO code per line in the order of input\r\n[empty line between tests]\r\n[other results]ExampleInput:\r\n1\r\n4\r\n84101011111 GDA1\r\n84010122222 GDA2\r\n84010233333 GDA2\r\n84020255555 GDY1\r\n1\r\nGDA2 GDA1\r\n3\r\n84101011111\r\n84010122222\r\n84020255555\r\n\r\nOutput:\r\n84101011111 GDA1\r\n84010122222 GDA1\r\n84020255555 GDY1Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "s[the number of tests ≤10]p[the number of boys at conscription age ≤100000]PESEL and MRO codez[the number of closed down MRO points ≤100000]old_code new_code[old_code - the code of closed down MRO,\r\nnew_code - its new MRO code]p[the number of recruits ≤100000]PESEL[PESEL code of recruit]\r\n[empty line]\r\n[next tests]",
  "sample_output": "one PESEL and MRO code per line in the order of input\r\n[empty line between tests]\r\n[other results]",
  "link": "https://www.spoj.com/problems/HMRO",
  "scraped_at": "2025-08-17 00:33:45"
}