{
  "problem_code": "problems",
  "title": "The Bytelandian Cryptographer (Act IV)",
  "tags": [],
  "text": "The Bytelandian Cryptographer has been requested by the BBFO to put forward an encryption scheme which would allow the BBFO to communicate with its foreign associates. After some intensive studies, he has decided upon the Vigenďż˝re cipher. Messages written using 26 upper case characters of the Latin alphabet: A, B, ..., Z which are interpreted as integers 0,1, ..., 25 respectively. The secret cypher for transmitting a message is known to both sides and consists of n integers k1, k2,...,kn. Using this cypher, the i-th number xiof the input message x is encrypted to the form of the i-th number of the output message y, as follows:yi=(xi+k1+ ((i-1) mod n)) mod 26.You are trying to find out the content of a message transmitted by the BBFO. By a lucky stroke of fortune, your spies managed to intercept the message in both its plaintext and encrypted form (x and y respectively). Unfortunately, during their dramatic escape the files they were carrying where pierced by bullets and fragments of messages x and y were inadvertently lost. Or were they? It is your task to reconstruct as much of message x as you possibly can.InputThe first line of input contains a single integer t<=200 denoting the number of test cases. t test case descriptions follow.For each test case, the first line contains one integer m which is some upper bound on the length of the cypher (1<=n<=m<=100000). The second line of input contains the original message x, while the third line contains the encrypted message y. The messages are expressed using characters 'A'-'Z' (interpreted as integers 0-25) and '*' (denoting a single character illegible due to damage). The total length of the input file is not more than 2MB.OutputFor each test case output a single line containing the original message x, with asterisks '*' in place of only those characters whose value cannot be determined.ExampleInput:4\r\n1\r\nA*X*C\r\n**CM*\r\n4\r\n*B***A\r\nAAAAAA\r\n6\r\n*B***A\r\nAAAAAA\r\n4\r\n*AA*******\r\nAAAAAAAAAAOutput:A*XHC\r\n*BA*BA\r\n*B***A\r\n*AA**A****Warning: large Input/Output data, be careful with certain languages.The time limit is strict for this problem.",
  "sample_input": "Input:4\r\n1\r\nA*X*C\r\n**CM*\r\n4\r\n*B***A\r\nAAAAAA\r\n6\r\n*B***A\r\nAAAAAA\r\n4\r\n*AA*******\r\nAAAAAAAAAAOutput:A*XHC\r\n*BA*BA\r\n*B***A\r\n*AA**A****",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CRYPTO4",
  "scraped_at": "2025-08-17 00:33:30"
}