{
  "problem_code": "problems",
  "title": "Piggy",
  "tags": [],
  "text": "Before ACM can do anything, a budget must be prepared and the necessary\r\nfinancial support obtained. The main income for this action comes from\r\nIrreversibly Bound Money (IBM). The idea behind is simple. Whenever\r\nsome ACM member has any small money, he takes all the coins and throws them\r\ninto a piggy-bank. You know that this process is irreversible, the coins\r\ncannot be removed without breaking the pig. After a sufficiently long\r\ntime, there should be enough cash in the piggy-bank to pay everything that\r\nneeds to be paid.But there is a big problem with piggy-banks. It is not possible to\r\ndetermine how much money is inside. So we might break the pig into\r\npieces only to find out that there is not enough money.  Clearly, we want to\r\navoid this unpleasant situation. The only possibility is to weigh the\r\npiggy-bank and try to guess how many coins are inside. Assume that we\r\nare able to determine the weight of the pig exactly and that we know\r\nthe weights of all coins of a given currency. Then there is some\r\nminimum amount of money in the piggy-bank that we can guarantee. Your task\r\nis to find out this worst case and determine the minimum amount of\r\ncash inside the piggy-bank. We need your help. No more prematurely\r\nbroken pigs!InputThe input consists ofTtest cases. The number of them (T) is given on\r\nthe first line of the input file.\r\nEach test case begins with a line containing two integersEandF. They\r\nindicate the weight of an empty pig and of the pig filled with coins. Both\r\nweights are given in grams. No pig will weigh more than 10 kg, that means1 <= E <= F <= 10000. On the second line of each test\r\ncase, there is an integer numberN(1 <= N <= 500) that gives the number of various\r\ncoins used in the given currency. Following this are exactlyNlines,\r\neach specifying one coin type. These lines contain two integers each,PandW(1 <= P <= 50000,1 <= W <=10000).Pis the value of the\r\ncoin in monetary units,Wis it's weight in grams.OutputPrint exactly one line of output for each test case. The line must contain\r\nthe sentence \r\n\"The minimum amount of money in the piggy-bank isX.\"\r\nwhereXis\r\nthe minimum amount of money that can be achieved using coins with\r\nthe given total weight. If the weight cannot be reached exactly,\r\nprint a line \"This is impossible.\".ExampleSample Input:\r\n3\r\n10 110\r\n2\r\n1 1\r\n30 50\r\n10 110\r\n2\r\n1 1\r\n50 30\r\n1 6\r\n2\r\n10 3\r\n20 4\r\n\r\nSample output:\r\nThe minimum amount of money in the piggy-bank is 60.\r\nThe minimum amount of money in the piggy-bank is 100.\r\nThis is impossible.",
  "sample_input": "Sample Input:\r\n3\r\n10 110\r\n2\r\n1 1\r\n30 50\r\n10 110\r\n2\r\n1 1\r\n50 30\r\n1 6\r\n2\r\n10 3\r\n20 4\r\n\r\nSample output:\r\nThe minimum amount of money in the piggy-bank is 60.\r\nThe minimum amount of money in the piggy-bank is 100.\r\nThis is impossible.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PIGBANK",
  "scraped_at": "2025-08-17 00:33:46"
}