{
  "problem_code": "problems",
  "title": "A Needle in the Haystack",
  "tags": [],
  "text": "Write a program that finds all occurences of a given pattern in a given input string. This is often referred to as finding aneedlein ahaystack.The program has to detectalloccurences of the needle in the haystack. It should take the needle and the haystack as input, and output the positions of each occurence, as shown below.\r\nThe suggested implementation is the KMP algorithm, but this is not a requirement. However, a naive approach will probably exceed the time limit, whereas other algorithms are more complicated... The choice is yours.InputThe input consists of a number of test cases. Each test case is composed of three lines, containing:the length of the needle,the needle itself,the haystack.The length of the needle is only limited by the memory available to your program, so do not make any assumptions - instead, read the length and allocate memory as needed. The haystack isnotlimited in size, which implies that your program should not read the whole haystack at once. The KMP algorithm is stream-based, i.e. it processes the haystack character by character, so this is not a problem.The test cases come one after another, each occupying three lines, with no additional space or line breaks in between.OutputFor each test case your program should output all positions of the needle's occurences within the haystack. If a match is found, the output should contain the position of the first character of the match. Characters in the haystack are numbered starting with zero.For a given test case, the positions output should be sorted in ascending order, and each of these should be printed in a separate line. For two different test cases, the positions should be separated by an empty line.ExampleSample input:2\r\nna\r\nbanananobano\r\n6\r\nfoobar\r\nfoo\r\n9\r\nfoobarfoo\r\nbarfoobarfoobarfoobarfoobarfooSample output:2\r\n4\r\n\r\n3\r\n9\r\n15\r\n21Note the double empty line in the output, which means that no match was found for the second test case.Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Sample input:2\r\nna\r\nbanananobano\r\n6\r\nfoobar\r\nfoo\r\n9\r\nfoobarfoo\r\nbarfoobarfoobarfoobarfoobarfoo",
  "sample_output": "Sample output:2\r\n4\r\n\r\n3\r\n9\r\n15\r\n21",
  "link": "https://www.spoj.com/problems/NHAY",
  "scraped_at": "2025-08-17 00:33:31"
}