{
  "problem_code": "problems",
  "title": "Bytelandian Blingors Network",
  "tags": [],
  "text": "We have discovered the fastest communication mediumBytelandian scientists announced, and they called itblingors.\r\nThe blingors are incomparably better than other media known before. Many companies in Byteland started to build blingors networks, so the information society in the kingdom of Bytes is fact!\r\nThe priority is to build the core of the blingors network, joinig main cities in the country. \r\nAssume there is some number of cities that will be connected at the beginning. The cost of building blingors connection between two cities depends on many elements, but it has been successfully estimated. \r\nYour task is to design the blingors network connections between some cities in this way that between any pair of cities is a communication route.  The cost of this network should be as small as possible.RemarksThe name of the city is a string of at most 10 letters froma...z.The cost of the connection between two cities is a positive integer.The sum of all connections is not greater than 232-1.The number of cities is not greater than 10 000.Inputs[number of test cases <= 10]n[number of cities <= 10 000]NAME[city name]p[number of neigbouring cities to the cityNAME]neighcost[neigh- the unique number of  city from the main listcost- the cost of building the blingors connection fromNAMEtoneigh]\r\n[empty line between test cases]Output[separate lines]cost[the minimum cost of building the blingors network]ExampleInput:2\r\n\r\n4\r\ngdansk\r\n2\r\n2 1\r\n3 3\r\nbydgoszcz\r\n3\r\n1 1\r\n3 1\r\n4 4\r\ntorun\r\n3\r\n1 3\r\n2 1\r\n4 1\r\nwarszawa\r\n2\r\n2 4\r\n3 1\r\n\r\n3\r\nixowo\r\n2\r\n2 1\r\n3 3\r\niyekowo\r\n2\r\n1 1\r\n3 7\r\nzetowo\r\n2\r\n1 3 \r\n2 7Output:3\r\n4Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "s[number of test cases <= 10]n[number of cities <= 10 000]NAME[city name]p[number of neigbouring cities to the cityNAME]neighcost[neigh- the unique number of  city from the main listcost- the cost of building the blingors connection fromNAMEtoneigh]\r\n[empty line between test cases]",
  "sample_output": "Input:2\r\n\r\n4\r\ngdansk\r\n2\r\n2 1\r\n3 3\r\nbydgoszcz\r\n3\r\n1 1\r\n3 1\r\n4 4\r\ntorun\r\n3\r\n1 3\r\n2 1\r\n4 1\r\nwarszawa\r\n2\r\n2 4\r\n3 1\r\n\r\n3\r\nixowo\r\n2\r\n2 1\r\n3 3\r\niyekowo\r\n2\r\n1 1\r\n3 7\r\nzetowo\r\n2\r\n1 3 \r\n2 7Output:3\r\n4",
  "link": "https://www.spoj.com/problems/BLINNET",
  "scraped_at": "2025-08-17 00:33:52"
}