{
  "problem_code": "problems",
  "title": "Equipment Box",
  "tags": [],
  "text": "There is a large room in the Pyramid calledRoom-of-No-Return. Its\r\nfloor is covered by rectangular tiles of equal size. The name of the room\r\nwas chosen because of the very high number of traps and mechanisms in it.\r\nThe ACM group has spent several years studying the secret plan of this room.\r\nIt has made a clever plan to avoid all the traps. A specially trained\r\nmechanic was sent to deactivate the most feared trap called Shattered Bones.\r\nAfter deactivating the trap the mechanic had to escape from the room.\r\nIt is very important to step on the center of the tiles only; he must\r\nnot touch the edges. One wrong step and a large rock \r\nfalls from the ceiling squashing the mechanic like a pancake. After deactivating\r\nthe trap, he realized a horrible thing: the ACM plan did not take his\r\nequipment box into consideration. The box must be laid onto the\r\nground because the mechanic must have both hands free to prevent contact with\r\nother traps. But when the box is laid on the ground, it could touch the line\r\nseparating the tiles. And this is the main problem you are to solve.InputThe input consists ofTtest cases (T is equal to about 10000). The number of them (T) is given on\r\nthe first line of the input file.\r\nEach test case consists of a single line. The line contains exactly four\r\ninteger numbers separated by spaces:A,B,XandY.AandBindicate the\r\ndimensions of the tiles,XandYare the dimensions of\r\nthe equipment box (1 ≤ A, B, X, Y ≤ 50000).OutputYour task is to determine whether it is possible to put the box on \r\na single tile – that is, if the whole box fits on a single tile without\r\ntouching its border. If so, you are to print one line with the\r\nsentence \"Escape is possible.\". Otherwise print the sentence\r\n\"Box cannot be dropped.\".ExampleInput:2\r\n10 10 8 8\r\n8 8 10 10Output:Escape is possible.\r\nBox cannot be dropped.Warning: large Input/Output data, be careful with certain languages.",
  "sample_input": "Input:2\r\n10 10 8 8\r\n8 8 10 10Output:Escape is possible.\r\nBox cannot be dropped.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/EQBOX",
  "scraped_at": "2025-08-17 00:33:39"
}