{
  "problem_code": "problems",
  "title": "Commedia dell Arte",
  "tags": [],
  "text": "So calledcommedia dell' arteis a theater genre first\r\nplayed in Italy at the beginning of the sixteenth century. It was inspired\r\nwith the Roman Theater. The play had no fixed script and the actors (also\r\ncalledperformers) had to improvise a lot. There were only a simple\r\ndirections by the author like \"enter the stage and make something funny\" or\r\n\"everyone comes on stage and everything is resolved happily\". You can see it\r\nmight be very interesting to play the commedia dell' arte. Therefore\r\nthe ACM want to put a new play on a stage, which was completely unknown\r\nbefore. The main hero has a puzzle that takes a very important role in the\r\nplay and gives an opportunity of many improvisations.\r\n\r\nThe puzzle is the worldwide knownLloyd's Fifteen Puzzle. ACM wants\r\nto make the play more interesting so they want to replace the\r\n\"standard\" puzzle with a three-dimensional one. The puzzle consists\r\nof a cube containingM3slots. Each slot except one\r\ncontains a cubic tile (one position is free).\r\nThe tiles are numbered from1toM3-1.\r\nThe goal of the puzzle is to get the original ordering of\r\nthe tiles after they have been randomly reshuffled. The only allowed\r\nmoves are sliding a neighbouring tile into the free position along one\r\nof the three principal directions. Original configuration is when slot\r\nwith coordinates(x, y, z)from{0...M-1}3contains tile numberz.M2+y.M+x+1and slot(M-1, M-1, M-1)is free.You are to write a program to determine whether it is possible \r\nto solve the puzzle or not.InputThe input consists ofNcases. The first line of the input\r\ncontains only positive integerN. Then follow the cases. The\r\nfirst line of each case contains only one integerM,1 <=\r\nM <= 100. It is the size of 3D puzzle cube. Then followMlines, each contains exactlyM2numbers\r\non the tiles for one layer. First is the layer on the top of the cube and\r\nthe last one on the bottom. In each layer numbers are arranged from the left\r\ntop corner linewise to the right bottom corner of the layer. In other words, \r\nslot with coordinates(x, y, z)is described by the(x+M.y+1)-th number on the(z+1)-th line.\r\nNumbers are separated by space. Number0means free position.OutputFor each case, print exactly one line. \r\nIf the original configuration can be reached by sliding the tiles, \r\nprint the sentence 'Puzzle can be solved.'. Otherwise, print the\r\nsentence 'Puzzle is unsolvable.'.ExampleSample input:\r\n2\r\n2\r\n1 2 3 4\r\n5 7 6 0\r\n2\r\n2 1 3 5\r\n4 6 0 7\r\n\r\nSample output:\r\nPuzzle is unsolvable.\r\nPuzzle can be solved.Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Sample input:\r\n2\r\n2\r\n1 2 3 4\r\n5 7 6 0\r\n2\r\n2 1 3 5\r\n4 6 0 7\r\n\r\nSample output:\r\nPuzzle is unsolvable.\r\nPuzzle can be solved.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/COMMEDIA",
  "scraped_at": "2025-08-17 00:33:39"
}