{
  "problem_code": "problems",
  "title": "Copying Books",
  "tags": [],
  "text": "Before the invention of book-printing, it was very hard to make a copy of a book. All the contents had to be re-written by hand by so calledscribers. The scriber had been given a book and after several months he finished its copy. One of the most famous scribers lived in the 15th century and his name was Xaverius Endricus Remius Ontius Xendrianus (Xerox). Anyway, the work was very annoying and boring. And the only way to speed it up was to hire more scribers.Once upon a time, there was a theater ensemble that wanted to play famous Antique Tragedies. The scripts of these plays were divided into many books and actors needed more copies of them, of course. So they hired many scribers to make copies of these books. Imagine you havembooks (numbered1, 2 ... m) that may have different number of pages (p1, p2... pm) and you want to make one copy of each of them. Your task is to divide these books amongkscribes,k ≤ m. Each book can be assigned to a single scriber only, and every scriber must get a continuous sequence of books. That means, there exists an increasing succession of numbers0 = b0< b1< b2... < bk-1≤ bk= msuch thati-th scriber gets a sequence of books with numbers betweenbi-1+1andbi. The time needed to make a copy of all the books is determined by the scriber who was assigned the most work. Therefore, our goal is to minimize the maximum number of pages assigned to a single scriber. Your task is to find the optimal assignment.InputThe input consists ofNcases (equal to about 200). The first line of the input contains only positive integerN. Then follow the cases. Each case consists of exactly two lines. At the first line, there are two integersmandk,1 ≤ k ≤ m ≤ 500. At the second line, there are integersp1, p2... pmseparated by spaces. All these values are positive and less than 10000000.OutputFor each case, print exactly one line. The line must contain the input successionp1, p2, ... pmdivided into exactlykparts such that the maximum sum of a single part should be as small as possible. Use the slash character ('/') to separate the parts. There must be exactly one space character between any two successive numbers and between the number and the slash.If there is more than one solution, print the one that minimizes the work\r\nassigned to the first scriber, then to the second scriber etc. But each\r\nscriber must be assigned at least one book.ExampleSample input:2\r\n9 3\r\n100 200 300 400 500 600 700 800 900\r\n5 4\r\n100 100 100 100 100Sample output:100 200 300 400 500 / 600 700 / 800 900\r\n100 / 100 / 100 / 100 100",
  "sample_input": "Sample input:2\r\n9 3\r\n100 200 300 400 500 600 700 800 900\r\n5 4\r\n100 100 100 100 100Sample output:100 200 300 400 500 / 600 700 / 800 900\r\n100 / 100 / 100 / 100 100",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BOOKS1",
  "scraped_at": "2025-08-17 00:33:34"
}