{
  "problem_code": "problems",
  "title": "Invitation Cards",
  "tags": [],
  "text": "In the age of television, not many people attend theater\r\nperformances. Antique Comedians of Malidinesia are aware of this fact. They\r\nwant to propagate theater and, most of all, Antique Comedies. They have\r\nprinted invitation cards with all the necessary information and with the\r\nprogramme. A lot of students were hired to distribute these invitations\r\namong the people. Each student volunteer has assigned exactly one bus stop\r\nand he or she stays there the whole day and gives invitation to people\r\ntravelling by bus. A special course was taken where students learned\r\nhow to influence people and what is the difference between influencing\r\nand robbery.The transport system is very special: all lines are\r\nunidirectional and connect exactly two stops. Buses leave\r\nthe originating stop with passengers each half an hour. After reaching\r\nthe destination stop they return empty to the originating stop,\r\nwhere they wait until the next full half an hour, e.g. X:00 or\r\nX:30, where 'X' denotes the hour. The fee for transport between two\r\nstops is given by special tables and is payable on the spot. The\r\nlines are planned in such a way, that each round trip (i.e. a journey\r\nstarting and finishing at the same stop) passes through aCentral\r\nCheckpoint Stop(CCS) where each passenger has to pass a thorough\r\ncheck including body scan.All the ACM student members leave the CCS each morning. Each volunteer is\r\nto move to one predetermined stop to invite passengers. There are as many\r\nvolunteers as stops. At the end of the day, all students travel back to CCS.\r\nYou are to write a computer program that helps ACM to minimize the amount of\r\nmoney to pay every day for the transport of their employees.InputThe input consists ofNcases. The first line of the input\r\ncontains only positive integerN. Then follow the cases.\r\nEach case begins with a line containing exactly two integersPandQ,1 ≤ P, Q ≤ 1000000.Pis the number of stops including CCS andQthe\r\nnumber of bus lines. Then there areQlines, each describing one\r\nbus line. Each of the lines contains exactly three numbers - the originating\r\nstop, the destination stop and the price. The CCS is designated by\r\nnumber1. Prices are positive integers the sum of which is\r\nsmaller than1000000000. You can also assume it is always\r\npossible to get from any stop to any other stop.OutputFor each case, print one line containing the minimum amount of\r\nmoney to be paid each day by ACM for the travel costs of its volunteers.ExampleInput:2\r\n2 2\r\n1 2 13\r\n2 1 33\r\n4 6\r\n1 2 10\r\n2 1 60\r\n1 3 20\r\n3 4 10\r\n2 4 5\r\n4 1 50Output:46\r\n210Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Input:2\r\n2 2\r\n1 2 13\r\n2 1 33\r\n4 6\r\n1 2 10\r\n2 1 60\r\n1 3 20\r\n3 4 10\r\n2 4 5\r\n4 1 50Output:46\r\n210",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/INCARDS",
  "scraped_at": "2025-08-17 00:33:47"
}