{
  "problem_code": "problems",
  "title": "Skyscraper Floors",
  "tags": [],
  "text": "What a great idea it is to build skyscrapers! Using not too\r\nlarge area of land, which is very expensive in many cities today, the\r\nskyscrapers offer an extremely large utility area for flats or offices. \r\nThe only disadvantage is that it takes too long to get to the upper \r\nfloors. Of course these skyscrapers have to be equipped not only \r\nwith a stairway but also with several elevators. But even using \r\nordinary elevators is very slow. Just imagine you want to get from \r\nthe very top floor to the base floor and many other people on other \r\nfloors want the same. As a result the elevator stops on almost every \r\nfloor and since its capacity is limited and the elevator is already \r\nfull from the upper floors, most stops are useless and just cause \r\na delay. If there are more elevators in the skyscrapers, this problem \r\nis a little bit eliminated but still not completely. Most people just \r\npress all the buttons of all the elevators and then take the first \r\none so that all elevators will stop on the floor anyway.However, the solution exists as we shall see. The Antique Comedians of\r\nMidilesia headquarters reside in a skyscraper with a very special\r\nelevator system. The elevators do not stop on every floor but only on\r\neveryX-th floor.\r\nMoreover each elevator can go just to a certain floorY(called starting floor) and cannot go any lower. There is one\r\nhigh-capacity elevator which can stop on every elevator's starting\r\nfloor.The ACM has a big problem. The headquarters should be moved to\r\nanother office this week, possibly on a different floor. \r\nUnfortunately, the high-capacity elevator is\r\nout of order right now so it is not always possible to go to the base\r\nfloor. One piece of furniture cannot be moved using the stairway because it\r\nis too large to pass through the stairway door. You are to write\r\na program that decides whether it is possible to move a piece of\r\nfurniture from the original office to the other.InputThe input consists ofNcases (equal to about 2000). The first line contains only\r\none positive integerN. Then follow the cases.\r\nEach case starts with a line containing four integersF,E,A,B, whereF,1 ≤ F < 50000000determines the number of floors in the\r\nskyscraper (this means that there are floors0toF-1),E,0 < E < 100is the number of elevators andA,B,0 ≤ A,B < Fare numbers of the\r\ntwo floors between which the piece of furniture should be moved. Then\r\nfollowElines. Each of them contains description of one elevator.\r\nThere are exactly two integersXandY,X >\r\n0,Y ≥ 0at\r\neach line.Ydetermines, that the elevator starts on theY-th floor andXdetermines, that it stops on everyX-th floor, eg. forX = 3,Y = 7the\r\nelevator stops on floors 7, 10, 13, 16, etc.).OutputFor each case, print exactly one line.\r\nIf floorBis reachable from floorAnot using the\r\nstairway, print the sentence\r\n'It is possible to move the furniture.', otherwise print \r\n'The furniture cannot be moved.'.ExampleSample input:\r\n\r\n2\r\n22 4 0 6\r\n3 2\r\n4 7\r\n13 6\r\n10 0\r\n1000 2 500 777\r\n2 0\r\n2 1\r\n\r\nSample output:\r\n\r\nIt is possible to move the furniture.\r\nThe furniture cannot be moved.Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Sample input:\r\n\r\n2\r\n22 4 0 6\r\n3 2\r\n4 7\r\n13 6\r\n10 0\r\n1000 2 500 777\r\n2 0\r\n2 1\r\n\r\nSample output:\r\n\r\nIt is possible to move the furniture.\r\nThe furniture cannot be moved.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SCRAPER",
  "scraped_at": "2025-08-17 00:33:41"
}