{
  "problem_code": "problems",
  "title": "Substitution Cipher",
  "tags": [],
  "text": "Antique Comedians of Malidinesia would like to play a new discovered\r\ncomedy of Aristophanes. Putting it on a stage should be a big surprise for\r\nthe audience so all the preparations must be kept absolutely secret.\r\nThe ACM director suspects one of his competitors of reading his\r\ncorrespondence. To prevent other companies from revealing his secret, he\r\ndecided to use a substitution cipher in all the letters mentioning the\r\nnew play.Substitution cipher is defined by a substitution table assigning each\r\ncharacter of the substitution alphabet another character of the same alphabet.\r\nThe assignment is a bijection (to each character exactly\r\none character is assigned -- not necessarily different).\r\nThe director is afraid of disclosing the substitution table and\r\ntherefore he changes it frequently. After each change he chooses a few\r\nwords from a dictionary by random, encrypts them and sends them together with\r\nan encrypted message. The plain (i.e. non-encrypted) words\r\nare sent by a secure channel, not by mail. The recipient of the message\r\ncan then compare plain and encrypted words and create\r\na new substitution table.Unfortunately, one of the ACM cipher specialists have found that this\r\nsystem is sometimes insecure. Some messages can be decrypted by the rival\r\ncompany even without knowing the plain words. The reason is\r\nthat when the director chooses the words from the dictionary and encrypts them, \r\nhe never changes their order (the words in the dictionary are\r\nlexicographically sorted). Stringa1a2...\r\napis lexicographically smaller thanb1b2... bqif there exists an\r\nintegeri,i <= p, i <= q, such thataj=bjfor eachj, 1 <= j <\r\niandai< bi.The director is interested in which of his messages could be\r\nread by the rival company. You are to write a program to determine that.InputThe input consists ofNcases (equal to about 1000). The first line of the input\r\ncontains only positive integerN. Then follow the cases. \r\nThe first line of each case contains only two positive integersA,1 <= A <= 26, andK, separated by\r\nspace.Adetermines the size of the substitution alphabet (the\r\nsubstitution alphabet consists of the firstAlowercase letters\r\nof the English alphabet (a--z) andKis the number of encrypted\r\nwords. The plain words contain only the letters of the substitution\r\nalphabet. The plain message can contain any symbol, but only the letters of\r\nthe substitution alphabet are encrypted. Then followKlines,\r\neach containing exactly one encrypted word. At the next line is encrypted\r\nmessage.OutputFor each case, print exactly one line. If it is possible\r\nto decrypt the message uniquely, print the\r\ndecrypted message. Otherwise, print the sentence\r\n'Message cannot be decrypted.'.ExampleInput:2\r\n5 6\r\ncebdbac\r\ncac\r\necd\r\ndca\r\naba\r\nbac\r\ncedab\r\n4 4\r\ncca\r\ncad\r\naac\r\nbca\r\nbdacOutput:abcde\r\nMessage cannot be decrypted.Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Input:2\r\n5 6\r\ncebdbac\r\ncac\r\necd\r\ndca\r\naba\r\nbac\r\ncedab\r\n4 4\r\ncca\r\ncad\r\naac\r\nbca\r\nbdacOutput:abcde\r\nMessage cannot be decrypted.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SCYPHER",
  "scraped_at": "2025-08-17 00:33:35"
}