{
  "problem_code": "problems",
  "title": "The Gordian Dance",
  "tags": [],
  "text": "The Gordian Dance is a traditional Bytelandian dance performed by two pairs\r\nof dancers. At the beginning the dancers are standing in the corners of the squareABCD,\r\nforming two pairs:A-BandC-D. Every pair is holding an outstretched string. So in the starting position both strings are stretched horizontally and\r\nparallel.The dance consists of a series of moves. There are two kinds of moves:(S) The dancers standing at pointsBandCswap positions (without releasing their strings) in such a way that\r\nthe dancer standing atBraises the hand in which he is holding the string and, when going to pointC, lets the dancer going fromCtoBpass in front of him, under his arm.(R) All dancers make a turn by 90 degrees clockwise without releasing their strings.\r\nThis means that the dancer fromAgoes toB,\r\nthe dancer fromBgoes toC,\r\nthe dancer fromCgoes toD,\r\nand the dancer fromDgoes toA.During the dance the strings tangle with each other, but in the end\r\nthey should be untangled and stretched horizontally and parallel.\r\nThe dancers do not have to occupy the same spots as in the begining.\r\nThe dance requires a lot of experience, because the strings can be extremely tangled during the dance. The sequence of moves after which they are no longer tangled and are stretched horizontally and parallel can be difficult to guess.Your program should help beginner dancers end a dance. You are to determine the\r\nminimal number of mover required to end the dance given a sequence of\r\nmoves already performed.IllustrationFor example after the sequenceSSwe get the following configuration.The shortest sequence of moves required to end the dance is of length 5:RSRSS.TaskWrite a program whichreads from standard input the moves made in a dance,finds the minimal number of moves required to untangle the strings and\r\nstretch them horizontally and parallel (the dancers don't have to be in their starting spots).writes the outcome to standard output.InputTen test cases (given one under another, you have to process all!). The first line of each test case consists of one integernequal to the nmber of moves already made,0<=n<=1000000.\r\nThe second line of each test case consists of one word of lengthn,\r\nmade up of lettersSand/orR.OutputFor every testcase your program should write to standard output only\r\none line with one integer number: the minimal number of\r\nmoves required to untangle the strings and stretch them horizontally and parallel.ExampleInput:2\r\nSS\r\n[and 9 test cases more]Output:5\r\n[and 9 test cases more]Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Input:2\r\nSS\r\n[and 9 test cases more]Output:5\r\n[and 9 test cases more]",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DANCE",
  "scraped_at": "2025-08-17 00:33:43"
}