{
  "problem_code": "problems",
  "title": "Bytelandian Information Agency",
  "tags": [],
  "text": "Bytelandian Information Agency (BIA) uses a net ofncomputers.\r\nThe computers are numbered from1ton, and\r\nthe computer number1is a server. The computers are connected\r\nby one-way information channels. Every channel connects a pair of computers.\r\nThe whole network is organised in such a way that one can send information\r\nfrom the server to any other computer either directly or indirectly.When BIA acquires new information, the information is put on the server\r\nand propagated in the net. The chief of BIA considers what would happen\r\nif one computer stopped working (was blown away by terrorists for example).\r\nIt could happen that some other computers would stop receiving information\r\nfrom the server, because the broken computer was a necessary transmitter.\r\nWe will call such computerscritical. For example in the situation\r\nin the picture below the critical computers are1and2.1is the server and all information sent from the server to3has to go\r\nthrough2.TaskWrite a program whichreads a description of the net from standard input,finds all critical computers.writes the numbers of critical computers to standard output.InputTen test cases (given one under another, you have to process all!).\r\nEach test case consists of several lines.\r\nIn the first line there are numbersnandm.ndenotes\r\nthe number of computers in the net,(2<=n<=5000).mdenotes the\r\nnumber of information\r\nchannels,n-1<=m<=200000. The followingmlines describes a single information\r\nchannel and consist of two integer numbersaandbseparated by a space.\r\nIt means the computerasends information to computerbby that channel.\r\nYou may assume there are no two channels which start and end at the same pointsa, b.OutputFor every testcase your program should write two lines. In the first linek- the number of critical computers in the net. In the second lineknumbers separated by single spaces - the numbers of critical computers in increasing order.ExampleInput:4 5\r\n1 2\r\n1 4\r\n2 3\r\n3 4\r\n4 2\r\n[and 9 test cases more]Output:2\r\n1 2\r\n[and 9 test cases more]Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Input:4 5\r\n1 2\r\n1 4\r\n2 3\r\n3 4\r\n4 2\r\n[and 9 test cases more]Output:2\r\n1 2\r\n[and 9 test cases more]",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BIA",
  "scraped_at": "2025-08-17 00:33:41"
}