{
  "problem_code": "problems",
  "title": "Dyzio",
  "tags": [],
  "text": "Dyzio is Jasiek's friend and he also likes riddles. Here is a riddle he came up with:Jasiek, here is a piece of rope, which has to be cut into smaller pieces.\r\nI will not tell you directly how to do it, but look at this\r\nsequence of zeros (0) and ones (1). A one at the beginning means that the rope\r\nhas to be cut in half. If the first digit was zero, it would be the only\r\ndigit in the sequence and mean you don't have to cut anything - I want\r\nthe whole rope. If you have to cut the rope anyway then after the first\r\n1 I wrote what to do with the left piece (according to the same rules as with\r\nthe whole rope) and then I wrote what to do with the right piece of rope\r\n(all the time with the same rules of notation). Every time you have to\r\ncut the left piece first, only then can you cut the right one. Now start cutting\r\nand tell me, how many cuts you have to do until you have cut off the shortest piece.Unfortunately mom hid the scissors from Jasiek, but luckily a computer was at hand\r\nand Jasiek quickly wrote a program simulating the rope cutting. Can you write\r\nsuch a program?TaskWrite a program whichreads (from standard input) description of the way the rope is cut,counts how many cuts have to be made in order to get the first shortest piece.writes out the outcome (to standard output)InputTen test cases (given one under another, you have to process all!).\r\nEach test case consists of two lines.\r\nIn the first line there is a numbern (1 ≤ n ≤ 20000). In the second\r\nline one zero-one word (a sequence of zeros and ones without spaces between them)\r\nof lengthn- the description of the cutting procedure given by Dyzio.OutputFor every testcase your program should write (to the standard output) only\r\none line with one integer equal to the number of\r\ncuts which have to be made in order to get the shortest piece.ExampleInput:9\r\n110011000\r\n[and 9 test cases more]Output:4\r\n[and 9 test cases more]",
  "sample_input": "Input:9\r\n110011000\r\n[and 9 test cases more]Output:4\r\n[and 9 test cases more]",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DYZIO",
  "scraped_at": "2025-08-17 00:33:34"
}