{
  "problem_code": "problems",
  "title": "Brackets",
  "tags": [],
  "text": "We will call abracket wordany word constructed out of two sorts\r\nof characters: the opening bracket \"(\" and the closing bracket \")\". Among\r\nthese words we will distinguishcorrect bracket expressions. These are\r\nsuch bracket words in which the brackets can be matched into pairs such thatevery pair consists of an opening bracket and a closing bracket\r\nappearing further in the bracket wordfor every pair the part of the word between the brackets of this pair\r\nhas equal number of opening and closing bracketsOn a bracket word one can do the following operations:replacement-- changes the i-th bracket into the opposite onecheck-- if the word is a correct bracket expressionTaskWrite a program whichreads (from standard input) the bracket word and the sequence of\r\noperations performed,for every check operation determines if the current bracket word is\r\na correct bracket expression,writes out the outcome (to standard output).InputTen test cases (given one under another, you have to process all!).\r\n Each of the test cases is a series of lines.\r\n The first line of a test consists of a single numbern (1 ≤ n ≤ 30000)denoting\r\n the length of the bracket word.\r\n The second line consists ofnbrackets, not separated by any spaces.\r\n The third line consists of a single numberm-- the number of operations.\r\n Each of the followingmlines carries a numberkdenoting the operation\r\n performed.k = 0denotes the check operation,k > 0denotes replacement ofk-th bracket by the opposite.OutputFor every test case your program should print a line:Test i:where i is replaced by the number of the test\r\nand in the following lines, for every check operation in the i-th test\r\nyour program should print a line with the word\r\nYES,\r\nif the current bracket word is a correct bracket expression, and a line\r\nwith a word\r\nNO otherwise.\r\n(There should be as many lines as check operations in the test.)ExampleInput:4\r\n()((\r\n4\r\n4\r\n0\r\n2\r\n0\r\n[and 9 test cases more]Output:Test 1:\r\nYES\r\nNO\r\n[and 9 test cases more]Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Input:4\r\n()((\r\n4\r\n4\r\n0\r\n2\r\n0\r\n[and 9 test cases more]Output:Test 1:\r\nYES\r\nNO\r\n[and 9 test cases more]",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BRCKTS",
  "scraped_at": "2025-08-17 00:33:45"
}