{
  "problem_code": "problems",
  "title": "Fake tournament",
  "tags": [],
  "text": "We consider only special type of tournaments. Each tournament consists of a series of matches. We havencompetitors at the beginning of a competition and after each match the loser is moved out of the competition and the winner stays in (there are no draws). The tournament ends when there is only one participant left - the winner. It is a task of National Sports Federation to schedule the matches. Members of this committee can pick the contestants for the first match. Then, after they know the result, they say which of the remaining contestants meet in the second match, and so on until there is only one participant left.It is easy to see that not only skill and training decides about the win, but also \"luck\" - i.e. the schedule. The members of NSF know it as well.The committee used the training time to look carefully on the performance of each probable contestant. It is clear now, at the start of the season, that some of the results between the competitors are 100% predictable. Having this information NSF considers if it is possible to schedule the matches in such a way that the given contestantxwins. That is to plan the matches forxonly with those who will lose with him (then he wins the whole tournament of course). If it is possible then w say thatthe tournament can be set for x.TaskYour task is to write a program which determines the number of contestants of a given tournament for which it is possible to set it.Inputt [number of tests to solve].In the first line of each test:\r\nn (1 ≤ n ≤ 1000) - the number of participants of the tournament. We number the participants with numbers 1, 2 ... n.\r\nThe following line contains a list of participants who will inevitably win with participant 1. This list begins with a numberm(the number of contestants \"better\" than 1) and numbers n1, n2... nmdelimited by single spaces.Nextn-1lines contain analogous lists for participants 2, 3 ... n.Remark 1. The fact that participantawould lose withbandbwould lose withcdoesn't necessarily mean thatawould lose withcin a direct match.Remark 2. It is not possible thatais on the list of contestants better thanbandbis on the list ofaat the same time.OutputFor each test your program should output a single integer - the number of participants, for which it is possible to set the tournament.ExampleInput:\r\n1\r\n3\r\n2 3 2\r\n1 3\r\n0\r\n\r\nOutput:\r\n1",
  "sample_input": "Input:\r\n1\r\n3\r\n2 3 2\r\n1 3\r\n0\r\n\r\nOutput:\r\n1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TOUR",
  "scraped_at": "2025-08-17 00:33:49"
}