{
  "problem_code": "problems",
  "title": "Crime at Piccadily Circus",
  "tags": [],
  "text": "Sherlock Holmes is carrying out an investigation into the crime at Piccadilly Circus. Holmes\r\nis trying to determine the maximal and minimal number of people staying simultaneously at the crime scene at a moment when the crime could have been committed. Scotland Yard has already carried out a thorough investigation already, interrogated everyone seen at the crime scene and determined what time they appeared\r\nat the crime scene and what time they left. Doctor Watson offered his help\r\nto process the data gathered by Scotland Yard and find the numbers interesting\r\nSherlock Holmes, but he has some difficulties. Help him!TaskWrite a program whichreads from standard input the time interval during which the crime was commited\r\nand the data gathered by Scotland Yard,finds the minimal and\r\nthe maximal number of people present simultaneously in the\r\ntime interval when the crime could have been commited, (these numbers can be zero, though it would seem strange that noone\r\nwas present at the crime scene when the crime was commited, but that's the type of crime Holmes and Watson have to deal with)writes the outcome to standard output.InputTen test cases (given one under another, you have to process all!).\r\nThe first line of each test case consists of two integer numberspandk,0 ≤ p ≤ k ≤ 100000000. These denote the first and the last moment when the crime\r\ncould have been commited. The second line of each test case contains one integern, 3 ≤ n ≤ 5000. This is the number of people interrogated by Scotland Yard. The nextnlines consist of two integers - linei+2contains numbersaiandbiseparated by a single space,0 ≤ ai≤ bi≤ 1000000000. These are\r\nthe moments at which thei-th person apperared at and left the crime scene respectively.\r\nIt means that thei-th person was at the crime scene for the whole time from momentaiuntil momentbi(inclusive).OutputFor every test case your program should write to the standard output only\r\none line with two integers separated by a single space: the minimal and maximal number of people staying simultaneously at the crime scene, in the interval between momentpandk,\r\n(inclusive).ExampleOnly one test case.Input:5 10\r\n4\r\n1 8\r\n5 8\r\n7 10\r\n8 9Output:1 4",
  "sample_input": "Input:5 10\r\n4\r\n1 8\r\n5 8\r\n7 10\r\n8 9Output:1 4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PICAD",
  "scraped_at": "2025-08-17 00:33:39"
}