{
  "problem_code": "problems",
  "title": "Ball",
  "tags": [],
  "text": "On the rectangular chessboard of n × m square fields we choose one field \r\n\tadjacent to the edge of the chessboard, called the starting field. Then we put \r\n\ta ball in the center of this field and push it to roll through the chessboard. \r\n\tThe diameter of the ball equals the width (and height) of chessboard field. The \r\n\tangle between the direction of ball movement and the edge of the chessboard \r\n\tequals 45 degrees. The ball bounces off the edges of the chessboard: if the \r\n\tball touches the edge of the chessboard then each composite of its velocity \r\n\tperpendicular to the edge touched is reversed. At the start the ball is pushed \r\n\ttoward increasing coordinates (when the starting field is a field of the \r\n\thighest coordinate, the ball bounces momentarily).We assign a point to a field of the chessboard each time the point of adjacency \r\n\tbetween the ball and the chessboard enters the interior of the field. The game \r\n\tis over when a point is assigned to the starting field. What is the number of \r\n\tfields to which an odd number of points is assigned? The following figures \r\n\tillustrate the problem. The route of the ball is marked with a dashed line. \r\n\tFields with the odd number of points are shadowed.TaskWrite a program which for each data set from a sequence of several data sets:reads the dimensions of the chessboard and the coordinates of starting field \r\n\t\t\tfrom input,computes the number of fields with the odd number of points,writes the result to output.InputThe first line of the input file contains one integer d, 1 ≤ d ≤ 10, which is \r\n\tthe number of data sets. The data sets follow. Each data set occupies one line \r\n\tof the input file. Such a line consists of four integers x, y, a, b separated \r\n\twith single spaces. These integers are the x- and y-dimensions of the \r\n\tchessboard and x- and y-coordinates of the starting field, respectively. \r\n\tIntegers x and y are greater than two, the number of fields of the chessboard \r\n\tdoes not exceed 109,the starting field is adjacent to the edge of \r\n\tthe chessboard.OutputThe i-th line of output should contain one integer which is equal to the number \r\nof fields of the chessboard with the odd number of points.ExampleSample input:\r\n2\r\n13 6 1 5\r\n10 7 1 5\r\n\r\nSample output:\r\n2 \r\n22",
  "sample_input": "Sample input:\r\n2\r\n13 6 1 5\r\n10 7 1 5\r\n\r\nSample output:\r\n2 \r\n22",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BALL1",
  "scraped_at": "2025-08-17 00:33:33"
}