{
  "problem_code": "problems",
  "title": "Cross",
  "tags": [],
  "text": "Agness, a student of computer science, is very keen on cross­country \r\n\trunning, and she participates in races organised every Saturday in a big park. \r\n\tEach of the participants obtains a route card, which specifies a sequence of \r\n\tcheckpoints, which they need to visit in the given order. Agness is a very \r\n\tatractive girl, and a number of male runners have asked her for a date. She \r\n\twould like to choose one of them during the race. Thus she invited all her \r\n\tadmirers to the park on Saturday and let the race decide. The winner would be \r\n\tthe one, who scores the maximum number of points. Agnes came up with the \r\n\tfollowing rules:a runner scores one point if he meets Agnes at the checkpoint,if a runner scored a point at the checkpoint, then he cannot get another point \r\n\t\tunless he and Agnes move to the next checkpoints specified in their cards.route specified by the card may cross the same checkpoint more than once,each competitor must strictly follow race instructions written on his card.Between two consecutive meetings, the girl and the competitors may visit any \r\n\tnumber of checkpoints. The boys will be really doing their best, so you may \r\n\tassume, that each of them will be able to visit any number of checkpoints \r\n\twhilst Agnes runs between two consecutive ones on her route.TaskWrite a program which for each data set from a sequence of several data sets:reads in the contents of Agnes' race card and contents of race cards presented \r\n\t\tto Tom,computes the greatest number of times Tom is able to meet Agnes during the \r\n\t\trace,writes it to output.InputThere is one integer d in the first line of the input file, 1 <= d <= 10. \r\n\tThis is the number of data sets. The data sets follow. Each data set consists \r\n\tof a number of lines, with the first one specifying the route in Agnes' race \r\n\tcard. Consecutive lines contain routes on cards presented to Tom. At least one \r\n\troute is presented to Tom. The route is given as a sequence of integers from \r\n\tinterval [1, 1000] separated by single spaces. Number 0 stands for the end of \r\n\tthe route, though when it is placed at the beginning of the line it means the \r\n\tend of data set. There are at least two and at most 2000 checkpoints in a race \r\n\tcard.OutputThe i-th line of the output file should contain one integer. That integer \r\n\tshould equal the greatest number of times Tom is able to meet with Agnes for \r\n\trace cards given in the i-th data set.ExampleSample input:3\r\n1 2 3 4 5 6 7 8 9 0\r\n1 3 8 2 0\r\n2 5 7 8 9 0\r\n1 1 1 1 1 1 2 3 0\r\n1 3 1 3 5 7 8 9 3 4 0\r\n1 2 35 0\r\n0\r\n1 3 5 7 0\r\n3 7 5 1 0\r\n0\r\n1 2 1 1 0\r\n1 1 1 0\r\n0Sample output:6\r\n2\r\n3",
  "sample_input": "Sample input:3\r\n1 2 3 4 5 6 7 8 9 0\r\n1 3 8 2 0\r\n2 5 7 8 9 0\r\n1 1 1 1 1 1 2 3 0\r\n1 3 1 3 5 7 8 9 3 4 0\r\n1 2 35 0\r\n0\r\n1 3 5 7 0\r\n3 7 5 1 0\r\n0\r\n1 2 1 1 0\r\n1 1 1 0\r\n0Sample output:6\r\n2\r\n3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CRSCNTRY",
  "scraped_at": "2025-08-17 00:33:35"
}