{
  "problem_code": "problems",
  "title": "Cutting out",
  "tags": [],
  "text": "One has to cut out a number of rectangles from a paper square. The sides of each rectangle are to be parallel \r\nto the sides of the square. Some rectangles can be already cut out. What is the largest area of a rectangle \r\nwhich can be cut out from the remaining paper?IllustrationThree rectangles have been cut out from the square 10x10 in the figure shown below. The area of the largest \r\nrectangle that can be cut out from the remaining paper is 16. One of such rectangles is shown with a dashed \r\nline.TaskWrite a program that for each data set from a sequence of several data sets:reads descriptions of a square and rectangles from the input,computes the area of the largest rectangle which can be cut out from the remaining paper,writes the result to output.InputThe first line of the input file contains one positive \r\ninteger d not larger than 10. This is the number of data sets. The data sets \r\nfollow. Each set of data occupies two consecutive lines of the input file. The \r\nfirst line of each data set contains two integers n and r, 1 <= n <= 40000, 0 <= r <= 100. The integer n is the length \r\nof the sides of an input square. The integer r is the number of rectangles which have been cut out from the \r\nsquare. The second line of the data set contains a sequence of 4r integers x1, x2,...,x4rfrom the interval \r\n[0,n] separated by single spaces. For each i = 1,...,r, integers x4i-3, x4i-2, x4i-1, x4idescribe the i-th rectangle: x4i-3is the distance of its left side from the left side of the square, x4i-2is the distance of its right side from the left side of the square, x4i-1is the distance of the bottom side of the rectangle from the \r\nbottom side of the square and x4iis the distance of its top side from the bottom side of the square.OutputFor each i = 1,...,d, your program should write only one integer to the i-th line of the output file -- the \r\nlargest area of a rectangle which can be cut out from the rest of the i-th square.ExampleInput:2 \r\n6 2 \r\n0 3 0 3 3 6 3 6 \r\n10 3 \r\n0 5 0 5 0 10 5 10 9 10 0 5Output:9 \r\n20",
  "sample_input": "Input:2 \r\n6 2 \r\n0 3 0 3 3 6 3 6 \r\n10 3 \r\n0 5 0 5 0 10 5 10 9 10 0 5Output:9 \r\n20",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CUTOUT",
  "scraped_at": "2025-08-17 00:33:38"
}