{
  "problem_code": "problems",
  "title": "Bacterial",
  "tags": [],
  "text": "In the biology laboratory we are observing several bacterial \r\n        samples, and under \r\n                the microscope we have them shaded with different colors to see them expanding \r\n                their territory on the plate.It is interesting to know that the \r\n        bacterial are \r\n                quite 'friendly' that once they meet each other, they do not expand into each \r\n                other's occupation any more. The bacterial samples are expanding \r\n        at similar speeds and we take them as the same speed.Since the experiment is tedious and lengthy (Oh My \r\n                God! there are several thousand samples at our pick), we are going to run a \r\n                simulation based on this reality, taking the variable that these \r\n        samples may be planted in different starting spots.We are using rectangular plates and \r\n        bacterial racing is bounded within the plate.Input formatThere are multiple test cases (about 20000 of them) each taking the following format:one line with two integers between 1 \r\n        and 1000 inclusive indicating width and height of the plateone line with one integer between 1 and 100 inclusive indicating the \r\n        number of bacterial samplesfor each bacterial sample there is one line with two integers \r\n        indicating the sample's position:x y, where x, y specify a position within or on the bound of the \r\n        plate.The plate lies in such a coordinating system that the lower-left corner of it is (0,0) and the upper-right corner is (width,height).A test with zero plate area marks the end of \r\n        the tests and this one shall not be processed.Between each input block there is a \r\n        blank line.Output formatGenerate a report having the samples sorted on their domination, \r\n        with each line taking the following format:<sample id> <area occupation>where: 'sample id' takes 3 columns right justified, with '0' padded to \r\n        the left as necessary, and 'area occupation' \r\n        takes 14 columns with 2 digit precision, right justified.The sample occupying more area shall be \r\n        reported prior to those occupying less. The input data will ensure \r\n        enough difference in areas to avoid ambiguity.Between each output block there shall \r\n        be a blank line.ExampleSample input:10 10\r\n2\r\n5 5\r\n0 0\r\n\r\n0 0Sample output:001         87.50\r\n002         12.50Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Sample input:10 10\r\n2\r\n5 5\r\n0 0\r\n\r\n0 0Sample output:001         87.50\r\n002         12.50",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BAC",
  "scraped_at": "2025-08-17 00:33:48"
}