{
  "problem_code": "problems",
  "title": "Expression",
  "tags": [],
  "text": "We are given an integer k and an arithmetic expression E with the operations \r\n\t'+', '-', and arguments from the set {0, 1 ... 9}. Is it possible to put some \r\n\tparentheses in E to get a new expression E' whose value equals k? If the answer \r\n\tis positive what is the minimum number of pairs of parentheses '(', ')' that \r\n\tare necessary?IllustrationIt is sufficient to put one pair of parentheses in the expression 5 - 4 + 5 to \r\n\tget an expression with value -4, namely 5 - (4 + 5) = -4.TaskWrite a program that for each data set from a sequence of several data sets:reads an expression E and an integer k from input,verifies whether it is possible to put some parentheses in E to get a new \r\n\t\texpression E' whose value equals k and computes the minimal number of pairs of \r\n\t\tparentheses '(', ')' necessary, if the answer is positive,writes the result to output.InputThe first line of the input file contains one positive integer d not larger \r\n\tthan 10. This is the number of data sets. The data sets follow. Each set of \r\n\tdata occupies two consecutive lines of the input file. The first line contains \r\n\ttwo integers n and k, 2 ≤ n ≤ 40, -180 ≤ k ≤ 180. The even \r\n\tinteger n is the length of E. The second line contains the expression itself \r\n\twritten as a string of length n. The string contains operators '+' or '-' in \r\n\todd positions and numbers from the set {0, 1 ... 9} in even positions.OutputFor each i = 1 ... d, your program should write to the i-th line of the output \r\n\tfile one word 'NO' if the i-th input expression cannot be transformed into any \r\n\texpression of value k, and the smallest number of pairs of parentheses \r\n\tnecessary otherwise.ExampleSample input:\r\n5 \r\n6 -4 \r\n+5-4+5 \r\n2 1 \r\n+1 \r\n4 1 \r\n-1+1 \r\n4 0 \r\n-1+1 \r\n4 -2 \r\n-1+1 \r\n\r\nSample output:\r\n1 \r\n0 \r\nNO \r\n0 \r\n1",
  "sample_input": "Sample input:\r\n5 \r\n6 -4 \r\n+5-4+5 \r\n2 1 \r\n+1 \r\n4 1 \r\n-1+1 \r\n4 0 \r\n-1+1 \r\n4 -2 \r\n-1+1 \r\n\r\nSample output:\r\n1 \r\n0 \r\nNO \r\n0 \r\n1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/EXPR1",
  "scraped_at": "2025-08-17 00:33:40"
}