{
  "problem_code": "problems",
  "title": "Easy Problem",
  "tags": [],
  "text": "Last year there were a lot of complaints concerning the set of problems. Most \r\n\tcontestants considered our problems to be too hard to solve. One reason for \r\n\tthis is that the team members responsible for the problems are not able to \r\n\tevaluate properly whether a particular problem is easy or hard to solve. (We \r\n\thave created until now so many problems, that all seems quite easy.) Because we \r\n\twant our future contests to be better we would like to be able to evaluate the \r\n\thardness of our problems after the contest using a history of submissions.There are a few statistics that we can use for evaluating the hardness of a \r\n\tparticular problem: the number of accepted solutions of the problem, the \r\n\taverage number of submissions of the problem and the average time consumed to \r\n\tsolve it (as \"General rules\" of the contest state \"the time consumed for a \r\n\tsolved problem is the time elapsed from the beginning of the contest to the \r\n\tsubmittal of the accepted run\"). For the latter two statistics we consider only \r\n\tthe teams which solved this particular problem. Needless to say we ask you to \r\n\twrite a program that computes aforementioned statistics for all problems.TaskWrite a program that:reads a history of submissions during an ACM contest,computes for each problem the number of accepted solutions of the problem, the \r\n\t\taverage number of submissions and the average time consumed to solve it,writes the result.InputThe input begins with the integer t, the number of test cases. Then t test \r\n\tcases follow.For each test case, the first line of the input contains one integer n (1 <= \r\n\tn <= 2000) being the number of submissions during the contest. Each of the \r\n\tnext n lines describes one submission and contains a submission time (measured \r\n\tin seconds from the beginning of the contest), a team identifier, a problem \r\n\tidentifier and a result of evaluating the submission separated by single \r\n\tspaces. The submission time is a positive integer not greater then 18000. The \r\n\tteam identifier is a non-empty string consisting of at most five small letters \r\n\tor digits. The problem identifier is a capital letter A, B ... or I. The \r\n\tresult is a capital letter A (the submission is accepted) or R (the submission \r\n\tis rejected).Submissions are given in nondecreasing order according to submission times and \r\n\tthere are 62 teams competing.Please note that if a problem is accepted all further submission of this \r\n\tproblem by the same team are possible but they should not be taken to the \r\n\tstatistics.OutputFor each test case the output consists of nine lines. The first line \r\n\tcorresponds to problem A, the second line to problem B, and so on. Each line \r\n\tshould contain the problem identifier, the number of accepted solutions of the \r\n\tproblem, the average number of submissions done by teams that solved that \r\n\tproblem and the average time consumed to solve it separated by single spaces. \r\n\tThe latter two statistics should be printed only if there was at least one \r\n\taccepted solution of the given problem and should be rounded to two fractional \r\n\tdigits (in particular 1.235 should be rounded to 1.24).ExampleSample input:1\r\n12 \r\n10 wawu1 B R \r\n100 chau1 A A \r\n2000 uwr2 B A \r\n2010 wawu1 A R \r\n2020 wawu1 A A \r\n2020 wawu1 B A \r\n4000 wawu2 C R \r\n6000 chau1 A R \r\n7000 chau1 A A \r\n8000 pp1 A A \r\n8000 zil2 B R \r\n9000 zil2 B ASample output:A 3 1.33 3373.33 \r\nB 3 1.67 4340.00 \r\nC 0 \r\nD 0 \r\nE 0 \r\nF 0 \r\nG 0 \r\nH 0 \r\nI 0",
  "sample_input": "Sample input:1\r\n12 \r\n10 wawu1 B R \r\n100 chau1 A A \r\n2000 uwr2 B A \r\n2010 wawu1 A R \r\n2020 wawu1 A A \r\n2020 wawu1 B A \r\n4000 wawu2 C R \r\n6000 chau1 A R \r\n7000 chau1 A A \r\n8000 pp1 A A \r\n8000 zil2 B R \r\n9000 zil2 B ASample output:A 3 1.33 3373.33 \r\nB 3 1.67 4340.00 \r\nC 0 \r\nD 0 \r\nE 0 \r\nF 0 \r\nG 0 \r\nH 0 \r\nI 0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/EASYPIE",
  "scraped_at": "2025-08-17 00:33:36"
}