{
  "problem_code": "problems",
  "title": "Shortcut",
  "tags": [],
  "text": "Mirek has a favourite way from home to the university that he traverses every \r\n\tworking day. The route consists of sections and each section is a straight \r\n\tsegment 10 meters long. Each section is either a straight ahead extension of \r\n\tthe previous section or it is perpendicular to the previous section. After \r\n\ttraversing each section Mirek takes a small break to admire the beauty of the \r\n\tnature. During his walk he never visits the same place twice.Yesterday Mirek stayed up long in the night at the party and today he got up \r\n\tlate from bed. He knows that he will miss the first lecture unless he changes \r\n\this usual route. He plans to make one shortcut but he wants the shortcut to be \r\n\tas short as possible (well, we can tell you in secret that he doesn't want to \r\n\tbe on time, he just wants to calm his conscience). The shortcut must be either \r\n\ta horizontal or vertical segment connecting two break points of Mirek's route.Please help Mirek find the shortest shortcut.TaskWrite a program that:reads Mirek's route,computes the shortest shortcut on the route,writes the result.InputThe input begins with the integer t, the number of test cases. Then t test \r\n\tcases follow.For each test case, the first line of the input contains one integer n (3 <= \r\n\tn <= 250 000) being the number of sections of the route. The second line of \r\n\tthe input contains a sequence of n characters N, E, S or W with no spaces in \r\n\tbetween. Each character is a description of one section of the route. Character \r\n\tN, E, S or W means that Mirek walks 10 meters north, east, south or west \r\n\trespectively. You may assume that at least one shortcut exists for the given \r\n\troute.OutputThe first and only line of the output contains integers l, b, e and character d \r\n\tseparated by single spaces. Integer l is the length of the shortest shortcut \r\n\t(measured in 10 m segments). Integers b and e are the numbers of break points \r\n\twhere the shortcut begins and ends respectively (we number break points with \r\n\tconsecutive integers from 0 for Mirek's home to n for the university). \r\n\tCharacter d is the direction of the shortcut. If more than one shortcut of the \r\n\tminimal length exists you should output the one that begins earliest on the \r\n\troute. If more than one shortcut of the minimal length begins at the same break \r\n\tpoint you should output the one that ends furthest on the route.ExampleSample input:1\r\n12 \r\nNNNENNWWWSSWSample output:2 3 11 WWarning: large Input/Output data, be careful with certain languages",
  "sample_input": "Sample input:1\r\n12 \r\nNNNENNWWWSSWSample output:2 3 11 W",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SHORTCUT",
  "scraped_at": "2025-08-17 00:33:40"
}