{
  "problem_code": "problems",
  "title": "Editor Inverse",
  "tags": [],
  "text": "You are given a text. Calculate the minimum number of keystrokes needed\r\nto produce this text,\r\nif the editor described below is used.If you haven't read the problem \"Editor\" before, here is a description\r\nof the functionality of the editor:'\\n': begin a new line. If the last line was empty, stop\r\nprocessing and print out all lines.'d': copy all characters from the current line, and append them\r\nafter\r\nthe last character in this line. For example, if current line contains\r\nab, and d is pressed two times, the result will be ababababany other character: append it to the current line.InputThe input consists ofexactly tentest cases.\r\nEach test case consists of a line with at most 600 characters. The\r\ncharacter 'd' is not used in any of the lines, but all other printable ascii characters may occur.OutputFor each test case, first print a line containing the minimum number of\r\nkey strokes to produce the given line of text.\r\nIn the next lines, write the keys that are pressed to produce the text.\r\nIf there are several possibilities with minimum number of keystrokes,\r\nyou should also minimise the number of lines,\r\nif there is still more than one possibility, minimise number of\r\nkeystrokes before the first '\\n', then second '\\n', ...Since 'd' is a costly operation in the editor, for each output line you\r\nshould minimise the number of 'd' characters as the 2nd criterion after\r\nminimising number of keystrokes in this line.The original input line should be the same as the output of the editor (processing the output you produce), if '\\n' characters are ignored.Notice that you have to terminate the input for the editor with two\r\n'\\n'.ExampleHere only two test cases.Input:00001123444456789000011234444446789Output:18\r\n00d1123444456789\r\n\r\n18\r\n00d1123\r\n444d6789",
  "sample_input": "Input:00001123444456789000011234444446789Output:18\r\n00d1123444456789\r\n\r\n18\r\n00d1123\r\n444d6789",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/EDIT2",
  "scraped_at": "2025-08-17 00:33:32"
}