{
  "problem_code": "problems",
  "title": "November Rain",
  "tags": [],
  "text": "Contemporary buildings can have very complicated roofs. If we take a vertical \r\n\tsection of such a roof it results in a number of sloping segments. When it is \r\n\training the drops are falling down on the roof straight from the sky above. \r\n\tSome segments are completely exposed to the rain but there may be some segments \r\n\tpartially or even completely shielded by other segments. All the water falling \r\n\tonto a segment as a stream straight down from the lower end of the segment on \r\n\tthe ground or possibly onto some other segment. In particular, if a stream of \r\n\twater is falling on an end of a segment then we consider it to be collected by \r\n\tthis segment.For the purpose of designing a piping system it is desired to compute how much \r\n\twater is down from each segment of the roof. To be prepared for a heavy \r\n\tNovember rain you should count one liter of rain water falling on a meter of \r\n\tthe horizontal plane during one second.TaskWrite a program that:reads the description of a roof,computes the amount of water down in one second from each segment of the roof,writes the results.InputThe input begins with the integer t, the number of test cases. Then t test \r\n\tcases follow.For each test case the first line of the input contains one integer n (1 ≤ \r\n\tn ≤ 40000) being the number of segments of the roof. Each of the next n \r\n\tlines describes one segment of the roof and contains four integers x1, \r\n\ty1, x2, y2(0 ≤ x1, y1, \r\n\tx2, y2≤ 1000000, x1< x2, \r\n\ty1≠ y2) separated by single spaces. Integers x1, \r\n\ty1are respectively the horizontal position and the height of the \r\n\tleft end of the segment. Integers x2, y2are respectively \r\n\tthe horizontal position and the height of the right end of the segment. The \r\n\tsegments don't have common points and there are no horizontal segments. You can \r\n\talso assume that there are at most 25 segments placed above any point on the \r\n\tground level.OutputFor each test case the output consists of n lines. The i-th line should contain \r\nthe amount of water (in liters) down from the i-th segment of the roof in one \r\nsecond.ExampleInput:1\r\n6 \r\n13 7 15 6 \r\n3 8 7 7 \r\n1 7 5 6 \r\n5 5 9 3 \r\n6 3 8 2 \r\n9 6 12 8Output:2 \r\n4 \r\n2 \r\n11 \r\n0 \r\n3Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Input:1\r\n6 \r\n13 7 15 6 \r\n3 8 7 7 \r\n1 7 5 6 \r\n5 5 9 3 \r\n6 3 8 2 \r\n9 6 12 8Output:2 \r\n4 \r\n2 \r\n11 \r\n0 \r\n3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RAIN1",
  "scraped_at": "2025-08-17 00:33:44"
}