{
  "problem_code": "problems",
  "title": "Football",
  "tags": [],
  "text": "Eric has a classic football that is made of 32 pieces of leather: 12 black \r\n\tpentagons and 20 white hexagons. Each pentagon adjoins 5 hexagons and each \r\n\thexagon adjoins 3 pentagons and 3 hexagons. Eric drew a polygon (i.e. a closed \r\n\tline without intersections) along the edges of the pieces. The polygon divided \r\n\tthe ball into two parts and Eric painted one of them green.He is curious if given a description of the polygon you are able to compute the \r\n\tnumber of black, white and green pieces?TaskWrite a program that:reads the description of a polygon,computes the number of black, white and green pieces,writes the result.Contest note: the first accepted solution will be awarded with the original \r\n\tfootball used for preparing the problem, signed by Eric, the author of the \r\n\tproblem!SPOJ note: the first accepted solution will be awarded some other sphere, \r\n\twithout anybody's signatures, sent in PNG format to the author's email address \r\n\t[the offer is invalid, the sphere has already  been presented to Robin Nittka, University of Ulm, Germany].InputThe input begins with the integer t, the number of test cases. Then t test \r\n\tcases follow.For each test case, the first line of the input contains one integer n being \r\n\tthe number of vertices of the polygon. The second line of the input contains n \r\n\tintegers a1, a2,..., anseparated by single \r\n\tspaces. Integer ai(equal 1 or 2) is the number of green pieces \r\n\tadjoining the i-th vertex of the polygon. The side of the polygon connecting \r\n\tthe n-th and the first vertex always lies between two hexagons.OutputFor each test case the first and only line of the output contains three \r\n\tintegers b, w and g - the numbers of black, white and green pieces \r\n\trespectively.ExampleSample input:1\r\n21 \r\n1 2 1 2 1 2 1 1 1 2 2 1 1 1 1 2 2 2 1 1 1Sample output:11 15 6",
  "sample_input": "Sample input:1\r\n21 \r\n1 2 1 2 1 2 1 1 1 2 2 1 1 1 1 2 2 2 1 1 1Sample output:11 15 6",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/FOOTBALL",
  "scraped_at": "2025-08-17 00:33:46"
}