{
  "problem_code": "problems",
  "title": "Dance Floor",
  "tags": [],
  "text": "You recently watched a video clip in which a singer danced on a grid of colourful tiles enlightened from below. Each step on a tile flipped the tile's state, i.e. light on or off. In addition to that, all the neighbouring tiles flipped their states, too.In this task, you are supposed to come up with a short program that decides if it is possible for the singer to switch on the lights of all the tiles, provided that he dances on the appropriate tiles.The dance floor has rectangular shape. At the beginning, some of the tiles are already alight. Your program may temporarily switch off some tiles, if it deems that necessary to reach its goal. Stepping on a tile toggles its own state as well as the states of the four neighbouring tiles directly above, below, to the left and to the right. Of course, in the case of a peripheral tile, there will be only three or two neighbouring tiles.Here comes an example:If the dancer steps on the tile indicated by the brown shoe, all the tiles within the white area change their states. The resulting dance floor is depicted on the right.You may assume that the singer is fit enough to jump from any tile to any other tile, even if the destination tile lies on the opposite side of the dance floor.InputThere are several test cases.\r\nThe first line of each case contains two integer numbersxandy,\r\n  indicating the width and the height of the dance floor grid. The numbers are\r\n  separated by a single space and satisfy 3 ≤x,y≤\r\n  15.The followingylines containingxcharacters each describe\r\n  the initial on/off states of the tiles. A zero means \"the tile is switched\r\n  off\", a one digit means \"the tile is alight\".Input ends with 0 0.OutputFor each test case your program should output the number of steps needed to switch all the lights on, followed by exactly that many lines with two space-separated numbersiandj. Each individual line commands the singer to\r\n  step on thei-th tile of thej-th row. Starting with the situation\r\n  of the input file and executing all the commands in the output file, all the\r\n  tiles must be switched on.If more than one solution exist, your program should output an arbitrary one\r\n  of them. If, on the other hand, no solution exists, your program should write the number \"-1\".ExampleSample input4 3\r\n0111\r\n1010\r\n1000\r\n\r\n0 0Sample output3\r\n1 2\r\n1 3\r\n4 3",
  "sample_input": "Sample input4 3\r\n0111\r\n1010\r\n1000\r\n\r\n0 0Sample output3\r\n1 2\r\n1 3\r\n4 3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DFLOOR",
  "scraped_at": "2025-08-17 00:33:47"
}