{
  "problem_code": "problems",
  "title": "Which is Next",
  "tags": [],
  "text": "Every computer science student knows binary trees. Here is one of many possible \r\n\tdefinitions of binary trees. Binary trees are defined inductively. A binary \r\n\ttree t is either an external node (leaf)or an ordered pair t = (t1, t2) representing an internal \r\n\tnodewith two subtrees attached, left \r\n\tsubtree t1and right subtree t2. Under this definition \r\n\tthe number of nodes in any binary tree is odd. Given an odd integer n let B(n) \r\n\tdenote the set of all binary trees with n nodes, both internal and external. \r\n\tFor instance B(1) consists of only one tree, \r\n\tB(3) = {(,)} \r\n\tand B(5) = {(, (,)), ((,),)}. \r\n\tThe trees of B(5) are depicted in the figure below.Denote by |t| the number of nodes in a tree t. Given a tree t we define its \r\n\tunique integer identifier N (t) as follows:N () = 0N (t1, t2) = 2|t1|+|t2|+ \r\n\t\t\t2|t2|* N(t1) +N (t2)For instance, N (,) \r\n\t= 22+ 21* 0 + 0 = 4, N (, \r\n\t(,)) \r\n\t= 24+ 23* 0 + 4 = 20,N ((,),) \r\n\t= 24+ 21* 4 + 0 = 24.Consider the following linear order on all binary trees:1)< = t2) (t1, t2) < = (u1, u2) when t1< u1, or t1= u1and t2< = u2In this order a single leafis the \r\nsmallest tree and given two nonleaf trees, the smaller one is that with the \r\nsmaller left tree, if the left subtrees are different, and that with the \r\nsmaller right subtree, otherwise. Hence for instance (, \r\n(,)) \r\n< ((,),), since we have< (,). \r\nAssume now that the trees in B(n) were sorted using the relation < =. Then, \r\nfor each tree t in B(n) we define the successor of t as the tree that \r\nimmediately follows t in B(n). If t is the largest one in B(n) then the \r\nsuccessor of t is the smallest tree in set B(n). For instance, the successor of \r\n(,) \r\nin B(3) is the same tree (,) \r\nand the successor of (, (,)) in B(5) is ((,),). \r\nGiven the integer identifier of some tree t can you give the identifier of the \r\nsuccessor of t in B(|t|)?TaskWrite a program that:reads the identifier of some binary tree t,computes the identifier of the successor of t in B(|t|),writes the result.InputThe input begins with the integer t, the number of test cases. Then t test \r\n\tcases follow.For each test case the first and only line of the input contains one integer n \r\n\t(0 <= n < = 230) - the identifier of some binary tree t.OutputFor each test case the first and only line of the output should contain one \r\n\tinteger s - the identifier of the successor of t in B(|t|).ExampleSample input:1\r\n20Sample output:24",
  "sample_input": "Sample input:1\r\n20Sample output:24",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TREE2",
  "scraped_at": "2025-08-17 00:33:51"
}