{
  "problem_code": "problems",
  "title": "Decoding Morse Sequences",
  "tags": [],
  "text": "Before the digital age, the most common \"binary\" code for radio communication was the Morse \r\ncode. In Morse code, symbols are encoded as sequences of short and long pulses (called dots and dashes \r\nrespectively). The following table reproduces the Morse code for the alphabet, where dots and dashes \r\nare represented as ASCII characters \".\" and \"-\":A .-   B -... C -.-. D -.. \r\nE .    F ..-. G --.  H .... \r\nI ..   J .--- K -.-  L .-.. \r\nM --   N -.   O ---  P .--. \r\nQ --.- R .-.  S ...  T - \r\nU ..-  V ...- W .--  X -..- \r\nY -.-- Z --..Notice that in the absence of pauses between letters there might be multiple interpretations of a Morse \r\nsequence. For example, the sequence -.-..-- could be decoded both as CAT or NXT (among others). A \r\nhuman Morse operator would use other context information (such as a language dictionary) to decide \r\nthe appropriate decoding. But even provided with such dictionary one can obtain multiple phrases from \r\na single Morse sequence.TaskWrite a program that:reads a Morse sequence and a list of words (a dictionary),computes the number of distinct phrases that can be obtained from the given Morse sequence using \r\nwords from the dictionary,writes the result.Notice that we are interested in full matches, i.e. the complete Morse sequence must be matched to \r\nwords in the dictionary.InputThe first line of the input contains exactly one positive integer d equal to the number of data sets, \r\n1 ≤ d ≤ 20. The data sets follow.The first line of each data set contains a Morse sequence - a nonempty sequence of at most 10000 \r\ncharacters \".\" and \"-\" with no spaces in between.The second line contains exactly one integer n, 1 ≤ n ≤ 10000, equal to the number of words in \r\na dictionary. Each of the following n lines contains one dictionary word - a nonempty sequence of at \r\nmost 20 capital letters from \"A\" to \"Z\". No word occurs in the dictionary more than once.OutputThe output should consist of exactly d lines, one line for each data set. Line i should contain one integer \r\nequal to the number of distinct phrases into which the Morse sequence from the i-th data set can be \r\nparsed. You may assume that this number is at most 2*109for every single data set.ExampleSample input:1 \r\n.---.--.-.-.-.---...-.---. \r\n6 \r\nAT \r\nTACK \r\nTICK \r\nATTACK \r\nDAWN \r\nDUSKSample output:2",
  "sample_input": "A .-   B -... C -.-. D -.. \r\nE .    F ..-. G --.  H .... \r\nI ..   J .--- K -.-  L .-.. \r\nM --   N -.   O ---  P .--. \r\nQ --.- R .-.  S ...  T - \r\nU ..-  V ...- W .--  X -..- \r\nY -.-- Z --..",
  "sample_output": "Sample input:1 \r\n.---.--.-.-.-.---...-.---. \r\n6 \r\nAT \r\nTACK \r\nTICK \r\nATTACK \r\nDAWN \r\nDUSKSample output:2",
  "link": "https://www.spoj.com/problems/MORSE",
  "scraped_at": "2025-08-17 00:33:49"
}