{
  "problem_code": "problems",
  "title": "Alice and Bob",
  "tags": [],
  "text": "This is a puzzle for two persons, let's say Alice and Bob. Alice draws an\r\nn-vertex convex polygon and numbers its vertices with integers 1, 2 ... n in\r\nan arbitrary way. Then she draws a number of noncrossing diagonals (the\r\nvertices of the polygon are not considered to be crossing points). She informs\r\nBob about the sides and the diagonals of the polygon but not telling him which\r\nare which. Each side and diagonal is specified by its ends. Bob has to guess\r\nthe order of the vertices on the border of the polygon. Help him solve the\r\npuzzle.If n = 4 and (1, 3), (4, 2), (1, 2), (4, 1), (2, 3) are the ends of four sides and\r\none diagonal then the order of the vertices on the border of this polygon is 1,\r\n3, 2, 4 (with the accuracy to shifting and reversing).TaskWrite a program that:reads the description of sides and diagonals given to Bob by Alice,computes the order of the vertices on the border of the polygon,writes the result.InputThe first line of the input contains exactly one positive integer d equal to\r\nthe number of data sets, 1 ≤ d ≤ 20. The data sets follow.Each data set consists of exactly two consecutive lines.The first of those lines contains exactly two integers n and m separated by a\r\nsingle space, 3 ≤ n ≤ 10 000, 0 ≤ m ≤ n-3. Integer n is the\r\nnumber of vertices of a polygon and integer m is the number of its diagonals,\r\nrespectively.The second of those lines contains exactly 2(m+n) integers separated by single\r\nspaces. Those are ends of all sides and some diagonals of the polygon. Integers\r\naj, bjon positions 2j-1 and 2j, 1 ≤ j ≤ m+n, 1\r\n≤ aj≤ n, 1 ≤ bj≤ n, aj<>\r\nbj, specify ends of a side or a diagonal. The sides and the\r\ndiagonals can be given in an arbitrary order. There are no duplicates. Alice\r\ndoes not cheat, i.e. the puzzle always has a solution.OutputLine i, 1 ≤ i ≤ d, should contain a sequence of n integers separated\r\nby single spaces - a permutation of 1, 2 ... n, i.e. the numbers of\r\nsubsequent vertices on the border of the polygon from the i-th data set, the\r\nsequence should always start from 1 and its second element should be the\r\nsmaller vertex of the two border neighbours of vertex 1.ExampleInput:1\r\n4 1\r\n1 3 4 2 1 2\r\n4 1 2 3Output:1 3 2 4Warning: large Input/Output data, be careful with certain languages",
  "sample_input": "Input:1\r\n4 1\r\n1 3 4 2 1 2\r\n4 1 2 3Output:1 3 2 4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ALICEBOB",
  "scraped_at": "2025-08-17 00:33:42"
}