{
  "problem_code": "problems",
  "title": "Calendar of the Maya",
  "tags": [],
  "text": "The Classical Maya civilization developed in what is today southern Mexico, \r\n\tGuatemala, Belize and northern Honduras. During its height they developed a \r\n\tsophisticated system for time keeping which they used both to record history \r\n\tand for divinatory rituals. Their calendar consisted of 3 components. the \r\n\tTzolkin, the Haab and the Long Count.For divinatory purposes the Maya used the Tzolkin which was composed of 20 day \r\n\tnames to which numeric coefficients from 1 to 13 were attached giving a total \r\n\tof 260 distinct combinations. This is the size of the Tzolkin, or ritual, year. \r\n\tFrom Spanish colonial sources, we know the names of the days:Imix, Ik, Akbal, \r\n\t\tKan, Chikchan, Kimi, Manik, Lamat, Muluk, Ok, Chuen, Eb, Ben, Ix, Men, Kib, \r\n\t\tKaban, Etznab, Kawak, Ajaw. The sequence of days developed as follows \r\n\t(starting for example at 9 Imix):9 Imix, 10 Ik, 11 Akbal, 12 Kan, 13 Chikchan, 1 Kimi, 2 Manik, ...The Haab calendar was an astronomical one. It had 365 days divided into 19 \r\n\tmonths each with 20 days, except the last one which had only 5 days. In a \r\n\tmanner similar to the Tzolkin each month name had a number from 1 to 20 \r\n\tindicating the day number within the month. Again, from Spanish colonial \r\n\tsources, we know the names of the months:Pohp, Wo, Sip, Zotz, Sek, Xul, \r\n\t\tYaxkin, Mol, Chen, Yax, Sak, Keh, Mak, Kankin, Muan, Pax, Kayab, Kumku, Wayeb. \r\n\tThe month Wayeb had just 5 days and was considered an unlucky time of the year.The Tzolkin and Haab were combined in the inscriptions to create the Calendar \r\n\tRound, combining the 260 day cycle of the Tzolkin and the 365 day cycle of the \r\n\tHaab. A typical Calendar Round date in the inscriptions might be. 3 Lamat 6 \r\n\tPax. Note that not all of the combination of days, months and coefficients are \r\n\tpossible.A typical sequence of days in the Calendar Round (starting for example at 3 \r\n\tLamat 6 Pax):3 Lamat 6 Pax, 4 Muluk 7 Pax, 5 Ok 8 Pax, 6 Chuen 9 Pax, 7 Eb 10 Pax, \r\n8 Ben 11 Pax, 9 Ix 12 Pax, 10 Men 13 Pax, 11 Kib 14 Pax, 12 Kaban 15 Pax, \r\n13 Etznab 16 Pax, 1 Kawak 17 Pax, 2 Ajaw 18 Pax, 3 Imix 19 Pax, 4 Ik 20 Pax, \r\n5 Akbal 1 Kayab, 6 Kan 2 Kayab, ...Finally, at the beginning of the Classic Period (AD 200 - 900), the Maya \r\n\tdeveloped an absolute calendar called Long Count which counted the days from a \r\n\tfixed date in the past (the date when the current world was created according \r\n\tto Maya belief). Dates in the Long Count are given (for simplicity) in 5-tuples \r\n\tof the form. 9.2.3.4.5. Such a date one reads \"9 baktuns 2 katuns 3 tuns 4 \r\n\twinals 5 kins since the zero date\". A \"kin\" is just one day. A winal is a group \r\n\tof 20 days. A tun is a group of 18 winals (thus a tun has 20*18 = 360 days, 5 \r\n\tdays short of a year). From here on all units come in multiples of 20. Thus a \r\n\tkatun is equal to 20 tuns (almost 20 years) and a baktun means 20 katuns \r\n\t(almost 400 years). Thus 9.2.3.4.5 really means \"9*144000+2*7200+3*360+4*20+5 \r\n\tdays since the zero date\". Note that for every Long Count date b.k.t.w.i we \r\n\thave 0 <= k < 20; 0 <= t < 20; 0 <= w < 18; 0 <= i < \r\n\t20. Given the periodicity of the Calendar Round, a legal date such as 3 Lamat 6 \r\n\tPax has multiple occurrences in the Long Count. Thus, one difficulty in reading \r\n\tinscriptions is in establishing a date for the inscription when the date is \r\n\tgiven only in terms of a Calendar Round (very common). In this case one must \r\n\tcompute \"all\" the possible Long Count dates associated with the particular \r\n\tCalendar Round and based in some other context information deduce (for example, \r\n\tthe text mentions a king for which other dates are known) which one applies.We limit our interest to the Long Count dates in the baktuns 8 and 9 (they \r\n\tcover all the Classic Period). We know that the Long Count date 8.0.0.0.0 fell \r\n\ton the Calendar Round 9 Ajaw 3 Sip.TaskWrite a program that:reads a Calendar Round date,computes all Long Count dates in the baktuns 8 and 9 for the given Calendar \r\n\t\tRound date if this date is legal,writes the result.InputThe first line of the input contains exactly one positive integer d equal to \r\n\tthe number of data sets, 1 <= d <= 30. The data sets follow.Each data set consists of exactly one line that contains exactly one Calendar \r\n\tRound date (maybe illegal). Tzolkin day number, Tzolkin day name, Haab day \r\n\tnumber and Haab month name separated by single spaces.OutputFor every data set your program must output an ascending sequence of Long Count \r\n\tdates computed for a given Calendar Round date. The first line of the output \r\n\tfor the given input set should contain exactly one integer n equal to the \r\n\tlength of the sequence (0, if the input date is illegal).Each of the next n lines should contain exactly one Long Count date specified \r\n\tby exactly 5 integers (meaning the numbers of baktuns, katuns, tuns, winals and \r\n\tkins respectively) separated by single dots.ExampleSample input:2 \r\n3 Lamat 6 Pax \r\n1 Ajaw 9 ChenSample output:15 \r\n8.0.17.17.8 \r\n8.3.10.12.8 \r\n8.6.3.7.8 \r\n8.8.16.2.8 \r\n8.11.8.15.8 \r\n8.14.1.10.8 \r\n8.16.14.5.8 \r\n8.19.7.0.8 \r\n9.1.19.13.8 \r\n9.4.12.8.8 \r\n9.7.5.3.8 \r\n9.9.17.16.8 \r\n9.12.10.11.8 \r\n9.15.3.6.8 \r\n9.17.16.1.8 \r\n0",
  "sample_input": "9 Imix, 10 Ik, 11 Akbal, 12 Kan, 13 Chikchan, 1 Kimi, 2 Manik, ...",
  "sample_output": "3 Lamat 6 Pax, 4 Muluk 7 Pax, 5 Ok 8 Pax, 6 Chuen 9 Pax, 7 Eb 10 Pax, \r\n8 Ben 11 Pax, 9 Ix 12 Pax, 10 Men 13 Pax, 11 Kib 14 Pax, 12 Kaban 15 Pax, \r\n13 Etznab 16 Pax, 1 Kawak 17 Pax, 2 Ajaw 18 Pax, 3 Imix 19 Pax, 4 Ik 20 Pax, \r\n5 Akbal 1 Kayab, 6 Kan 2 Kayab, ...",
  "link": "https://www.spoj.com/problems/MAYACAL",
  "scraped_at": "2025-08-17 00:33:47"
}