{
  "problem_code": "problems",
  "title": "Farmer Joe",
  "tags": [],
  "text": "Farmer Joe is a strange fellow indeed. He owns a rare breed of cow that eats chocolate and produces chocolate milk, and each cow has exactlyLlegs. Lately, Joe has been suffering from sore feet, and his intuition tells him that it must be from the chocolate milk. The cows, he suspects, are in pain from stepping on sharp pebbles while crossing the road with chickens in their bare hooves. Naturally, they are transferring their pain karmically through the milk. So he has taken it upon himself to make proper hoofwear for all of them. As he lives at the top of an ivory tower, he finds it most convenient to count their heads. (Each cow has exactly one head.) Joe would like to know how many shoes he must make given that he has countedHheads, and in fact he wrote a program for just this purpose but can’t seem to find it. The program is written for a special computer that he constructed while he was writing his dissertation on Turing machines. He has asked for your help in replacing his program. Please help him quickly, so his cows can suffer as little as possible.Note:You can use any programming language you want, as long as it is brainf**k.InputThe first line contains an integerT(1 ≤T≤ 1000). Then followTlines, each containing integersLandH(0 ≤L,H≤ 1020) separated by a single space. Each line, including the last, is terminated by a single newline (linefeed) character, which has ASCII value 10.OutputTlines containing the number of shoes Farmer Joe must make.ExampleInput:5\r\n0 0\r\n0 42\r\n42 0\r\n42 42\r\n12345 67890Output:0\r\n0\r\n0\r\n1764\r\n838102050Additional InfoThere are two randomly generated data sets, one withT=1000 and the other withT=500.LandHare generated independently, and the average number of digits in either is about 11.My solution at the time of publication has 410 bytes (not golfed) and runs in 0.27s with 1.8M memory footprint.",
  "sample_input": "Input:5\r\n0 0\r\n0 42\r\n42 0\r\n42 42\r\n12345 67890Output:0\r\n0\r\n0\r\n1764\r\n838102050",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BFMUL",
  "scraped_at": "2025-08-17 00:33:35"
}