{
  "problem_code": "problems",
  "title": "Davids Quest",
  "tags": [],
  "text": "David is playing minesweeper and he really wants to break his record at the game. The only way to achieve this is by cheating! As he is a fast clicker (or at least he believes that), he wants to know how much clicks must be given in order to solve the puzzle.I case you never played minesweeper, here are some basic rules. You are given a rectangular map divided into square cells. At the start of the game, all the cells are hidden. Under some of them there are mines. You are required to uncover all cells WITHOUT mines (we will call them safe cells). If you try to uncover a mine, the game is over and you lost. On safe cells there are hints to help you along the way. They contain numbers that indicate how many mines are hidden on the 8 adjacent cells (less in case of border cells). So we have numbers 1 to 8 and those can be uncovered with a single click. If there are no neighboring mines the filed is simply empty. In addition, if you will uncover this empty cells, all its neighboring will be uncovered automatically. This effect is also recursive, so can uncover a bigger chunk with one click, if there are more connected empty cells.David knows everything about the puzzle: where the mines are located and thus he can also deduce the number hints on others cells.InputThe first line contains an integer T, the number of test cases. Description of T testcases follow. Every case with two numbers N and M: denoting the height and the width of the puzzle. Then N lines with M characters each. Characters are as follows:'-': denotes an empty cell,'*': denotes a mine,'1'-'8': Numbersidenotes that there isimines adjacent to the current one.OutputFor each input case you must print a single line. The string \"Scenario #i: \" where i denotes the case you are analyzing (starting with 1), followed by the number of clicks that must be given in order to uncover all safe cells.INPUTOUTPUT3\r\n3 2\r\n*2\r\n2*\r\n11\r\n3 3\r\n***\r\n232\r\n---\r\n8 8\r\n1*1-----\r\n111-1221\r\n----1**1\r\n----2331\r\n11--1*32\r\n*1--13**\r\n11---2**\r\n-----13*Scenario #1: 4\r\nScenario #2: 1\r\nScenario #3: 9Constraints - Subtask 1 (40%)1 ≤ T ≤ 101 ≤ N ≤ 1281 ≤ M ≤ 128Constraints - Subtask 2 (60%)1 ≤ T ≤ 101 ≤ N ≤ 20481 ≤ M ≤ 2048",
  "sample_input": "3\r\n3 2\r\n*2\r\n2*\r\n11\r\n3 3\r\n***\r\n232\r\n---\r\n8 8\r\n1*1-----\r\n111-1221\r\n----1**1\r\n----2331\r\n11--1*32\r\n*1--13**\r\n11---2**\r\n-----13*",
  "sample_output": "Scenario #1: 4\r\nScenario #2: 1\r\nScenario #3: 9",
  "link": "https://www.spoj.com/problems/VPL2_AD",
  "scraped_at": "2025-08-17 00:33:47"
}