{
  "problem_code": "problems",
  "title": "Peter Quest",
  "tags": [],
  "text": "Is Peter’s birthday! And his friends are preparing a big party, however, Peter is obsessed with a variation of the famous game Minesweeper, moreover, Peter hates losing, so if any of you or your friends can beat him in the game, he will get angry and will attend the party that everyone is organizing for him.This new mode of Minesweeper consists in building the gameboard given the mines, so, if the matrix has size of (2×2) and there is a mine in the position (0, 0) of the matrix, the resultant gameboard will be *1 11 Your task is to beat Peter and celebrate his birthday before its too late! Please have in consideration that:The cell (i, j) where there is a mine will be denoted as ’*’.The cell (i, j) where there is no mine will be denoted as ’-’.The cell (i, j) where there is N mines adjacent to it, will be denoted as a number from 1 to 8 (depending on the number of adjacencies.)InputThe first line contains an integer T, which specifies the number of test cases. Then, will follow the descriptions of T test cases.For each test case, you will have a line with three numbers N, M, K, denoting, respectively, the size of the matrix, formed by N columns and M rows, and K mines. Then, K lines will follow, each containing two numbers Ki and Kj denoting the position where the mine is in the board.OutputFor each test case you should print the string \"Scenario #i:\" where i represents the test case you are analyzing (starting from 1), then, in the next line, you shall print the gameboard as specified.ExampleInput:3\r\n3 2 2\r\n0 0\r\n1 1\r\n3 3 3\r\n0 0\r\n1 1\r\n2 2\r\n8 8 10\r\n0 1\r\n5 0\r\n2 5\r\n4 5\r\n2 6\r\n5 6\r\n6 6\r\n5 7\r\n6 7\r\n7 7Output:Scenario #1:\r\n*2\r\n2*\r\n11\r\nScenario #2:\r\n*21\r\n2*2\r\n12*\r\nScenario #3:\r\n1*1-----\r\n111-1221\r\n----1**1\r\n----2331\r\n11--1*32\r\n*1--13**\r\n11---2**\r\n-----13*ConstraintsSubtask 1 (10%)1 ≤ T ≤ 101 ≤ N, M ≤ 81 ≤ K ≤ min(8, N×M)Subtask 2 (20%)1 ≤ T ≤ 101 ≤ N, M ≤ 1281 ≤ K ≤ min(128, N×M)Subtask 3 (30%)1 ≤ T ≤ 101 ≤ N, M ≤ 10241 ≤ K ≤ min(1024, N×M)Subtask 4 (40%)1 ≤ T ≤ 101 ≤ N, M ≤ 61441 ≤ K ≤ min(100000, N×M)",
  "sample_input": "Input:3\r\n3 2 2\r\n0 0\r\n1 1\r\n3 3 3\r\n0 0\r\n1 1\r\n2 2\r\n8 8 10\r\n0 1\r\n5 0\r\n2 5\r\n4 5\r\n2 6\r\n5 6\r\n6 6\r\n5 7\r\n6 7\r\n7 7Output:Scenario #1:\r\n*2\r\n2*\r\n11\r\nScenario #2:\r\n*21\r\n2*2\r\n12*\r\nScenario #3:\r\n1*1-----\r\n111-1221\r\n----1**1\r\n----2331\r\n11--1*32\r\n*1--13**\r\n11---2**\r\n-----13*",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/VPL2_BC",
  "scraped_at": "2025-08-17 00:33:52"
}