{
  "problem_code": "problems",
  "title": "Cut The Rope",
  "tags": [],
  "text": "Budi is a rope seller, He initially has two ropes to sell with lengthaandbwhereaandbis positive integer less than 10100. One day he meet with strange rich customer, the customer want to buy all rope with equal length only. Budi has an idea to sell all his rope to that customer: cut the rope until all his rope become equal length. Because Budi want maximum profit, he need to minimize the \"cut\" operation. But the customer doesn't like waiting, so Budi must calculate and do \"cut\" operation quickly.The customer can wait 60 seconds only, Budi can cut the rope in exactly 10 seconds, so Budi have 50 seconds to calculate number of \"cut\" operation needed.Help Budi to calculate number of \"cut\" operation and length of each rope after cutting process done. But unfortunately your modern calculator isn't working, so the only way to do is usingbrainf**kcalculator, with 8 valid commands only. Will you help Budi?InputFirst line of input there is an integerT≤ 1000 denoting number of test case.NextTlines there're two positive integeraandbdenoting length of rope that Budi has initially. Separated by a space (ASCII:32).Each line is terminated with newline character (ASCII:10).OutputFor each case, output two number: first number is minimum number of cut operation, and second number is length of each rope after cutting process done.ExampleInput:4\r\n1 42\r\n42 1\r\n42 42\r\n12345 67890Output:41 1\r\n41 1\r\n0 42\r\n5347 15Other InfoInput: generated 99.9% random with average digit is about 74.8 digitsOutput: Average digit for \"cut\" operation is about 34.7 digits, and length of rope after cutting process done is about 49.0 digits.This problem is using custom judge, so you can see the detail after you get AC/WA.Judge output format is like this: (\"Code Length (Valid Command only)\")\"Cell Used\"(\"BF Command executed\").Click here to see my submission result for this problem.Judge output for my BF code is: (11820)1157(6571171311) meaning that my Valid BF commands = 11820 commands and My code using 1157 BF cell and 6571171311 commands executed.You can click (AC/WA) status for more detail.My code running time is 6.95s and using 1.9M of memory.Time limit is ~7× my BF program speed.See also:Another problem added by Tjandra Satria Gunawan",
  "sample_input": "Input:4\r\n1 42\r\n42 1\r\n42 42\r\n12345 67890Output:41 1\r\n41 1\r\n0 42\r\n5347 15",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BFGCD",
  "scraped_at": "2025-08-17 00:33:51"
}