{
  "problem_code": "problems",
  "title": "Do You Even Lift",
  "tags": [],
  "text": "Summer's coming up in a few months, so you decide to hit the gym to put on some muscle. When you arrive, you're confronted with dozens of machines, free weights, barbells, stationary bikes and more. All of this is quite confusing to a newcomer, so you just stand there confused, checking your cellphone a few times, and leave.After this less-than-stellar experience, you decide to do some research online. You learn that people train in things called \"programs\", which are instructions to determine how much weight to lift on a particular day. These are always of the form \"Lift twice what you lifted three days ago, plus three times what you lifted 7 days ago\", or similar. In general, such a \"program\" tells you that the weight you need to lift today is some combination of the weights you've lifted previously. The program also gives you some initial weights, for when the formula doesn't make sense.Being very clever, however, you decide that the advice you find during your research is for suckers. You won't even bother with known programs like Starting Strength, StrongLifts 5×5, or even CrossFit. What you'll do is much cleverer: You'll go to the gym, find the most jacked bro in there, and imitate his program. To figure out his program, you'll record what he lifts each day he goes to the gym, for a few days.Since you are lazy, of all the possible programs he could be following which would match your observations, you want only the shortest one (the one that mentions as few days back as possible). Can you find it?InputThe input consists of multiple test cases, and starts with a positive integer T. T test cases follow.Each test case starts with a number K, the number of days you've watched the bro lift weights for. After that come K nonnegative integers Wi, denoting the weight he lifted each day, from oldest lifts to most recent ones. You are assured that the bro is indeed following a program.OutputFor each test case, output a single line, consisting of N space separated non-negative integers Di, if the program says each day you should lift the sum of (Ditimes the weight you lifted i days ago), for 1 ≤ i ≤ N. N is the length of the shortest solution you found and should not be printedExampleInput:5\r\n10 48 64 96 128 192 256 384 512 768 1024\r\n8 3 3 2 25 136 782 4479 25659 \r\n8 3 3 24 87 381 1578 6639 27807\r\n14 3 3 1 2 4 8 16 32 64 128 256 512 1024 2048 \r\n8 16909 42737 110373 281321 722813 1848097 4739349 12131737Output:0 2\r\n5 4 1\r\n3 5\r\n2 0 0\r\n1 4Constraints1 ≤ T ≤ 5×1031 ≤ K ≤ 44K = 0 (mod 2)0 ≤ Wi< 263In every program, K ≥ 2N.Warning: You may need to use very big integers.",
  "sample_input": "Input:5\r\n10 48 64 96 128 192 256 384 512 768 1024\r\n8 3 3 2 25 136 782 4479 25659 \r\n8 3 3 24 87 381 1578 6639 27807\r\n14 3 3 1 2 4 8 16 32 64 128 256 512 1024 2048 \r\n8 16909 42737 110373 281321 722813 1848097 4739349 12131737Output:0 2\r\n5 4 1\r\n3 5\r\n2 0 0\r\n1 4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DYEL",
  "scraped_at": "2025-08-17 00:33:45"
}