{
  "problem_code": "problems",
  "title": "Help the old King",
  "tags": [],
  "text": "Once upon a time there lived a king in a far far country. In the country, there are n cities and m roads. He was severely attacked by his enemy. The enemy damaged all the cities of King's country. As the roads between the cities had been damaged, the King wanted to repair those. So he decided to launch a tender for this.As King's country is a well managed country. By well managed country, we mean that it is possible to go from each city to any other city. But now as the city has been destroyed by enemies, all the roads are broken, the king will like to rebuild the roads in such a way that it is still a well managed country.Cost of repairing the road in the country is really weird, it is not addition of costs but it is instead multiplication of those. What it means that if the king decides that he should repair 5 roads, then total cost of repairing those roads will be multiplication of all the 5 costs.As the King's treasure has been damaged by the attack of foreign city, he would like to spend minimum amount of money and that the will want that his country still remains well managed country. Surprisingly the company that was given tender had a rule that all the costs will be in powers of two, as they were really love with binary numbers.As value of the total cost can be really large. We do not want to know the actual cost, instead output number of divisors of the number.InputT: number of test cases (T ≤ 5)n and m (n ≤ 105, m ≤ 2 × 105)Next m lines will have a, b, c, which denotes that cities a and b are connected with road of cost c.(2 ≤ c ≤ 1018, and c will always be power of 2) (1 ≤ a ≤ n) (1 ≤ b ≤ n)OutputFor each test case, output a single line containing a number as stated in the problem.ExampleInput:4\r\n2 1\r\n1 2 16\r\n3 2\r\n2 3 32\r\n1 2 16\r\n3 3\r\n2 3 32\r\n1 2 16\r\n1 3 64\r\n5 5\r\n1 2 2\r\n2 3 2\r\n1 3 4\r\n3 4 16\r\n3 5 8Output:5\r\n10\r\n10\r\n10",
  "sample_input": "Input:4\r\n2 1\r\n1 2 16\r\n3 2\r\n2 3 32\r\n1 2 16\r\n3 3\r\n2 3 32\r\n1 2 16\r\n1 3 64\r\n5 5\r\n1 2 2\r\n2 3 2\r\n1 3 4\r\n3 4 16\r\n3 5 8Output:5\r\n10\r\n10\r\n10",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/IITKWPCG",
  "scraped_at": "2025-08-17 00:33:45"
}