{
  "problem_code": "problems",
  "title": "Fire Extinguishers",
  "tags": [],
  "text": "Byteasar has had a new palace built. It consists of N chambers and N-1 corridors connecting them. Each corridor connects exactly two chambers. The rooms are numbered from 1 to N. There is only a single entrance to the palace, which leads to chamber number 1. For each chamber there is exactly one route leading to it from the entrance, without turning back on the way. In other words, the chambers and the corridors form atree- a connected acyclic graph.The fire marshal who is to approve the building demands placing fire extinguishers inside. The following are his exact requirements:The fire extinguishers should be placed in (some) chambers, and one chamber may store any number of extinguishers.Each chamber has to be assigned one fire extinguisher, though it may be stored in another chamber.Each fire extinguisher can be assigned to at most S different chambers.For each room its assigned extinguisher is within the range of K corridors.Byteasar has a week spot for lavish palaces, so it is no surprise he has very little money now, right after completion of another splendid palace. Therefore he is interested in the minimum number of fire extinguishers sufficient for satisfying fire marshal's demands.InputThe first line of the standard input contains three integers N, S and K separated by single spaces, 1 ≤ N ≤ 100000, 1 ≤ S ≤ N, 1 ≤ K ≤ 20. Each of the following N-1 lines holds two integers separated by a single space. Line number i+1 contains the numbers XiYidenoting the corridor connecting chambers number Xiand Yi.OutputThe first and only line of the standard output is to hold one integer - the minimum number of fire extinguishers that have to be installed in palace.ExampleFor the input data:12 3 1\r\n1 12\r\n3 8\r\n7 8\r\n8 9\r\n2 12\r\n10 12\r\n9 12\r\n4 8\r\n5 8\r\n8 11\r\n6 8the correct result is:4",
  "sample_input": "12 3 1\r\n1 12\r\n3 8\r\n7 8\r\n8 9\r\n2 12\r\n10 12\r\n9 12\r\n4 8\r\n5 8\r\n8 11\r\n6 8",
  "sample_output": "4",
  "link": "https://www.spoj.com/problems/STC01",
  "scraped_at": "2025-08-17 00:34:00"
}