{
  "problem_code": "problems",
  "title": "Blockade",
  "tags": [],
  "text": "There are exactly N towns in Byteotia. Some towns are connected by bidirectional roads. There are no crossroads outside towns, though there may be bridges, tunnels and flyovers. Each pair of towns may be connected by at most one direct road. One can get from any town to any other-directly or indirectly.Each town has exactly one citizen. For that reason the citizens suffer from loneliness. It turns out that each citizen would like to pay a visit to every other citizen (in his host's hometown), and do it exactly once. So exactly N*(N-1) visits should take place. That's right,should. Unfortunately, a general strike of programmers, who demand an emergency purchase of software, is under way. As an act of protest, the programmers plan to block one town of Byteotia, preventing entering it, leaving it, and even passing through. As we speak, they are debating which town to choose so that the consequences are most severe.TaskWrite a programme that:reads the Byteotian road system's description from the standard input,for each town determines, how many visits could take place if this town were not blocked by programmers,writes out the outcome to the standard output.InputIn the first line of the standard input there are two positive integers: N and N (1 ≤ N ≤ 100000, 1 ≤ M ≤ 500000) denoting the number of towns and roads, respectively. The towns are numbered from 1 to N. The following M lines contain descriptions of the roads. Each line contains two integers Xiand Yi(1 ≤ Xi, Yi≤ N) and denotes a direct road between towns numbered Xiand Yi.OutputYour programme should write out exactly N integers to the standard output, one number per line. The i-th line should contain the number of visits that could not take place if the programmers blocked the town no. i.ExampleInput:5 5\r\n1 2\r\n2 3\r\n1 3\r\n3 4\r\n4 5Output:8\r\n8\r\n16\r\n14\r\n8",
  "sample_input": "Input:5 5\r\n1 2\r\n2 3\r\n1 3\r\n3 4\r\n4 5Output:8\r\n8\r\n16\r\n14\r\n8",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/STC10",
  "scraped_at": "2025-08-17 00:33:55"
}