{
  "problem_code": "problems",
  "title": "Range Sum",
  "tags": [],
  "text": "You are initially given an array of N integers (1 ≤ N ≤ 105). Given this array, you have to perform 2 kinds of operations:(i) Operation 1 : Op1(l, r)You are given 2 integers l and r. (1 ≤ l ≤ r ≤ current size of the array). You need to return the sum of all the elements with indices between l and r (both inclusive). That is, if the elements currently in the array are a1, a2, a3.... an, you need to return the following sum : al+ al+1+ al+2... + ar.(ii) Operation 2 : Op2(x)You are given a single integer x (|x| ≤ 109). Add this element to thebeginningof the array. After this operation, x will now become a1, the old a1will now become a2, and so on. The size of the array will increase by 1.InputThe first line contains a single integer N (1 ≤ N ≤ 105), the number of elements initially in the array.This is followed by a line containing N space separated integers, a1a2... aN. (|ai| ≤ 109)The next line contains a single integer Q, the number of operations you will be asked to perform. (1 ≤ Q ≤ 105)Q lines of input follow. Each such line starts with either the number 1 or the number 2. This indicates the type of operation that you are required to perform. The format of these queries are as follows:1 l r : Carry out operation 1 with arguments l and r. (1 ≤ l ≤ r ≤ current size of the array)That is, return the sum of the following array elements : al+ al+1... + ar2 x : Carry out operation 2 with the argument x. (|x| ≤ 109)That is, add the value x at the beginning of the array.OutputFor each query of type 1, output the return value on a new line. No output needs to be printed for queries of type 2.ExampleInput #1:101 2 3 4 5 6 7 8 9 1041 1 101 1 11 10 101 2 7Output #1:5511027Input #2:56 7 8 9 1092 52 41 2 72 32 22 11 1 101 1 11 10 10Output #2:4555110",
  "sample_input": "Input #1:101 2 3 4 5 6 7 8 9 1041 1 101 1 11 10 101 2 7Output #1:5511027",
  "sample_output": "Input #2:56 7 8 9 1092 52 41 2 72 32 22 11 1 101 1 11 10 10Output #2:4555110",
  "link": "https://www.spoj.com/problems/RANGESUM",
  "scraped_at": "2025-08-17 00:33:49"
}