{
  "problem_code": "problems",
  "title": "Building Bridges(HARD)",
  "tags": [],
  "text": "The tribe soon discovers that just communication is not enough and wants to meet each other to form a joint force against the terminator. But there is a deep canyon that needs to crossed. Points have been identified on both sides on which bridge ends can be made. But before the construction could be started, a witch Chudael predicted that a bridge can only be built between corresponding end points, i.e. a bridge starting from the ithend point on one side can only end on the ithend point on the other side, where the position of end points is seen in the order in which the points were identified. If not, it would lead to the end of the tribe. The tribe just wants to make as many non-overlapping bridges as possible, with the constraint in mind.InputThe first line of the input contains test cases t. It is followed by 3×t lines, 3 for each test case. The first line of input for each test case contains the number of end points identified on each side, n (1 ≤ n ≤ 105). The second line contains x-coordinates of end points identified on the first side and similarly the third line contains the x-coordinates of corresponding end points identified on the other side. The end points are inputted in the order in which they were identified. The x-coordinates can range between -106to 106.OutputYou are required to output a single line for each test case. The line contains a single integer – the maximum number of bridges possible with the constraints explained above.ExampleInput:3\r\n4\r\n2 5 8 10\r\n6 4 1 2\r\n3\r\n5 3 10\r\n6 4 1\r\n6\r\n1 2 3 4 5 6\r\n3 4 5 6 1 2Output:2\r\n2\r\n4ExplanationFor the first test case, two non-overlapping bridges can be formed between the 3rd and 4th end points on each side.(This problem is based onBRIDGE.)",
  "sample_input": "Input:3\r\n4\r\n2 5 8 10\r\n6 4 1 2\r\n3\r\n5 3 10\r\n6 4 1\r\n6\r\n1 2 3 4 5 6\r\n3 4 5 6 1 2Output:2\r\n2\r\n4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BRDGHRD",
  "scraped_at": "2025-08-17 00:34:04"
}