{
  "problem_code": "problems",
  "title": "Boxdropper",
  "tags": [],
  "text": "The University of Waterloo is famous for its booming population of geese, and many researchers go there to study them. One day, Doctor Y (known for his work in the field of boxology) decided to go there and investigate how good geese are at optimization problems.At UW, there is a large lake (so large, in fact, that the boundaries are never an issue). Doctor Y decides to drop a number of 2D boxen onto this lake and command the geese to travel from one to another, recording how much time they spend flying as opposed to walking (naturally, the geese won’t swim, considering the not-so-appealing brown colour of the lake). He has a Boxdropper machine at his disposal to do the work for him – he can give it the following commands:B$x_1$ $y_1$ $x_2$ $y_2$: Drop a box onto the lake such that its lower-left coordinate is at ($x_1$, $y_1$) and its upper-right coordinate is at ($x_2$, $y_2$). Doctor Y defines the origin to be somewhere in the middle of the lake. Note that boxen can overlap with one another.G$a$ $b$: Command the geese to travel from theathbox dropped to thebthone, and record the total distance that they fly.Since the scientific community has not yet realized the benefits of studying boxen, Doctor Y isn’t receiving much funding – as such, he only has $500$ boxen at his disposal, and his machine can only handle $10^6$ commands before it overheats.The geese can walk across boxen freely, but sometimes they may have to fly over water to reach other boxen. The geese, secretly participating in the second stage of the Canadian Computing Competition every year, are well versed in optimization problems such as these, and so will always choose a path that will minimize the total distance that they spend flying. Given the commands that Doctor Y inputs into the Boxdropper, determine the distances recorded by it (one for everyGcommand).InputOn each line, one of the 2 types of commands will be given:If the line starts with the characterB, it will be followed by 4 integers ($x_1$, $y_1$, $x_2$, and $y_2$), each with absolute value no greater than $10^6$.If the line starts with the characterG, it will be followed by 2 integers ($a$ and $b$), with $a \\neq b$ and $1 \\leq a,b \\leq n$ (where $n$ is the number ofBcommands inputted so far).Commands should be read until EOF.OutputFor everyGcommand, output the distance that the geese spend flying. The numbers should be printed one per line, and rounded off to 2 decimal places.ExampleInput:B -1 2 1 5B 3 -4 4 1G 2 1B 4 -3 6 -2B 6 -6 8 -4G 2 3G 1 4Output:2.240.003.24Explanation of Sample:The lake looks like this:For the firstGcommand, the geese must fly along the red line, which has a length of √5.For the second, the two boxen are touching, so no flight is necessary.For the third, the geese must first fly along the red line, then walk across boxen 2 and 3, and finally fly along the blue line, which has a length of 1.",
  "sample_input": "Input:B -1 2 1 5B 3 -4 4 1G 2 1B 4 -3 6 -2B 6 -6 8 -4G 2 3G 1 4Output:2.240.003.24",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BOXD",
  "scraped_at": "2025-08-17 00:33:45"
}