{
  "problem_code": "problems",
  "title": "A Romantic Movie Outing",
  "tags": [],
  "text": "Brian the Computer Science Nerd is going on a date with his girlfriend, Anatevka! His romantic location of choice is a movie theatre - but not an IMAX theatre, of course, as that would be far too expensive.This theatre has $10^9$ rows of $1000$ seats each, which are initially empty. The rows are numbered $1..10^9$ starting from the one closest to the screen, and the seats in each row are numbered $1..1000$ from left to right. Seat $c$ in row $r$ is denoted as seat ($r$, $c$). Seats in rows $1..L$ ($1 \\leq L \\leq 1000$) are considered to be \"close\" to the screen, while seats in further rows are considered to be \"far\".Over the course of $T$ ($1 \\leq T \\leq 500,000$) minutes before the movie starts, a number of events occur. During the $i$th minute, either a person enters and sits in the empty seat ($R_i$, $C_i$), the person sitting in the occupied seat ($R_i$, $C_i$) leaves, or Anatevka suggests that she and Brian take seats ($R_i$, $C_i$) and ($R_i$, $C_i+1$). The type of the $i$th event is represented by the character $E_i$, with $E_i =$ \"E\" indicating a person entering, $E_i =$ \"L\" indicating a person leaving, and $E_i =$ \"S\" indicating a seating suggestion. All seats involved in the events are valid seats inside the theatre, and every seat that Anatevka suggests will be \"close\", as she believes that they're the best.Every time Anatevka makes a suggestion, Brian must, of course, analyze its quality. If either of the two seats she suggests are already occupied, he should explain that her recommendation is invalid with a simple \"No\". Otherwise, he'd like to calculate the total inconvenience of both seats in such an arrangement. The inconvenience of sitting in seat ($r$, $c$) is the number of occupied seats in its field of vision (excluding itself). The field of vision of seat ($r$, $c$) includes all seats which are no further than it from seat ($1$, $c$) by Manhattan distance, as shown below (with the \"S\" representing a suggested seat, and an \"F\" representing a seat within its field of vision):After all of the events have taken place, the movie is about to start, and a final decision must be made on where to sit - and Brian will handle that. He concludes that seats that are \"far\" are clearly superior (as they offer a broader view of the screen), and he knows that the point of going to the movies is to have an optimal viewing experience, so selecting two adjacent seats is certainly not mandatory. As such, he'd like to determine the minimum total inconvenience for any two \"far\", unoccupied seats in the theatre. Note that, if one of the chosen seats is in the other's field of vision, this does not count towards its inconvenience - it's only determined by other people sitting in the theatre.InputFirst line: 2 integers, $L$ and $T$Next $T$ lines: 1 character, $E_i$, and 2 integers, $R_i$ and $C_i$, for $i = 1..T$Output1 line for each of Anatevka's suggestions: If the suggestion is invalid, the string \"No\" - otherwise, the total inconvenience of the two suggested seatsFinal line: The minimum total inconvenience of any pair of \"far\", unoccupied seatsExampleInput:3 7E 1 2E 2 5S 3 3E 2 3L 2 5S 1 3S 2 2Output:30No0Explanation of SampleWhen Anatevka makes her first suggestion, the front 3 rows and leftmost 5 columns of the theatre look as follows (where a \"P\" represents a person, and an \"S\" represents one of the suggested seats):The person sitting in seat ($1$, $2$) is in the field of vision of both suggested seats, while the person sitting in seat ($2$, $5$) is only in the way of the right one. As such, the total inconvenience of the two seats is $1+2=3$.The second suggestion is shown below:These two seats aren't obstructed by any people, so their total inconvenience is $0$. The final suggestion is invalid, as one of its two seats (seat ($2$, $3$)) is already occupied.Finally, Brian can easily select two \"far\" which each have inconvenience $0$, as the theatre has $10^9-3$ \"far\" rows with $1000$ seats each, and most are far from the two people setting in the theatre after the last event. For example, he might choose to take seat ($4$, $6$), while recommending that Anatevka enjoy the view from seat ($100$, $1000$).",
  "sample_input": "Input:3 7E 1 2E 2 5S 3 3E 2 3L 2 5S 1 3S 2 2Output:30No0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RMOVIE",
  "scraped_at": "2025-08-17 00:34:00"
}