{
  "problem_code": "problems",
  "title": "Elegant Diamond",
  "tags": [],
  "text": "ProblemThe king has hired you to make him an elegant diamond. An elegant diamond is a two-dimensional object made out of digits that's symmetric about a horizontal and a vertical axis. For example, the following four shapes are elegant diamonds:2       8      3     7\r\n  3 3     8 8    2 2\r\n 4 1 4     8      3\r\n  3 3\r\n   2These three shapes are diamonds, but are not elegant:2       1        3\r\n 1 1     1 2      1 1\r\n  1     1 1 1    3 1 3\r\n         2 1      1 1\r\n          1        2These three shapes are not diamonds:1     2     8   8\r\n 1 1   222      0\r\n        2     00000The king will start by giving you a diamond, which may not be elegant. Your job is to make it elegant byenhancingit, adding digits on to make a bigger diamond. Because you don't want to spend too much money, you want to do it with as littlecostas possible.DefinitionsAdiamond of sizekis 2k-1 lines of digits, 0-9, separated by single spaces, organized in the following way:Line i (1 ≤ i ≤ k) contains k-i spaces, then i digits separated by single spaces.Line i (k < i < 2k) contains i-k spaces, then 2k-i digits separated by single spaces.Anelegant diamond of sizekis a diamond of size k with the following two symmetry properties:Horizontal symmetry: Let cibe the number of digits on line i. The jthdigit on line i (where j=1 for the first digit) must be the same as the ci+1-jthdigit.Vertical symmetry: The jthdigit on line i (where i=1 for the first line) must be the same as the jthdigit on line 2k-i.A diamond of size k can beenhancedby adding digits to it. The result of enhancing a diamond of size k has the following properties:The result is a diamond of size ≥ k.The original diamond is part of the result. In other words, there exist some X and some Y such that, for all values of i and j such that the jthcharacter of the ithline of the original is a digit (as opposed to a space), the j+Xthcharacter on the i+Ythline of the result is also a digit and it's the same as the jthcharacter on the ithline of the original.Thecostof enhancing a diamond is equal to the number of digits in the result of the enhancement, minus the number of digits in the original diamond.InputThe first line of the input gives the number of test cases,T.Ttest cases follow. Each test case consists of a single integerkin a line on its own, followed by a diamond of sizek.OutputFor each test case, output one line containing \"Case #x: y\", where x is the case number (starting from 1) and y is the minimum cost required to enhance the given diamond into an elegant diamond. If the diamond is already elegant, y=0.Limits1 ≤T≤ 100.1 ≤k≤ 51.SampleInput4\r\n1\r\n0\r\n2\r\n 1\r\n2 2\r\n 1\r\n2\r\n 1\r\n1 2\r\n 1\r\n3\r\n  1\r\n 6 3\r\n9 5 5\r\n 6 3\r\n  1OutputCase #1: 0\r\nCase #2: 0\r\nCase #3: 5\r\nCase #4: 7ExplanationThere are four cases. The first two cases start as elegant diamonds of size 1 and 2, respectively, and don't need to be enhanced; so the cost is 0. The third case can be enhanced to look like:3\r\n 1 1\r\n1 2 1\r\n 1 1\r\n  3There are several possible enhancements, but this is one with the lowest possible cost, which is 5.  n the fourth case we can enhance the diamond into the following elegant diamond for a cost of 7:9\r\n  1 1\r\n 6 3 6\r\n9 5 5 9\r\n 6 3 6\r\n  1 1\r\n   9",
  "sample_input": "2       8      3     7\r\n  3 3     8 8    2 2\r\n 4 1 4     8      3\r\n  3 3\r\n   2",
  "sample_output": "2       1        3\r\n 1 1     1 2      1 1\r\n  1     1 1 1    3 1 3\r\n         2 1      1 1\r\n          1        2",
  "link": "https://www.spoj.com/problems/GCJ102A",
  "scraped_at": "2025-08-17 00:33:47"
}