{
  "problem_code": "problems",
  "title": "Isabella Message",
  "tags": [],
  "text": "Isabella and Steve are very good friends, and they often write letters to each other. They exchange funny experiences, talk about people around, share their feelings and write about almost everything through the letters. When the letters are delivered, they are quite afraid that some other people (maybe their parents) would peek. So they encrypted the letter, and only they know how to decrypt it. This guarantees their privacy.The encrypted message is anN×Nmatrix, and each grid contains a character.Steve uses a special mask to work as a key. The mask isN×N(whereNis an even number) matrix with (N×N)/4 holes of size1×1on it.The decrypt process consist of the following steps:Put the mask on the encrypted message matrix.Write down the characters you can see through the holes, from top to down, then from left to right.Rotate the mask by 90 degrees clockwise.Go to step 2, unless you have wrote down all theN×Ncharacters in the message matrix.Erase all the redundant white spaces in the message.For example, you got a message shown in figure 1, and you have a mask looks like figure 2. The decryption process is shown in figure 3, and finally you may get a message\"good morning\".You can assume that the mask is always carefully chosen that each character in the encrypted message will appear exactly once during decryption.However, in the first step of decryption, there are several ways to put the mask on the message matrix, because the mask can be rotated (but not flipped). So you may get different results such as\"od morning go\"(as showed in figure 4), and you may also get other messages like\"orning good m\",\"ng good morni\".Steve didn't know which direction of the mask should be chosen at the beginning, but after he tried all possibilities, he found that the message\"good morning\"is the only one he wanted because he couldn't recognize some words in the other messages. So he will always consider the message he can understand the correct one. Whether he can understand a message depends whether he knows all the words in the message. If there are more than one ways to decrypt the message into an understandable one, he will choose the lexicographically smallest one. The way to compare two messages is to compare the words of two messages one by one, and the first pair of different words in the two messages will determine the lexicographic order of them.Isabella sends letters to Steve almost every day. As decrypting Isabella's message takes a lot of time, and Steve can wait no longer to know the content of the message, he asked you for help. Now you are given the message he received, the mask, and the list of words he already knew, can you write a program to help him decrypt it?InputThe first line contains an integerT(1 ≤T≤ 100), indicating the number of test cases.Each test case contains several lines. The first line contains an even integerN(2 ≤N≤ 50), indicating the size of the matrix.The followingNlines each contains exactlyNcharacters, representing the message matrix. The message only contains lowercase letters and periods ('.'), where periods represent the white spaces. You can assume the matrix contains at least one letter.The followingNlines each containsNcharacters, representing the mask matrix. The asterisk ('*') represents a hole, and period ('.') otherwise.\r\nThe next line contains an integerM(1 ≤M≤ 100), the number of words he knew.Then the followingMlines each contains a string represents a word. The words only contain lowercase letters, and its length will not exceed 20.OutputFor each test case in the input, print one line:\"Case #X: Y\", whereXis the test case number (starting with 1) andYis Isabella's message.If Steve cannot understand the message, just print theYas\"FAIL TO DECRYPT\".ExampleInput:3\r\n4\r\no.do\r\n.ng.\r\ngrmn\r\no.i.\r\n.*..\r\n*.*.\r\n....\r\n*...\r\n2\r\ngood\r\nmorning\r\n4\r\n..lf\r\neoyv\r\noeou\r\nvrer\r\n..*.\r\n.*..\r\n....\r\n*.*.\r\n5\r\ni\r\nyou\r\nthe\r\nlove\r\nforever\r\n4\r\n.sle\r\ns.c.\r\ne.fs\r\n..uu\r\n*...\r\n.*..\r\n...*\r\n..*.\r\n1\r\nsuccessfulOutput:Case #1: good morning\r\nCase #2: love you forever\r\nCase #3: FAIL TO DECRYPT",
  "sample_input": "Input:3\r\n4\r\no.do\r\n.ng.\r\ngrmn\r\no.i.\r\n.*..\r\n*.*.\r\n....\r\n*...\r\n2\r\ngood\r\nmorning\r\n4\r\n..lf\r\neoyv\r\noeou\r\nvrer\r\n..*.\r\n.*..\r\n....\r\n*.*.\r\n5\r\ni\r\nyou\r\nthe\r\nlove\r\nforever\r\n4\r\n.sle\r\ns.c.\r\ne.fs\r\n..uu\r\n*...\r\n.*..\r\n...*\r\n..*.\r\n1\r\nsuccessfulOutput:Case #1: good morning\r\nCase #2: love you forever\r\nCase #3: FAIL TO DECRYPT",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ISAB",
  "scraped_at": "2025-08-17 00:33:47"
}