{
  "problem_code": "problems",
  "title": "Holiday Accommodation",
  "tags": [],
  "text": "Nowadays, people have many ways to save money on accommodation when they are on vacation. One of these ways is exchanging houses with other people.Here is a group ofNpeople who want to travel around the world. They live in different cities, so they can travel to some other people's city and use someone's house temporary. Now they want to make a plan that choose a destination for each person. There are two rules should be satisfied:All the people should go to one of the other people's city.Two of them never go to the same city, because they are not willing to share a house.They want to maximize the sum of all people's travel distance. The travel distance of a person is the distance between the city he lives in and the city he travels to. TheseNcities haveN-1 highways connecting them. The travelers always choose the shortest path when traveling.Given the highways' information, it is your job to find the best plan, that maximum the total travel distance of all people.InputThe first line of input contains one integerT(1 ≤T≤ 10), indicating the number of test cases.Each test case contains several lines.\r\nThe first line contains an integerN(2 ≤N≤ 105), representing the number of cities.\r\nThen the followingN-1 lines each contains three integersX,Y,Z(1 ≤X,Y≤N, 1 ≤Z≤ 106), means that there is a highway between cityXand cityY, and length of that highway.You can assume all the cities are connected and the highways are bi-directional.OutputFor each test case in the input, print one line:\"Case #X: Y\", whereXis the test case number (starting with 1) andYrepresents the largest total travel distance of all people.ExampleInput:2\r\n4\r\n1 2 3\r\n2 3 2\r\n4 3 2\r\n6\r\n1 2 3\r\n2 3 4\r\n2 4 1\r\n4 5 8\r\n5 6 5Output:Case #1: 18\r\nCase #2: 62",
  "sample_input": "Input:2\r\n4\r\n1 2 3\r\n2 3 2\r\n4 3 2\r\n6\r\n1 2 3\r\n2 3 4\r\n2 4 1\r\n4 5 8\r\n5 6 5Output:Case #1: 18\r\nCase #2: 62",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HOLI",
  "scraped_at": "2025-08-17 00:33:45"
}