{
  "problem_code": "problems",
  "title": "Adventurous Chess Masters",
  "tags": [],
  "text": "The world of the Adventurous Chess Masters is quite different than our world, instead of having streets and buildings everything is composed of a big chess board and chess pieces. A square of a chess board is said to be covered if at least one chess piece is placed on it. The mysteries of the world can be revealed by covering special magical squares over the chess board, and you can't wait to discover them.In every turn you can update the board by moving one of the pieces on the board according to the following rules:Thekingmoves only one square in any direction.Thequeenmoves any number of squares in any direction along a row, column, or diagonal.Therookmoves any number of squares along rows or columns (forward, backward, left or right).Thebishopmoves any number of squares diagonally.Theknightmoves to a square in an \"L\"-shape (two spaces forward, backward, left, or right and one space perpendicular to it).Thepawncan only move one space forward or backward (unlike a chess game).Note that, unlike normal chess, more than one piece can occupy the same square and pieces can move through occupied squares. To reveal the secrets of the world you have to make the maximum number of magical squares covered, in the minimum number of turns.InputThe first line of input contains an integer T that represents the number of test cases, then follow T test cases. The first line of each test case contains P and L, the number of chess pieces on the board and the number of magical squares in order.  Following the first line P lines each contains two integers x and y coordinates of the location of the piece where (1 ≤ x, y ≤ 8) and the type of the chess pieces (king, queen, rook, bishop, knight, or pawn - all in lowercase letters) and the last L lines of the test case each contains a unique pair of integers x and y as the coordinates of the magical squares where (1 ≤ x, y ≤ 8). Note that: (0 ≤ P ≤ 64), and these P pieces won't be in any of the L given locations.OutputFor each test case, print on one line \"Case K: Secret reveals after moving H pieces with minimum number of moves M.\" Where K is test case number, H is the number of pieces to be moved and M is the total number of moves used. Check example below to see the format.ExampleInput:2\r\n1 1\r\n1 1 pawn\r\n8 1\r\n3 5\r\n2 8 king\r\n2 8 queen\r\n7 5 bishop\r\n1 1\r\n2 2\r\n3 6\r\n6 3\r\n4 4Output:Case 1: Secret reveals after moving 1 pieces with minimum number of moves 7.\r\nCase 2: Secret reveals after moving 3 pieces with minimum number of moves 5.",
  "sample_input": "Input:2\r\n1 1\r\n1 1 pawn\r\n8 1\r\n3 5\r\n2 8 king\r\n2 8 queen\r\n7 5 bishop\r\n1 1\r\n2 2\r\n3 6\r\n6 3\r\n4 4Output:Case 1: Secret reveals after moving 1 pieces with minimum number of moves 7.\r\nCase 2: Secret reveals after moving 3 pieces with minimum number of moves 5.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ACHESS",
  "scraped_at": "2025-08-17 00:33:48"
}