{
  "problem_code": "problems",
  "title": "Working at the Restaurant",
  "tags": [],
  "text": "Last night, Tom went on a date with a really nice girl. However, he forgot to take his credit card with him and he had no cash in his wallet, so he ended up working at the restaurant to pay for the bill. His task is to take plates from the waiter when he comes from the tables, and pass them along when the dishwasher requests them. It is very important for the plates to be washed in the same order as they are brought from the tables, as otherwise it could take too long before a plate is washed, and leftover food might get stuck. Trying to hold all the plates in his hands is probably not a great idea, so Tom puts them on a table as soon as the waiter hands them over to him, and picks them up from the table again when the time comes to pass them along to the dishwasher. There is space for only two piles of plates on the table, which will be referred to as pile 1 and pile 2. There is only one table Tom can use.Tom won last year’s SWERC, so he is certainly capable of optimizing for efficiency. You have to output a transcript of one possible way in which Tom might decide to organize the plates on the table during the process, given the sequence of plates and requests he receives.InputThe input has several test cases. Each case begins with a line containing a numberN(1 ≤N≤ 1 000), followed byNlines, which contain eitherDROP morTAKE m, wherem> 0 is the number of plates to take or drop.DROP mrepresents that the next event is the waiter bringingmplates to Tom, one by one, so he has to drop them on the table;TAKE mrepresents that the next event is Tom takingmplates from the table, one by one, and passing them along in the right order. You can assume that he never receives aTAKE minstruction when there are fewer thanmplates on the table, and that the sumMof all values ofmcorresponding toDROPoperations does not exceed 100 000. Note that there might be plates left on Tom’s table when the last request is issued, as Tom might be relieved of his duty to stay until the restaurant closes.The input ends with a line withN= 0, which must not be processed.OutputFor every test case, the output will be a series of lines describing the operations to be performed with the plates. The content of each line will be one of the following:DROP 1 m(DROP 2 m),m> 0, if Tom needs to take a plate from the waiter, drop it on top of pile 1 (pile 2), and repeat this operationmtimes in total.TAKE 1 m(TAKE 2 m),m> 0, if Tom needs to take a plate from the top of pile 1 (pile 2), pass it along to the dishwasher, and repeatmtimes in total.MOVE 1->2 m(MOVE 2->1 m),m> 0, if Tom needs to take a plate from the top of pile 1 (pile 2), drop it on top of pile 2 (pile 1), and repeatmtimes in total.You must output at most 6Nlines, and the total number of movements of plates in your transcript (that is, the sum of them’s printed in your output, for all three kinds of operations), must be at most 6M, as otherwise Tom won’t be able to cope with all the work.Note that Tom must obey the commands in the same order as they are issued. This means that, if he receives a TAKEmcommand, he must perform a certain number of MOVE and TAKE operations such that the sum of the numbers of platestakenadds up exactly tombefore performing the operations corresponding to the next command; and if he receives aDROP mcommand, he must perform a number of DROP or MOVE operations for which the sum of the numbers of platesdroppedadds up exactly tombefore performing the operations corresponding to the next command.Of course, it is also forbidden to take plates from the waiter or pass them along to the dishwasher in the absence of the corresponding order.Theremustbe an empty line between the outputs of different cases.Any solution satisfying these conditions will be accepted.SampleInput:3\r\nDROP 100\r\nTAKE 50\r\nTAKE 20\r\n3\r\nDROP 3\r\nDROP 5\r\nTAKE 8\r\n0Output:DROP 2 100\r\nMOVE 2->1 100\r\nTAKE 1 50\r\nTAKE 1 20\r\n\r\nDROP 2 3\r\nDROP 2 5\r\nMOVE 2->1 8\r\nTAKE 1 8Problemsetter: Abel Molina Prieto",
  "sample_input": "Input:3\r\nDROP 100\r\nTAKE 50\r\nTAKE 20\r\n3\r\nDROP 3\r\nDROP 5\r\nTAKE 8\r\n0Output:DROP 2 100\r\nMOVE 2->1 100\r\nTAKE 1 50\r\nTAKE 1 20\r\n\r\nDROP 2 3\r\nDROP 2 5\r\nMOVE 2->1 8\r\nTAKE 1 8",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RESTAURN",
  "scraped_at": "2025-08-17 00:33:45"
}