{
  "problem_code": "problems",
  "title": "Happy Telephones",
  "tags": [],
  "text": "In the land of Eden, all phone conversations are happy ones. People complaining on the phone are immediately put in jail. To enforce this law, the police taps all phone conversations.The police wants to hire the appropriate number of operators to listen to all conversations in a given period of time. Unfortunately, each of their operators can listen to one conversation only before needing a really long break to rest from the effort.As a contractor of the police department, you have been asked to provide a program capable of determining the required number of operators. If the program does not work correctly, you will be put in jail as well, along with all the unhappy complainers. Do you really want to end up there?InputEach test case starts with two integers denoting the number of phone callsN(1 ≤N< 10 000) and the number of intervalsM(1 ≤M< 100). This is followed byNlines describing the telephone calls, each one consisting of four integersSource,Destination,StartandDuration.SourceandDestinationidentify the pair of telephone numbers establishing the connection (0 ≤Source,Destination≤ 10 000 000).StartandDurationare the start time and duration of the call in seconds (1 ≤Duration≤ 10 000 andStart≥ 0). You can safely assume that the sum ofStartandDurationfits into a 32-bit signed integer.Afterwards followMlines containing the time intervals the police are interested in, each described by two integersStartandDuration, in the same format and with the same meaning and constraints as those in the telephone calls. The last test case is represented byN=M= 0 and must not be processed.OutputFor each of theMintervals of each test case, print the number of calls that are active during at least one second of the interval.ExampleInput:3 2\r\n3 4 2 5\r\n1 2 0 10\r\n6 5 5 8\r\n0 6\r\n8 2\r\n1 2\r\n8 9 0 10\r\n9 1\r\n10 1\r\n0 0Output:3\r\n2\r\n1\r\n0Problem setter: Manuel Freire",
  "sample_input": "Input:3 2\r\n3 4 2 5\r\n1 2 0 10\r\n6 5 5 8\r\n0 6\r\n8 2\r\n1 2\r\n8 9 0 10\r\n9 1\r\n10 1\r\n0 0Output:3\r\n2\r\n1\r\n0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HAPPYTL",
  "scraped_at": "2025-08-17 00:34:05"
}