{
  "problem_code": "problems",
  "title": "Fake Scoreboard",
  "tags": [],
  "text": "As you know, after the award ceremony of SWERC it is customary to publish a complete scoreboard with detailed information on the submissions and verdicts received. However, due to the buggy contest management system, most of the relevant data are not being recorded today. Clearly such state of affairs fails to meet the high standards we are committed to, so the judges have resolved to make up the rest of the data based on whatever shred of information left, and hope contestants are unable to tell the difference. To make our lives even simpler, we kindly ask you to provide a solution for us, or else today’s scoreboard will remain forever veiled in mystery (even the fake one).What we will know by the end of the contest is the numberTof teams, the numberPof problems, and the number of accepted submissions by each team. From the number and colour of balloons floating around on the premises we will also be able to infer how many teams solved each of the problems. Your task is to figure out which teams solved which problems.Our counting skills are not up to par, so your program should be able to detect when the data we collected must be wrong (see sample input 1). Otherwise you should output a possible solution, represented as a sequence ofTstrings ofPcharacters each, in the following way. Both problems and teams are assigned with distinct integers, from 1 toPand 1 toT, respectively. For team numberi(1 ≤i≤T), write the string on alphabetN, Ysuch that itsj-th (1 ≤j≤P) character isYif the team managed to get problemjaccepted, andNotherwise. For example, the following three strings form a solution to the second sample case, where the score of each of three teams is 2, 1, 2, and the count of accepted submissions for each of three problems is 1, 2, 2:NYYNNYYYNThere is at least one other solution, namely:NYYNYNYNYWhen several solutions are possible we ask you to supply the one giving rise to the lexicographically smallest string, when each of theTrows are concatenated in order. In the example above we prefer the first solution, sinceNYYNNYYYNcomes beforeNYYNYNYNYin lexicographical order. (StringScomes beforeS′ in lexicographical order if the first different character between the two isNinSbutYinS').InputEach input case is described by three lines:The first contains two space-separated integersT(the number of teams) andP(the number of problems), with 1 ≤T,P≤ 80. The second containsTspace-separated integers between 0 and 90 (inclusive), thei-th of which indicates the number of problems solved by teami. The third (and last) line hasPintegers between 0 and 90, thej-th of which describes the number of teams successfully solving problemj.Different input cases are separated by a blank line. The last line of the input file will be0 0.OutputIf the input data has a solution, printTlines ofPcharacters each, depicting the lexicographically smallest solution as explained above. Otherwise output a single line with the wordImpossible. In any case a blank line should separate outputs for different test cases.ExampleInput:2 2\r\n1 2\r\n1 1\r\n\r\n3 3\r\n2 1 2\r\n1 2 2\r\n\r\n3 5\r\n3 3 1\r\n3 1 1 0 2\r\n\r\n0 0Output:Impossible\r\n\r\nNYY\r\nNNY\r\nYYN\r\n\r\nYNYNY\r\nYYNNY\r\nYNNNNProblem setter: David García Soriano",
  "sample_input": "Input:2 2\r\n1 2\r\n1 1\r\n\r\n3 3\r\n2 1 2\r\n1 2 2\r\n\r\n3 5\r\n3 3 1\r\n3 1 1 0 2\r\n\r\n0 0Output:Impossible\r\n\r\nNYY\r\nNNY\r\nYYN\r\n\r\nYNYNY\r\nYYNNY\r\nYNNNN",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/FAKESCOR",
  "scraped_at": "2025-08-17 00:33:52"
}