{
  "problem_code": "problems",
  "title": "Comparing Answers",
  "tags": [],
  "text": "In a place in Southwestern Europe, the name of which I do not wish to recall, not long ago there werencities connected by unidirectional roads, with possibly more than one road connecting a city to another one, or even to itself. As a homework assignment for your geography class, you need to calculate the number of paths of length exactly two that were between each pair of cities. However, you’ve been too busy celebrating the Spanish victory in the World Cup, so now you are copying the answers from your friend. You would like to make sure his answers are correct before handing in your homework.InputThe input consists of several test cases, separated by single blank lines. Each test case begins with a line containing the integern(1 ≤n≤ 700). The followingnlines containnelements each, with elementjof lineibeing the number of roads from cityito cityj(a number between 0 and 10, inclusive). After that, there will benlines. Each will containnelements, with elementjof lineibeing the answer from your friend for the number of length-2 paths from cityito cityj; it will be an integer between 0 and 100 000 inclusive.The test cases will finish with a line containing only the number zero (also preceded by a blank line).Note:Large input file; use fast I/O routines (e.g. scanf in C++ or BufferedReader in Java).OutputFor each case, your program should output a line. The content of this line should beYESif your classmate’s solution to the assignment is right, andNOotherwise.ExampleInput:3\r\n2 0 1\r\n1 0 3\r\n1 1 0\r\n5 1 2\r\n5 3 1\r\n3 0 4\r\n\r\n3\r\n2 0 1\r\n1 0 3\r\n1 1 0\r\n5 1 2\r\n5 3 2\r\n3 0 4\r\n\r\n0Output:YES\r\nNOProblem setter: Abel Molina Prieto",
  "sample_input": "Input:3\r\n2 0 1\r\n1 0 3\r\n1 1 0\r\n5 1 2\r\n5 3 1\r\n3 0 4\r\n\r\n3\r\n2 0 1\r\n1 0 3\r\n1 1 0\r\n5 1 2\r\n5 3 2\r\n3 0 4\r\n\r\n0Output:YES\r\nNO",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CMPANS",
  "scraped_at": "2025-08-17 00:33:50"
}