{
  "problem_code": "problems",
  "title": "Peer Review",
  "tags": [],
  "text": "For scientific conferences, scientists submit papers presenting their ideas, and  then review each other’s papers to make sure only good papers are presented at the conference.  Each paper must be reviewed by at least one scientist, and scientists must not review papers written by people they collaborate with (including themselves), or review  the same paper more than once.You have been asked to write a program to check if your favorite conference is doing things right. Whether a paper is being reviewed too much, too little, or by the wrong people - the organizers must know before it is too late!InputThe first line in each test case has two integers,K(1 ≤K≤ 5) andN(1 ≤N≤ 1000).Kis the number of reviews that  each paper will receive, whileNis the number of papers to be reviewed. The conference only accepts papers with a single author, and authors can only  present a single paper at the conference.Each of the nextNlines describes an author and includes the name of the institution to which  the author belongs, followed by the list of theKpapers he or she has been requested to review.  It is assumed that researchers from the same institution collaborate with each other,  whereas researchers from different institutions don’t. All institution names are shorter than 10 characters, and contain only upper  or lowercase letters and no whitespace. Since we have as many papers as authors, papers are identified by their author’s index; paper 1 was written by the first author in the list, and paperNwas written by the last author.The end of the test cases is marked with a line containingK=0 andN=0. You  should generate no output for this line.OutputFor each test case, your program should outputNO PROBLEMS FOUND(if all rules are being followed) orPPROBLEMS FOUND, wherePis  the number of rule violations found (counting at most 1 violation per paper).  If there is exactly one rule violation overall, your program should output1 PROBLEM FOUND.Sample Input2 3\r\nUCM 2 3\r\nUAM 1 3\r\nUPM 1 2\r\n2 3\r\nUCM 2 3\r\nUAM 1 2\r\nUPM 2 2\r\n0 0Sample OutputNO PROBLEMS FOUND\r\n3 PROBLEMS FOUNDProblemsetter: Manuel Freire",
  "sample_input": "2 3\r\nUCM 2 3\r\nUAM 1 3\r\nUPM 1 2\r\n2 3\r\nUCM 2 3\r\nUAM 1 2\r\nUPM 2 2\r\n0 0",
  "sample_output": "NO PROBLEMS FOUND\r\n3 PROBLEMS FOUND",
  "link": "https://www.spoj.com/problems/REVIEW",
  "scraped_at": "2025-08-17 00:33:44"
}