{
  "problem_code": "problems",
  "title": "Treasures and Vikings",
  "tags": [],
  "text": "You have a treasure map that is arranged into a N × M grid. A grid square may be either sea or part of\r\nan island. In addition, the map shows the treasure and an enemy Viking ship that occupies one (sea)\r\nsquare. Finally, for convenience you have also drawn your own position.Now you must set up a fixed route to get the treasure. The route must start at your position, end at\r\nthe treasure, and consist of a sequence of moves. In each move, you can go only to an (horizontally\r\nor vertically) adjacent square that is not part of an island. But beware: The Viking ship might follow\r\nyou, using the same kind of moves! After each of your moves according to your route, the Viking\r\nship may move or not. Your move and the Vikings’ reaction together is called a round.After every round, the following checks are made:If you are in line with the Viking ship (you are in the same vertical or horizontal line as the Viking\r\nship with only sea between the Viking ship and you), you are dead.If you aren’t dead and at the treasure-spot, you get the treasure.Write a program that decides whether it is possible to set up a fixed route in advance such that you\r\ncan get the treasure by following this route and will not get killed by the Vikings – no matter how the\r\nViking ship moves.InputThe first line of input contains two integers N and M (1 ≤ N, M ≤ 700), the dimensions of the map. Each of the\r\nfollowing N lines contain M characters. Each character describes a square in the map, and is either . (sea),\r\nI (part of an island), V (the Viking ship), Y (your position), or T (the treasure). Each of V, Y,\r\nand T will occur exactly once.OutputThe only line of the output must contain the string YES, if it is possible to set up a route to get the\r\ntreasure, or NO otherwise.ExampleInput:5 7\r\nY.....V\r\n..I....\r\n..IIIII\r\n.......\r\n...T...Output:YES",
  "sample_input": "Input:5 7\r\nY.....V\r\n..I....\r\n..IIIII\r\n.......\r\n...T...Output:YES",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TANDV",
  "scraped_at": "2025-08-17 00:33:49"
}