{
  "problem_code": "problems",
  "title": "Generations",
  "tags": [],
  "text": "Harry's friend Charlie Weasley has partnered with an old-time breeder of dragons in Romania. When Harry visited Charlie over the summer, Charlie showed him breeding records stretching back centuries. It had started out with just one female dragon named Abraxia that had then reproduced to give many generations of dragons. The breeding record showed a family tree of dragons, starting with Abraxia and showing each descendant1(only females' descendants were shown), the year each was hatched from its egg and the year each died. Only already dead dragons were included. Charlie pointed out that a dragon matured early, and once hatched, could herself lay and hatch an egg in the very year it was born. Dragon eggs did not need a mother's care to hatch -- the breeders simply used the warmth of a blowtorch to keep the egg warm and hatch it, sometimes long after the mother dragon was dead.Harry noticed that sometimes many generations of dragons were alive at the same time. He was curious to figure out, for each dragon when it was alive, what was the maximum generational difference (absolute value) between it and its coeval2descendants. Can you help him? Assume that if a dragon dies the year another is hatched, they were coeval.1A descendant is a child, grandchild, great-grandchild etc.2coeval: Alive at the same time.InputThe first line contains the number of test cases T.The first line of each test case starts with an integer N - the number of dragons.It is followed by N lines. The ith line (0 indexed) contains 3 integers, pi, hatchyeariand deathyeari. piis the parent of ith dragon and its interval is hatchyearito deathyeari. The dragon with index 0 is Abraxia, and a mother's index is smaller than all its descendants'.OutputOutput T lines.Each line contains a space-separated list of N integers, the ith of them denoting the required answer for the ith dragon. If the ith dragon's life does not overlap with any descendant's, output 0 for that dragon.Constraints1 ≤ T ≤ 31 ≤ N ≤ 700000 ≤ hatchyear ≤ deathyear ≤ 109p0= -1For all i > 0, 0 ≤ pi< ihatchyear of dragon ≥ hatchyear of its motherExampleInput:2\r\n5\r\n-1 0 10\r\n0 1 5\r\n0 2 8\r\n0 2 5\r\n3 10 12\r\n9\r\n-1 0 10\r\n0 1 1\r\n0 2 2\r\n1 2 3\r\n1 3 4\r\n2 2 3\r\n2 2 4\r\n6 10 11\r\n6 20 30Output:2 0 0 0 0\r\n3 0 1 0 0 0 0 0 0",
  "sample_input": "Input:2\r\n5\r\n-1 0 10\r\n0 1 5\r\n0 2 8\r\n0 2 5\r\n3 10 12\r\n9\r\n-1 0 10\r\n0 1 1\r\n0 2 2\r\n1 2 3\r\n1 3 4\r\n2 2 3\r\n2 2 4\r\n6 10 11\r\n6 20 30Output:2 0 0 0 0\r\n3 0 1 0 0 0 0 0 0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/AMR11I",
  "scraped_at": "2025-08-17 00:33:57"
}