{
  "problem_code": "problems",
  "title": "Goblin Wars",
  "tags": [],
  "text": "The wizards and witches of Hogwarts School of Witchcraft found Prof. Binn's History of Magic lesson to be no less boring than you found your own history classes. Recently Binns has been droning on about Goblin wars, and which goblin civilization fought which group of centaurs where etc etc. The students of Hogwarts decided to use the new-fangled computer to figure out the outcome of all these wars instead of memorizing the results for their upcoming exams. Can you help them?The magical world looks like a 2-D R×C grid. Initially there are many civilizations, each civilization occupying exactly one cell. A civilization is denoted by a lowercase letter in the grid. There are also certain cells that are uninhabitable (swamps, mountains, sinkholes etc.) - these cells are denoted by a '#' in the grid. All the other cells - to which the civilizations can move - are represented by a '.' in the grid.A cell is said to be adjacent to another cell if they share the same edge - in other words, for a cell (x, y), cells (x-1, y), (x, y-1), (x+1, y), (x, y+1) are adjacent, provided they are within the boundaries of the grid. Every year each civilization will expand to all unoccupied adjacent cells. If it is already inhabited by some other civilization, it just leaves the cell alone. It is possible that two or more civilizations may move into an unoccupied cell at the same time - this will lead to a battle between the civilizations and the cell will be marked with a '*'. Note that the civilizations fighting in a particular cell do not try to expand from that cell, but will continue to expand from other cells, if possible.Given the initial grid, output the final state of the grid after no further expansion by any civilization is possible.InputThe first line contains T, the number of cases. This is followed by T test case blocks.Each test case contains two integers, R, C.This is followed by R lines containing a string of length C. The j-th letter in the i-th row describes the state of the cell in year 0.Each cell is either a:'.' which represents an unoccupied cell.'#' which represents a cell that cannot be occupied.A civilization represented by a lowercase letter ('a' - 'z').OutputFor each test case, print the final grid after no expansion is possible. Apart from the notations used in the input, use '*' to denote that a battle is being waged in that particular cell.Print a blank line at the end of each case.Constraints1 ≤ R, C ≤ 5001 ≤ T ≤ 5SampleInput:5\r\n3 5\r\n#####\r\na...b\r\n#####\r\n3 4\r\n####\r\na..b\r\n####\r\n3 3\r\n#c#\r\na.b\r\n#d#\r\n3 3\r\n#c#\r\n...\r\na.b\r\n3 5\r\n.....\r\n.#.#.\r\na...bOutput:#####\r\naa*bb\r\n#####\r\n\r\n####\r\naabb\r\n####\r\n\r\n#c#\r\na*b\r\n#d#\r\n\r\n#c#\r\nacb\r\na*b\r\n\r\naa*bb\r\na#.#b\r\naa*bb",
  "sample_input": "Input:5\r\n3 5\r\n#####\r\na...b\r\n#####\r\n3 4\r\n####\r\na..b\r\n####\r\n3 3\r\n#c#\r\na.b\r\n#d#\r\n3 3\r\n#c#\r\n...\r\na.b\r\n3 5\r\n.....\r\n.#.#.\r\na...bOutput:#####\r\naa*bb\r\n#####\r\n\r\n####\r\naabb\r\n####\r\n\r\n#c#\r\na*b\r\n#d#\r\n\r\n#c#\r\nacb\r\na*b\r\n\r\naa*bb\r\na#.#b\r\naa*bb",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/AMR11J",
  "scraped_at": "2025-08-17 00:33:59"
}