{
  "problem_code": "problems",
  "title": "DOTA HEROES",
  "tags": [],
  "text": "Defence Of The Ancients (DOTA) is one of the most addictive online multiplayer games. There are n heroes in our team and our motto is to conquer the opponent’s empire. To safeguard their empire, the opponents had constructed m towers on the path. If one or more heroes get into the sight of a tower, then the tower does D amount of damage to one of those heroes at that instant (i.e. one of the heroes’ health decreases by D). Any hero will die if his health H ≤ 0. Once a tower attacks one of the heroes, all the heroes in the sight of that tower at that instant get out of its sight. Find whether all of the heroes in our team can reach the opponent’s empire alive.InputThe first line consists of one integer t representing the number of test cases. For each test case, the first line consists of three integers n, m and D, the number of heroes, number of towers and the amount of Damage respectively. The next n lines consist of an integer representing the health of respective hero.OutputJust a word “YES” if we can reach the opponent’s empire alive, else “NO”.Constraints1 ≤ t ≤ 5001 ≤ n ≤ 5001 ≤ m ≤ n1 ≤ D, H ≤ 20000ExampleInput:3\r\n6 3 400\r\n500\r\n500\r\n500\r\n500\r\n500\r\n500\r\n6 5 400\r\n800\r\n800\r\n801\r\n200\r\n200\r\n200\r\n6 3 400\r\n401\r\n401\r\n400\r\n200\r\n400\r\n200Output:YES\r\nNO\r\nNOExplanation of Test Case 1One of the possible solutions is: First, three of the heroes can goes together. One of them receives 400 damage from the first tower and all of them cross it. Then while crossing the next tower, one of the heroes who is at 500 health gets 400 damage and all of them cross it. Then the third hero receives the damage when crossing the last tower. Similarly the other 3 heroes can reach the opponent’s base together without dying.",
  "sample_input": "Input:3\r\n6 3 400\r\n500\r\n500\r\n500\r\n500\r\n500\r\n500\r\n6 5 400\r\n800\r\n800\r\n801\r\n200\r\n200\r\n200\r\n6 3 400\r\n401\r\n401\r\n400\r\n200\r\n400\r\n200Output:YES\r\nNO\r\nNO",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DOTAA",
  "scraped_at": "2025-08-17 00:33:56"
}