{
  "problem_code": "problems",
  "title": "To Poland",
  "tags": [],
  "text": "Little Russell and Mr. Fredricksen are embarking in a new journey  with their balloon house. After visiting South America and helping  Kevin, the Snipe, they decided to travel to Warsaw, Poland where new  specimens of birds might be found.Their trip is divided into  several parts. Due to pressure levels and wind speed, each part of their  journey requires that their house is equipped with a minimum number of  balloons. As a good boy scout, Russell has already figured out how many  balloons are necessary to go through each of the parts. The problem is  that atmosphere conditions change and Russel is having trouble  determining how many balloons the house should be equipped with to go  through continuous parts of the journey, so they don't have to fill up  more balloons than necessary.To help out Russell, you are to develop a program that must deal with the following queries:Russell has added or removed balloons from the houseThe minimum number of balloons at certain part has changedHow  many balloons should be added or removed so that the house goes through  continuous parts of the journey with the minimum necessary number of  balloons?InputThe first line contains a numberT(T≤ 100), the number of testcases.Each testcase starts with numbersN(1 ≤ N ≤ 105) andM(0 ≤ M ≤ 103) whereNis the number of parts in the journey andMis the initial number of balloons in the house. ThenNnumbers follow, one per line, where each numberNi(0 ≤Ni≤ 109, 0 ≤i<N) represents the initial number of balloons necessary to go through parti.On the next line there is a numberQ(1 ≤ Q ≤ 105), the number of queries that you should answer. Each of the nextQlines contains a query in one of the following formats:\"A K\" -  whereAis the actual character 'A' (quotes for clarity) andK(-103≤K≤ 103)  is the number of balloons that have been added or removed from the  house.  It is assured that the total number of balloons in the house is  never negative;\"BJK\" - whereBis the actual character 'B' (quotes for clarity),J(0 ≤J<N) is the number of the part of the journey (0-indexed) andK(0 ≤K≤ 109) is the new minimum number of balloons required to go through partJ;\"C I J\"- whereCis the actual character 'C' (quotes for clarity), and[I, J], 0 ≤I≤J< N$ is the range that Russell would like to query. For each query of this type, print the difference between the number of balloons currently in the house and theminimumnecessary to go through all the parts betweenIandJinclusive. Note that this query doesn't change the number of balloons in the house.OutputFor each testcase print one line with \"Testcase X:\" (quotes for clarity) whereXis the number of the testcase (0-indexed). For each query of the type \"C I J\"  print one line with the difference between the number of balloons  currently in the house and the minimum necessary to go through all the  parts betweenIandJinclusive.Print one blank line after each testcase.ExampleInput:23 115 2 41C 0 23 1116 2 175C 0 2A -2C 1 2B 0 0C 0 1Output:Testcase 0:6Testcase 1:687",
  "sample_input": "Input:23 115 2 41C 0 23 1116 2 175C 0 2A -2C 1 2B 0 0C 0 1Output:Testcase 0:6Testcase 1:687",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TOPOLAND",
  "scraped_at": "2025-08-17 00:34:05"
}