{
  "problem_code": "problems",
  "title": "Tom and Jerry",
  "tags": [],
  "text": "Tom and Jerry is a favourite cartoon of many of us. One day Manku was sitting watching an episode of Tom and Jerry where he found that Tom and Jerry both entered a rectangular maze and Tom was after Jerry, but Jerry being the hero, returned safely.Manku then start making different scenarios and wondering that if Jerry moves optimally and Tom knows entire path that Jerry is expected to take, then will Jerry be able to escape out of the maze or not?Moreover Manku added 1 rule to this that if Jerry moves from position A to position B, then at any cost he is not allowed to return from position B to position A.Jerry, if is at the escape positions of the maze, in the beginning, then he can't exit from that same position.Moreover he can't escape if he is caught by Tom at any position.Jerry and Tom can move up, down, left, right or wait at their current position.If it is guaranteed that either Jerry would escape or Tom would catch him.All characters at row = 0 or row = m-1 or column = 0 or column = n-1, which are '.' or 'J' or 'T' are escape positions.InputEach input file consist of only 1 test case.First line of input contains 2 numbers m and n, both integers are less than or equal to 100, the size of the rectangular maze.Then m lines follows containing n characters each:. means an open space so that Tom or Jerry can move there.# means a closed place.T means starting position of Tom.J means starting position of Jerry.OutputOutput single line containing a character W and integer D, where W is 'J' if Jerry can escape or else 'T' and D is the minimum time taken by Jerry to escape (if W is 'J') or maximum time for which Jerry is alive (if W is 'T')ExampleInput 1:4 4\r\n#..J\r\n#...\r\n#.T.\r\n####Output 1:J 1Input 2:6 3\r\n###\r\n#J#\r\n#.T\r\n###\r\n###\r\n#.#Output 2:T 2Input 3:7 7\r\n......#\r\n.......\r\n.......\r\n...J...\r\n...T...\r\n.......\r\n#......Output 3:J 3Input 4:7 7\r\n#.....#\r\n#......\r\n#......\r\nJ......\r\n#..T...\r\n#......\r\n#......Output 4:J 4ExplanationIn the first test case Jerry will move 1 step to his left and would escape.In the second test case Jerry can't escape so he will remain at his position and will be caught after 2 moves.In the third test case Jerry will move 3 steps to his left and will escape.In the fourth test case Jerry will move 1 step to his right and then 3 steps up to escape.",
  "sample_input": "Input 1:4 4\r\n#..J\r\n#...\r\n#.T.\r\n####Output 1:J 1",
  "sample_output": "Input 2:6 3\r\n###\r\n#J#\r\n#.T\r\n###\r\n###\r\n#.#Output 2:T 2",
  "link": "https://www.spoj.com/problems/MAY99_1",
  "scraped_at": "2025-08-17 00:33:47"
}