{
  "problem_code": "problems",
  "title": "Card Game",
  "tags": [],
  "text": "John is playing a game with his friends. The game's rules are as follows: There is deck ofNcards from which each person is dealt a hand ofKcards. Each card has an integer value representing its strength. A hand's strength is determined by the value of the highest card in the hand. The person with the strongest hand wins the round. Bets are placed before each player reveals the strength of their hand.John needs your help to decide when to bet. He decides he wants to bet when the strength of his hand is higher than the average hand strength. Hence John wants to calculate the average strength of ALL possible sets of hands. John is very good at division, but he needs your help in calculating the sum of the strengths of all possible hands.ProblemYou are given an arrayawithN ≤ 10 000different integer numbers and a number,K, where1 ≤ K ≤ N. For all possible subsets ofaof sizeKfind the sum of their maximal elements modulo1 000 000 007.InputThe first line contains the number of test casesT, where1 ≤ T ≤ 25Each case begins with a line containing integersNandK. The next line containsNspace-separated numbers0 ≤ a [i] ≤ 2 000 000 000, which describe the arraya.OutputFor test casei, numbered from1toT, output \"Case #i: \", followed by a single integer, the sum of maximal elements for all subsets of sizeKmodulo 1 000 000 007.SampleInput:5\r\n4 3\r\n3 6 2 8\r\n5 2\r\n10 20 30 40 50\r\n6 4\r\n0 1 2 3 5 8\r\n2 2\r\n1069 1122\r\n10 5\r\n10386 10257 10432 10087 10381 10035 10167 10206 10347 10088Output:Case #1: 30\r\nCase #2: 400\r\nCase #3: 103\r\nCase #4: 1122\r\nCase #5: 2621483",
  "sample_input": "Input:5\r\n4 3\r\n3 6 2 8\r\n5 2\r\n10 20 30 40 50\r\n6 4\r\n0 1 2 3 5 8\r\n2 2\r\n1069 1122\r\n10 5\r\n10386 10257 10432 10087 10381 10035 10167 10206 10347 10088Output:Case #1: 30\r\nCase #2: 400\r\nCase #3: 103\r\nCase #4: 1122\r\nCase #5: 2621483",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HC12",
  "scraped_at": "2025-08-17 00:33:52"
}