{
  "problem_code": "problems",
  "title": "SHAHBAG",
  "tags": [],
  "text": "They say \"History repeats itself\" and this is what happening in Bangladesh on Feb 2013.  Mass people fought the war in 1971 and now they are rising again to fight war criminals who betrayed the country. In \"Shahbag\" you can hear the voice of people wanting justice.If you go to Shahbag you can see many human chains. For this problem we imagine a straight line going through middle of Shahbag. Each position of the line is marked from 1 to 20000.People are forming human chains along the line. Initially every position is empty. When someone stands in ithposition he holds hand of people who are standing in his left and right(if there any) and join there group. If there are no people beside him, he forms a new group.When a new people come your job is to mark his position and count currently how many groups are there in Shahbag.For example suppose:a man came first and stood in position 2. Currently there are only 1 group.then another man stood in position 4. Currently there are 2 groups.another man stood in position 3. Now there are only 1 group.And yes, people won't leave until they get justice, so no need to worry about that. miInputThere will be a single case. First line will contain an integer Q which denotes number of people. Next line will contain Q (1 ≤ Q ≤ 20000) integers piwhich denotes position of i-th people that joined the chain. Each piwill be distinct and at most 20000.OutputFor each pi print number of groups currently in Shahbag. In last line print the string \"Justice\" with a newline. Do not print any extra spaces.ExampleInput:6\r\n2 4 3 6 7 5Output:1\r\n2\r\n1\r\n2\r\n2\r\n1\r\nJusticeNote:This problem is based on true event. You can find the detailshere.Alternate writer: Rashedul Hasan Rijul",
  "sample_input": "Input:6\r\n2 4 3 6 7 5Output:1\r\n2\r\n1\r\n2\r\n2\r\n1\r\nJustice",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SHAHBG",
  "scraped_at": "2025-08-17 00:34:05"
}