{
  "problem_code": "problems",
  "title": "BATMAN1",
  "tags": [],
  "text": "Lucius Fox:This conversation used to end with an unusual request.Bruce Wayne:I'm retired.Lucius Fox:Well let me show you some stuff anyway. Just for old time's sake.Eight years after Harvey Dent's death, the Dent Act allowed eradication of organized crime. BATMAN has disappeared. Wayne enterprises is unprofitable after Bruce discontinued his fusion reactor project. A masked man called Bane who was trained under Ra's al Ghul captures Gordon. Bane attacks the Gotham Stock Exchange, using Bruce's fingerprints in a transaction that bankrupts Wayne.Now that Gotham City was heading into deep deep trouble, Its time for BATMAN to return.However, since the company no longer belongs to Bruce Wayne, Mr. Wayne has very little funds to spend on buying his weapons. Mr Fox head him to the place where all weapons are stored.Now these weapons come in batches properly sealed for safety. Each of these batches will have an unbounded number of weapons of different types. To buy these weapons Wayne initially need to pay the price for opening the seal. Then each of these weapons have a cost and a power rating associated with it.  Mr Wayne needs to spend wisely on it to maximize the power rating using limited amount of money.People of Gotham, he needs your help for choosing his weapons.Lucius Fox:It has a long uninteresting name. I just took to calling it... The Bat, and yes, Mr. Wayne, it does come in black.Inputt, number of test casesintegers n m k, n: number of batches, m: number of weapons per batch, k : Money Wayne can spend on weaponsn integers giving cost of opening the ith batchn × m numbers denoting cost of jth object from ith batchn × m numbers denoting the rating of jth object from ith batchOutputThe maximum power rating Wayne could affordConstraint:1 ≤ n, m ≤ 20k ≤ 1000cost[i] ≤ 20rating[i] ≤ 100ExampleInput:1\r\n2 4 20\r\n3 4\r\n3 2 3 2\r\n3 2 3 5\r\n3 2 3 2\r\n4 5 6 5Output:40",
  "sample_input": "Input:1\r\n2 4 20\r\n3 4\r\n3 2 3 2\r\n3 2 3 5\r\n3 2 3 2\r\n4 5 6 5Output:40",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BAT1",
  "scraped_at": "2025-08-17 00:33:46"
}