{
  "problem_code": "problems",
  "title": "Dexter Rank",
  "tags": [],
  "text": "Dexter just participated in a coding contest and is now waiting for judge to give final result. He is very bored of waiting every time for result and now wants to find his expected rank based on current scoreboard and chances of failure for problems. Formally there are M problems in the contest and there are N coders in the contest. Dexter knows that coder i has submitted problem j with penalty of penalty[i][j]. Dexter knows that problem j will pass with probability prob[j] (this also applies for Dexter himself.) This is independent for each coder and problem. Now Dexter wants to know what would be his expected rank after system test.Note: Coders are ranked based on number of correct solution, then total penalty for correct solutions. If there is tie even after that, all coders with same problems and penalty are given same rank.Example: After system test if the score board is like this:Coder 1:300-1-1Score: 1Penalty: 300Coder 2:100-1200Score: 2Penalty: 300Coder 3:-1300-1Score: 1Penalty: 300Coder 4:-1-1400Score: 1Penalty: 400Ranks would be: 2 1 2 4InputThe first line of input contains a single lineT, which represents the number of test cases. For each test case first line contains two space separated integersNandM.Then NextNlines containsMintegers, jthinteger on ithis penalty[i][j] which means penalty for ithcoder on problem j, if he submitted jthproblem, otherwise it is -1.Dexter is first coder in the list.Then next line containsMspace separated integers, where ithinteger denotes probability of passing problem i in system test, if submitted.OutputPrint the expected rank of the Dexter after system test with exactly4decimal places.Constraints1 ≤ T ≤ 162 ≤ N ≤ 2561 ≤ M ≤ 121 ≤ penalty[i][j] ≤ 1000000 or penalty[i][j] = -10 ≤ prob[i] ≤ 100ExampleInput:3\r\n2 1\r\n100\r\n150\r\n50\r\n2 2\r\n-1 -1\r\n10 -1\r\n0 100\r\n3 2\r\n100 200\r\n-1 199\r\n99 -1\r\n50 50Output:1.2500\r\n1.0000\r\n1.6250ExplanationFor sample case 1, Dexter would have first rank if his solution passes or coder-2’s solution fails system test which has probability 0.75, otherwise he would have rank 2.answer = 1×0.75 + 0.25×2 = 1.2500For sample case 2, all coders would be on rank 1 with 0 problem solved and 0 penalty in all cases, so answer = 1.0000.",
  "sample_input": "Input:3\r\n2 1\r\n100\r\n150\r\n50\r\n2 2\r\n-1 -1\r\n10 -1\r\n0 100\r\n3 2\r\n100 200\r\n-1 199\r\n99 -1\r\n50 50Output:1.2500\r\n1.0000\r\n1.6250",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DEXTER",
  "scraped_at": "2025-08-17 00:34:02"
}