{
  "problem_code": "problems",
  "title": "ISRANK",
  "tags": [],
  "text": "There areNschools, with ithschool havingSistudents. There is a inter-school programming contestIPCin which all the schools participate. AsIPCis a very prestigious event, the schools conduct a test run within themselves. They assign a predicted rank for students within the school for all students, based on the rank they got in the test run. LetPijbe the predicted rank ofjthstudent ofithschool. The predicted rank will be unique within the school, i.e. formally:{ ∀i,Pij= Pik⇔ j = k }It should be noted that students of different schools may have the same predicted rank.At the end of IPC, the IPC committee has given each school the result card containing the marks of all students of that school. LetMijrepresent the actual marks obtained by thejthstudent ofithschool. IPC follows a strict rule of giving unique marks to all students taking part in IPC, i.e. formally:{ ∀i,∀j,Mij= Mpk⇔ i = p and j = k }You are to design a system, which will efficiently answer queries of the following form:L- the number of schools to be considered.A1 A2 A3 ... AL- the list of schools.P1 P2- The range of predicted ranks.K- desired rank.You are to answer - among all the students who attended the given list of schools and with predicted ranks betweenP1andP2both inclusive, the marks of the student withKthhighest marks. (The first highest marks would the the maximum marks, and second would be the next and so on)InputFirst line contains a single integerN, the number of schools.The next line containsNspace separated integersSi.The nextNlines, theithline containsSispace separated integers,jthof which is denotingPij.The nextNlines, theithline containsSispace separated integers,jthof which is denotingMij.The next line contains a single integerQ, denoting the number of queries.What follows areQsets of queries. Each query is structured as follows:First line of the query isL, the list of schools.Followed byLintegers denoting the1 basedindices of schools.Next areP1andP2, the range of ranks we are interested in.Next is the integerK.OutputFor each query on a separate line print a single integer answering the query. If answer is not possible print -1.Constraints1 ≤ N ≤ 101 ≤ Si≤ 100001 ≤ Pij≤ Si1 ≤ Mij≤ 10000000001 ≤ Q ≤ 100001 ≤ P1 ≤ P2 ≤ max(S[i])1 ≤ K ≤ sum of all S[i]ExampleInput:4\r\n1 3 4 1\r\n1\r\n1 2 3\r\n2 3 1 4\r\n1\r\n28\r\n20 11 8\r\n6 18 22 26\r\n7\r\n4\r\n1\r\n2\r\n3 3\r\n1\r\n1\r\n2\r\n3 3\r\n1\r\n3\r\n1 3 4\r\n4 4\r\n1\r\n4\r\n1 2 3 4\r\n4 4\r\n4Output:8\r\n8\r\n26\r\n-1",
  "sample_input": "Input:4\r\n1 3 4 1\r\n1\r\n1 2 3\r\n2 3 1 4\r\n1\r\n28\r\n20 11 8\r\n6 18 22 26\r\n7\r\n4\r\n1\r\n2\r\n3 3\r\n1\r\n1\r\n2\r\n3 3\r\n1\r\n3\r\n1 3 4\r\n4 4\r\n1\r\n4\r\n1 2 3 4\r\n4 4\r\n4Output:8\r\n8\r\n26\r\n-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ISRANK",
  "scraped_at": "2025-08-17 00:33:54"
}