{
  "problem_code": "problems",
  "title": "THE WITTY BOY",
  "tags": [],
  "text": "The television at the boy's home contains the channels from 1 to n inclusive. The father wanted to avoid his son to watch some channels in the Television. You are given k unique channels that are banned by the father. For example assume that the TV contains 25 channels and the father bans the channels 15, 17 and 18 and you are currently at channel 16. If you press the 'down' button in the remote, you will move to channel 14 and if you press the 'up' button in the remote, you will move to channel 19. Also if you press up button from channel 25 you will move to channel 1 and if you press down button from channel 1 you will move to channel 25. There are 13 buttons in the remote as shown in the figure.To move to a channel you can press the digits of the channel or you can use Up/Down/Previous buttons. The previous button will take you to the immediately previous channel you watched. (The previous button does not take effect until you have moved to some other channel after the first one.)The remote control responds to delays. So you can take the button presses \"1\" and \"9\" either as a way to go to channel 1 and then to channel 9, or to channel 19 directly.You are given the sequence of channels that the boy wanted to watch. Find the minimum number of remote button presses required by the boy. It's not necessary to watch the given channels consecutively, but it is necessary to watch them in the order specified. (In other words, the given sequence must be a subsequence of the optimal channel series the boy chooses to watch.)To watch the first channel in the sequence, you must press the digits of the channel.InputThe first line consists of and integer t, the number of test cases. Each test case consists of 4 lines. The first line consists of 2 integers n and k, the number of channels in the remote and the number of channels blocked. The next line consists of k unique integers - the id of the blocked channels. The next line consists of an integer m the number of channels the boy wants to watch followed by a line with m integers - the channel id's of the channels that the boy wants to watch.OutputFor each test case print the minimum number of remote button clicks required.Input Constraints:1 ≤ t ≤ 1001 ≤ n ≤ 10000 ≤ k ≤ n-11 ≤ m ≤ 1000ChannelToWatch[i] ≠ ChannelToWatch[i-1]ChannelToWatch[any] ≠ BannedChannel[any]Input:3\r\n5 0\r\n\r\n5\r\n1 2 3 4 5\r\n500 0\r\n\r\n4\r\n140 160 139 160\r\n5 2\r\n2 4\r\n5\r\n1 3 5 3 5Output:Case #1: 5\r\nCase #2: 9\r\nCase #3: 5Note:Suppose you are currently at channel 6 and press up button twice you will move to channel 8. Now if you click on previous button, you will move to channel 7 and not channel 6.Explanation of Case #2:The moves are \"1\", \"4\", \"0\", \"down\", \"1\", \"6\", \"0\", \"previous\", \"previous\"Congrats and thanks toMitch Schwartzfor solving this problem first and for helping on setting test cases for this problem.",
  "sample_input": "Input:3\r\n5 0\r\n\r\n5\r\n1 2 3 4 5\r\n500 0\r\n\r\n4\r\n140 160 139 160\r\n5 2\r\n2 4\r\n5\r\n1 3 5 3 5Output:Case #1: 5\r\nCase #2: 9\r\nCase #3: 5",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/WITTYBOY",
  "scraped_at": "2025-08-17 00:33:55"
}