{
  "problem_code": "problems",
  "title": "Roads of NITT",
  "tags": [],
  "text": "The Institute of NITT believes in frugality. So when they made the plan for interconnecting the N hostels, they decided to construct as few bidirectional roads as possible. The hostels are interconnected with roads in such a way that every pair of hostels is connected by exactly one path.Moreover, they were so frugal that they used low quality tar in making the roads. As a result, the roads start to crack and cannot be used anymore.Now Alpa has a set of queries. At the time of each query, he knows the roads that are unusable. He wants to find the number of pairs of hostels that are disconnected, i.e., the number of pairs (x, y) such that 1 ≤ x < y ≤ N and there exists no path between hostels x and y.Help him find the result for each query.ConstraintsTest cases ≤ 5.Number of hostels, N ≤ 20000.Number of queries, Q ≤ 20000.InputFirst line contains t, the total test cases. Each test case looks as follows:First line contains N, total number of hostels.Next N - 1 lines contain two integers x and y, indicating that there is a road between x and y. (1 ≤ x < y ≤ N). The roads are numbered from 1 to N - 1.Next line contains Q, total number of queries.Next Q lines contain the Q queries.Each query may be of the following two forms:R x - Remove the road numbered x. It is guaranteed that this road exists and hasn't already been removed.Q - Output the total number of pairs (x, y) such that 1 ≤ x < y ≤ N and there exists no path between hostels x and y.OutputFor each test case,Output a line for each query with the required value.Print a blank line after each test case.ExampleInput:2\r\n\r\n3\r\n1 2\r\n1 3\r\n5\r\nQ\r\nR 1\r\nQ\r\nR 2\r\nQ\r\n\r\n4\r\n1 2\r\n1 3\r\n1 4\r\n7\r\nQ\r\nR 1\r\nQ\r\nR 2\r\nQ\r\nR 3\r\nQOutput:0\r\n2\r\n3\r\n\r\n0\r\n3\r\n5\r\n6",
  "sample_input": "Input:2\r\n\r\n3\r\n1 2\r\n1 3\r\n5\r\nQ\r\nR 1\r\nQ\r\nR 2\r\nQ\r\n\r\n4\r\n1 2\r\n1 3\r\n1 4\r\n7\r\nQ\r\nR 1\r\nQ\r\nR 2\r\nQ\r\nR 3\r\nQOutput:0\r\n2\r\n3\r\n\r\n0\r\n3\r\n5\r\n6",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NITTROAD",
  "scraped_at": "2025-08-17 00:33:46"
}