{
  "problem_code": "problems",
  "title": "FLING1",
  "tags": [],
  "text": "Fling! is a popular puzzle game created by the well-known developers at Candy Cane LLC.The premise of the game is simple. You are given a certain number of balls on the screen to start. The goal is to fling one into another in order to knock the other off the screen. The puzzle is considered solved if you can do so while leaving only one ball remaining on the screen. Some might read this and think that it might not be too difficult, but the game gets challenging quickly. The problem is that you cannot fling two balls that are adjacent (i.e. next to each other.)The first ball you choose can fling the 2nd ball if and only if:The two balls exist in same row or same column.The two balls are not adjacent.There is no other ball in between the two balls.If there exist a 3rd ball after the 2nd ball in the same line of action, the 2nd ball takes the position just before the third ball, pushes the 3rd ball and the 3rd ball gets flinged. (This continues until a ball gets knocked off the screen. Note that 2nd ball and 3rd ball can be adjacent).Given a Fling! puzzle, just print \"Yes\" if it is a valid puzzle (solvable) or \"No\" otherwise.For better understanding of gameplay you may have a look at thisvideo. (optional)InputThe first line of the input consists of an integer t, the number of test cases. For each test case, the first line consists of two integers m and n, the number of rows and columns of the puzzle. Then follows the description of the board. A[i][j] is '.' if the cell is empty or 'B' if the cell has a ball.OutputFor each test case print \"Yes\" if the puzzle is valid or \"No\" otherwise. (case-sensitive).Constraints1 ≤ t ≤ 1001 ≤ m, n ≤ 10You can assume that the number of balls in the board is approximately equal to (m × n) / 10.SampleInput:4\r\n5 5\r\n.....\r\n.....\r\n..B..\r\n.....\r\n.B..B\r\n5 4\r\n....\r\nB...\r\nB...\r\n....\r\nB...\r\n3 4\r\nBB..\r\n....\r\n.B..\r\n1 1\r\nBOutput:Yes\r\nYes\r\nNo\r\nYes",
  "sample_input": "Input:4\r\n5 5\r\n.....\r\n.....\r\n..B..\r\n.....\r\n.B..B\r\n5 4\r\n....\r\nB...\r\nB...\r\n....\r\nB...\r\n3 4\r\nBB..\r\n....\r\n.B..\r\n1 1\r\nBOutput:Yes\r\nYes\r\nNo\r\nYes",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/FLING1",
  "scraped_at": "2025-08-17 00:33:58"
}