{
  "problem_code": "problems",
  "title": "Detection of Extraterrestrial",
  "tags": [],
  "text": "E.T. Inc. employs Maryanna as alien signal researcher. To identify possible alien signals and background noise, she develops a method to evaluate the signals she has already received. The signal sent by E.T is more likely regularly alternative.Received signals can be presented by a string of small latin letters 'a' to 'z' whose length isN. For eachXbetween 1 andNinclusive, she wants you to find out the maximum length of the substring which can be written as a concatenation ofXsame strings. For clarification, a substring is a consecutive part of the original string.InputThe first line containsT, the number of test cases (T≤ 200). Most of the test cases are relatively small.Tlines follow, each contains a string of only lowercase Latin letters 'a' - 'z', whose lengthNis less than 1000, without any leading or trailing whitespaces.OutputFor each test case, output a single line, which should begin with the case number counting from 1, followed byNintegers. TheX-th (1-based) of them should be the maximum length of the substring which can be written as a concatenation ofXsame strings. If that substring doesn't exist, output 0 instead. See the sample for more format details.ExampleInput:2\r\narisetocrat\r\nnoonnoonnoonOutput:Case #1: 11 0 0 0 0 0 0 0 0 0 0\r\nCase #2: 12 8 12 0 0 0 0 0 0 0 0 0HintFor the second sample, the longest substring which can be written as a concatenation of 2 same strings is \"noonnoon\", \"oonnoonn\", \"onnoonno\", \"nnoonnoo\", any of those has length 8; the longest substring which can be written as a concatenation of 3 same strings is the string itself. As a result, the second integer in the answer is 8 and the third integer in the answer is 12.",
  "sample_input": "Input:2\r\narisetocrat\r\nnoonnoonnoonOutput:Case #1: 11 0 0 0 0 0 0 0 0 0 0\r\nCase #2: 12 8 12 0 0 0 0 0 0 0 0 0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DETECT",
  "scraped_at": "2025-08-17 00:34:02"
}