{
  "problem_code": "problems",
  "title": "Pattern Matching",
  "tags": [],
  "text": "A regular expression is a string which contains some normal characters and some meta characters.\r\nThe meta characters include:.means any character[c1 - c2]means any character between c1 and c2 (c1 and c2 are two characters).[ˆc1 - c2]means any character not between c1 and c2 (c1 and c2 are two characters).*means the character before it can occur any times.+means the character before it can occur any times but at least one times.\\means any character follow should be treated as normal character.You are to write a program to find the leftmost substring of a given string, so that the substring can match a given regular expression. If there are many substrings of the given string can match the regular expression, and the left positions of these substrings are same, we prefer the longest one.InputEvery two lines of the input is a pattern-matching problem. The first line is a regular expression, and the second line is the string to be matched. Any line will be no more than 80 character. A line with only an end will terminate the input.OutputFor each matching problem, you should give an answer in one line. This line contains the string to be matched, but the leftmost substring that can match the regular expression should be bracketed. If no substring matches the regular expression, print the input string.ExampleInput:.*\r\nasdf\r\nf.*d.\r\nsefdfsde\r\n[0-9]+\r\nasd345dsf\r\n[^\\*-\\*]\r\n**asdf**fasd\r\nb[a-z]*r[s-u]*\r\nabcdefghijklmnopqrstuvwxyz\r\n[T-F]\r\ndfkgjf\r\nendOutput:(asdf)\r\nse(fdfsde)\r\nasd(345)dsf\r\n**(a)sdf**fasd\r\na(bcdefghijklmnopqrstu)vwxyz\r\ndfkgjf",
  "sample_input": ".*\r\nasdf\r\nf.*d.\r\nsefdfsde\r\n[0-9]+\r\nasd345dsf\r\n[^\\*-\\*]\r\n**asdf**fasd\r\nb[a-z]*r[s-u]*\r\nabcdefghijklmnopqrstuvwxyz\r\n[T-F]\r\ndfkgjf\r\nend",
  "sample_output": "(asdf)\r\nse(fdfsde)\r\nasd(345)dsf\r\n**(a)sdf**fasd\r\na(bcdefghijklmnopqrstu)vwxyz\r\ndfkgjf",
  "link": "https://www.spoj.com/problems/PATT",
  "scraped_at": "2025-08-17 00:34:04"
}