{
  "problem_code": "problems",
  "title": "A los saltos",
  "tags": [],
  "text": "(The English version is following the Spanish version at each section, and is in green text.)Una secuencia deknúmeros enteros positivos, (k > 1),essaltarina, si los valores absolutos de las diferencias entre elementos sucesivos toman todos los valores posibles desde 1 hastak-1.Por ejemplo: la secuencia 51423, es una secuencia saltarina de longitud 5, porque las diferencias entre los elementos sucesivos de la secuencia son: 4,3,2,1Se desea conocer cuántas secuencias saltarinas hay de longitud L.En este problema consideramos que las secuencias están formadas únicamente por valores en 1..k.A sequence ofk > 1integers is called ajolly jumperif the absolute values of the difference between successive elements take on all the values 1 throughk-1.For example, the sequence 51423 is a jolly jumper of length 5, because the differences between consecutive elements are 4,3,2,1You must to find out how many jolly jumpers are with length = L.(in this problem we only consider the jolly jumpers built with values only in the 1..k range).InputCada línea de la entrada consta de un entero k, (> 1). Cada línea es un caso diferente para informar. La entrada termina con una línea conteniendo el valor 0, el cual no se procesa.Each line of the input have an integer k, (> 1). Each line is a different case to process. The input ends with a line that contains the value 0 (this value is the end of data signal and won't be processed).OutputPor cada línea de la entrada, se debe generar una línea de salida que informa la cantidad de secuencias saltarinas de longitud igual a k.Your program must to generate one output line for each input line. At each output line you must inform the quantity of jolly jumpers with length equal to k.SampleInput2\r\n3\r\n4\r\n0Output2\r\n4\r\n4",
  "sample_input": "Input2\r\n3\r\n4\r\n0Output2\r\n4\r\n4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SALTOS",
  "scraped_at": "2025-08-17 00:33:50"
}