{
  "problem_code": "problems",
  "title": "Journey to Mars",
  "tags": [],
  "text": "Byteazar has decided on going to Mars to tour the space stations there being in existence. All Martian space stations lie on a circumference of a circle. Byteazar lands in one of them and then moves around by means of a special vehicle which is powered by an appropriate fuel. A litre of this fuel allows him to travel one meter. However, the provisions of the fuel are meagre, different quantities of it are available in each space station. Byteazar may refuel in the space station he is currently in, though he cannot get more fuel than it is available in that very place (the capacity of his fuel tank is unlimited). This quantity of fuel should allow him to reach the next space station. Byteazar has to decide where to land, so that he can visit all of the space stations. In the end he has to return to the space station in which he has landed. During his journey Byteazar has to travel on the circumference of the circle, constantly in one of the two possible directions.TaskWrite a programme which:reads from the standard input the number of space stations, distances between them and the amount of fuel available in each of them,for each of the space stations checks, whether Byteazar can land there i.e. whether by starting in that very station and travelling in a freely chosen direction he is able to visit all of the space stations and return to his spaceship,writes the outcome to the standard output.InputThe first line of the standard input contains a single integerN(3 ≤N≤ 1,000,000). It denotes the number of space stations on Mars. The space stations are numbered from 1 toN. In the nextNlines there is a description of all of the stations and the distances between them. Thei+ 1st line contains two integerspianddi(pi≤ 0,di> 0). The first one denotes the amount of fuel (in litres) available in theith space station. The other denotes the distance (in metres) between theith andi+ 1st space station (obviouslydNdenotes the distance between theNth and the 1st space station). The total amount of available fuel, as well as the sum of all distances between the space stations does not exceed 2,000,000,000.OutputThe programme should writeNlines to the standard output. Theith line should contain the wordTAK(YESis Polish), if Byteazar can land in theith space station orNIE(NOin Polish) when it is not possible.ExampleFor the input data:5\r\n3 1\r\n1 2\r\n5 2\r\n0 1\r\n5 4the correct result is:TAK\r\nNIE\r\nTAK\r\nNIE\r\nTAK",
  "sample_input": "5\r\n3 1\r\n1 2\r\n5 2\r\n0 1\r\n5 4",
  "sample_output": "TAK\r\nNIE\r\nTAK\r\nNIE\r\nTAK",
  "link": "https://www.spoj.com/problems/JRNTMRS",
  "scraped_at": "2025-08-17 00:33:47"
}