{
  "problem_code": "problems",
  "title": "Magical Crafting",
  "tags": [],
  "text": "One of the recent hypes in terms of independent games has been Minecraft, a cute little game in which you mine some materials and are able to craft a lot of stuff using these materials. Since you already mastered the Minecraft universe, you decide to write your own little mod for the game to add magical crafting.Given some magic stonem1, by adding a specific amount of diamonds you can transform it into two magic stonesm2andm3, wherem1,m2andm3are upper-case letters. This is called a crafting recipe.There is also a default transformation which transforms a magic stone into its matching lighting effect; the matching lighting effect for a magic stone labelled with an upper-case letter is the corresponding lower-case letter, e. g. the magic stone 'A' can be transformed into the lighting effect 'a'. This transformation always costs exactly1diamond. The default transformation is used whenever you do not use a magic stone for another crafting recipe. The lighting effects will show in a certain order. For each used crafting recipem1→m2m3, the lighting effects which are derived from the magic stonem2will show before the lighting effects derived from the magic stonem3.You want to be able to craft wonderful magic lights for your own world.  But as you are aware of the rareness of the precious diamonds, and also very picky about the lighting effect sequences you want to achieve, you have to test your crafting recipes. The question arises if your set of crafting recipes allows you to create all your desired lighting effect sequences if you only have the magic stone 'A' to start with, and the minimum number of diamonds you will need for the transformations.InputThe first line of the input gives the number of test casesC(0 < C ≤ 100). Each test case starts with two integers0 ≤ R ≤ 30,0 ≤ L ≤ 10on a single line, denoting the set of recipes and the number of lighting effect sequences. The nextRlines contain the set of recipes. Each crafting recipe is given on a single line by the magic stonesm1,m2, andm3as well as the numberd(0 ≤ d ≤ 1000) of diamonds necessary for the transformation. The nextLlines contain the lighting effect sequences you want to create. Each of these lines contains an integerl(1 ≤ l ≤ 100), which represents the length of the lighting effect sequence. The line completes with a single string of lengthl, consisting only of lower case characters 'a' to 'z', which represents the sequence of lighting effects you want to create.OutputFor every test case printCASE #followed by the number of the test case, starting with1, on a single line. For each lighting effect sequence print a single line. If the effect is possible printPOSSIBLE WITHXDIAMONDS, withXrepresenting the number of diamonds you will need to achieve the lighting effect sequence. In the case the lighting effect sequence cannot be crafted, printIMPOSSIBLE.ExampleInput:2\r\n1 4\r\nA A A 2\r\n3 aaa\r\n8 aaaaaaaa\r\n5 ababa\r\n1 a\r\n3 1\r\nA B C 1\r\nC P C 7\r\nB I C 11\r\n4 icpcOutput:CASE #1\r\nPOSSIBLE WITH 7 DIAMONDS\r\nPOSSIBLE WITH 22 DIAMONDS\r\nIMPOSSIBLE\r\nPOSSIBLE WITH 1 DIAMONDS\r\nCASE #2\r\nPOSSIBLE WITH 23 DIAMONDS",
  "sample_input": "Input:2\r\n1 4\r\nA A A 2\r\n3 aaa\r\n8 aaaaaaaa\r\n5 ababa\r\n1 a\r\n3 1\r\nA B C 1\r\nC P C 7\r\nB I C 11\r\n4 icpcOutput:CASE #1\r\nPOSSIBLE WITH 7 DIAMONDS\r\nPOSSIBLE WITH 22 DIAMONDS\r\nIMPOSSIBLE\r\nPOSSIBLE WITH 1 DIAMONDS\r\nCASE #2\r\nPOSSIBLE WITH 23 DIAMONDS",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GCPC11E",
  "scraped_at": "2025-08-17 00:33:49"
}