{
  "problem_code": "problems",
  "title": "Suiting Weavers",
  "tags": [],
  "text": "Willy the Weaver is in desperate hope to get married to the most beautiful and delightful female weaver Wilmar. Of course, Willy is not the only weaver interested in Wilmar.In order to impress the females, weavers build elaborately woven nests using leaf fibers. Tomorrow is the big day on which Wilmar will inspect all nests. There is a heavy storm at the moment, and no weaver can leave his nest within the hours before sunrise. However, the storm will produce many piles of leaf fibers, so that all weavers will have a chance to improve their nests. Therefore, Willy is curious if he can succeed weaving the most impressive nest, so that Wilmar will finally decide on getting married to him. Since size matters, Willy tries to figure out how large his nest and the ones of his rivals may become.For this purpose, Willy takes into consideration all known places offering leaf fibers suitable for nest construction. Since weavers do not like to leave their known territory, many of these places can be accessed by a subset of all weavers only, and some might even not be reachable by any weaver.To reduce complexity, Willy does not want to set up a flight plan. This implies that he does not consider any particular strategy of his rivals nor does he make any assumptions on how many fibers they can carry at a time or how quick and when they fly. It is therefore possible that a weaver succeeds in picking up all fibers in his territory. Finally, Willy assumes that all weavers are as integer as he is: they do not steal fibers from nests of their rivals.Is there any chance that no weaver will have a larger nest (number of fibers) than Willy after all leaf fibers have been picked up?InputThe first line contains the number of testcasesT(1 ≤ T ≤ 100). Each test case starts with a line containing two integers. The first integerW(1 ≤ W ≤ 100) is the number of weavers (including Willy); the second oneP(1 ≤ P ≤ 400) is the number of places with leaf fibers.Next comeWlines describing the nest of each weaver with four integersx,y,f, andr(0 ≤ x, y, r ≤ 10000,1 ≤ f ≤ 10000):xandydefine the position of the nest,fis the size of the nest in number of fibers, andris the radius of the territory in which the owner of the nest will search for additional fibers. The first of theseWlines describes Willy's nest.Thereafter followPlines defining the places with available leaf fibers with three integersx,y, andf(0 ≤ x, y ≤ 10000,1 ≤ f ≤ 10000):xandydefine the position of the place, andfis the number of available leaf fibers.OutputFor each test case print one single line containing the stringSuiting Success, if Willy has a chance to marry Wilmar after all fibers have been picked up (a tie in nest size is sufficient); else printLonesome Willy.ExampleInput:2\r\n3 2\r\n0 0 1 10\r\n10 0 1 10\r\n20 0 1 10\r\n5 0 2\r\n15 0 4\r\n3 2\r\n0 0 1 10\r\n10 0 1 10\r\n20 0 1 10\r\n5 0 2\r\n15 0 5Output:Suiting Success\r\nLonesome Willy",
  "sample_input": "Input:2\r\n3 2\r\n0 0 1 10\r\n10 0 1 10\r\n20 0 1 10\r\n5 0 2\r\n15 0 4\r\n3 2\r\n0 0 1 10\r\n10 0 1 10\r\n20 0 1 10\r\n5 0 2\r\n15 0 5Output:Suiting Success\r\nLonesome Willy",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GCPC11I",
  "scraped_at": "2025-08-17 00:33:58"
}