{
  "problem_code": "problems",
  "title": "Sightseeing",
  "tags": [],
  "text": "As a computer science student you are of course very outdoorsie, so you decided to go hiking. For your vacation this year, you located an island full of nice places to visit. You already identified a number of very promising tracks, but are still left with some problems. The number of choices is so overwhelming, that you had to select only a \"small\" subset of at most105sights.And if that is not enough, you are very picky about the order in which you want to visit the sights. So you have already decided on an order in which you want to visit the preselected tracks. The problem you are left with is to decide in which direction to travel along each single track, and whether you may have to reduce your choice of tracks even further. After identifying the travel time between the endpoints of different tracks, you decide to write a program to figure out if you can make all your trips within the time you have planned for your vacation. Since you also do not want to waste any precious time, you only care about an optimal solution to your problem. Furthermore, the tracks can get pretty challenging. Thats why you do not want to hike along a track more than once.InputThe first line of the input gives the number of test casesC(0 < C ≤ 100). The first line of each such test case holds two integersN,Tthe number of tracks of the current hiker (1 ≤ N ≤ 105) and the maximal time spent hiking throughout the vacation (0 ≤ T ≤ 106). Each of the followingNlines holds five integerscp,cbb,cbe,cebandceethat describe a track (in order of importance).cpgives the length of the track in minutes.cxygives the travel time of the officialbegin orend of a track to thebeginning orend of the next most important track, wherexandyare eitherbore. All values given are non-negative integers not greater than106. Since you have to get back to your car, the list is circular. Furthermore, we will ignore the time it takes you to get to the start of your trip with your car.OutputFor each test case print one line. The output should contain a list of eitherForBfor every track (in order) indicating whether you have to hike the track in forward direction or backward direction. If you cannot make the full trip within the planned timeT, you should printIMPOSSIBLEto indicate that these trips are just too much hiking. You can assume that the optimal solution is always unique.ExampleInput:3\r\n2 100\r\n4 7 8 2 3\r\n1 4 6 1 2\r\n2 20\r\n4 2 3 7 8\r\n1 1 2 4 6\r\n3 5\r\n1 2 2 2 1\r\n1 1 2 2 2\r\n1 2 2 1 2Output:FF\r\nBB\r\nIMPOSSIBLE",
  "sample_input": "Input:3\r\n2 100\r\n4 7 8 2 3\r\n1 4 6 1 2\r\n2 20\r\n4 2 3 7 8\r\n1 1 2 4 6\r\n3 5\r\n1 2 2 2 1\r\n1 1 2 2 2\r\n1 2 2 1 2Output:FF\r\nBB\r\nIMPOSSIBLE",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GCPC11H",
  "scraped_at": "2025-08-17 00:33:56"
}