{
  "problem_code": "problems",
  "title": "DCD",
  "tags": [],
  "text": "Once upon a time, there was a secret group of boys. People used to call them 'Dushtu Cheler Dol' (Gang of Naughty boys) or DCD in short. Members of DCD were very good at making fool of people.Suppose, you are a member of DCD and you want to borrow money fromNpeople (you are definitely not going to return the money because that will go against the values of DCD). Some of  theNpeople will not lend you money as they know about DCD. But at first you don't know how many of them know about it. Then there areMmembers of DCD who want to borrow money from you. As you know none of theMpeople will return your money, you will try to escape from them when they will ask you for money, but you are not sure of being able to escape. Failure of escaping means, you must give them the money they want. So, before starting you wanted to determined how much money you will have after the whole process. As many solutions are possible, you will determine an interval, which contains the maximum number of possible solutions. The difference between the starting point and ending point will be of definite size (given in the input).InputTest cases start with two integersNandM. Next, there will beNintegers in the same or different lines where[0 <= Ni<= 1015]is the amount of money you will borrow from the ithperson. Then there will beMintegers in the same or different lines, where[0 <= Mi<= 1015]is the amount of money ithDCD member will ask for.(N + M) <= 17. Then you will be given an integerD [1 <= D <= 1015], the difference between the starting point and ending point of the desired interval.There will be at most200test cases.OutputFor each test case, you have to print three integersS,TandE.SandTare the endpoints of an interval of differenceD, (S <= T).Eis the  number of solutions betweenSandT(inclusive).If there are several solutions, print the interval whereSitself is a possible solution. If still there are several solutions, print the interval having minimum value ofS.Note:Same money values achieved by different ways are considered different.If you can't escape, you will have to pay money even if you have zero or less money left. Then your amount will be considered negative.If the starting value of the interval isX, the ending value will beX + D - 1.ExampleInput:2 0\r\n1 2\r\n1\r\n4 1\r\n5 6 9 9\r\n2\r\n5Output:0 0 1\r\n11 15 9",
  "sample_input": "Input:2 0\r\n1 2\r\n1\r\n4 1\r\n5 6 9 9\r\n2\r\n5Output:0 0 1\r\n11 15 9",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DCD",
  "scraped_at": "2025-08-17 00:34:06"
}