{
  "problem_code": "problems",
  "title": "Lego",
  "tags": [],
  "text": "It's Christmas morning, and you've got what you wanted: a box of Lego™! (Okay, maybe not, but better than nothing)Lego is pretty fun to tinker with, and you've decided to build some sort of shape.(For the sake of this problem, let's say your shape is basically 2-dimensional - it'll be a slab)But once you pick it up, you discover that you didn't plan it properly, and your wonderful shape just falls apart.Now, you're planning to build something big, and so you're going to use the computer to help you.Write a program, that given the layout of a Lego design, outputs the number of pieces it would break into if picked up.(Assume that the bricks bind together perfectly)The Legos will be built on a x-y coordinate plane, with (0,0) being the bottom left corner.The blocks are flat on your carpet, so a block will never 'fall down'.(If you haven't seen a Lego brick before: A Lego brick has grooves on its top that match with notches on the bottom.If a groove and a notch bind, the bricks will stay together. See the diagram.A brick will bind with another brick securely even if just a single notch touches another groove.Input:The first line containsN(the number of Lego pieces), 1 ≤N≤ 100000.Nlines follow, each with 4 integersx1,y1,x2,y2(0 ≤x1<x2≤ 2×109, 0 ≤y1<y2≤ 2×109)This means that there is a brick with bottom left corner (x1,y1) and top right corner (x2,y2).xdenotes the horizontal coordinate andythe vertical coordinate. Two bricks will bind if one's bottomy-coordinate coincides with the other's topy-coordinate and the intersection of the two intervals (the bottom of one and the top of the other) has nonzero length.No bricks will overlap.Output:A single line containing the number of separate pieces that these blocks form.Sample Input:4\r\n0 0 2 2\r\n1 2 3 4\r\n2 0 4 2\r\n4 0 6 2Sample Output:2ExplanationBlocks #1,2,3 are joined securely.However, #4 is just hanging around.",
  "sample_input": "4\r\n0 0 2 2\r\n1 2 3 4\r\n2 0 4 2\r\n4 0 6 2",
  "sample_output": "2",
  "link": "https://www.spoj.com/problems/LEGO",
  "scraped_at": "2025-08-17 00:33:52"
}