{
  "problem_code": "problems",
  "title": "Payment System",
  "tags": [],
  "text": "The payment system in the University of Mineral Water Production is\r\ncompletely automated (written entirely in Tomato Programming Language)\r\nand lets you input the amount of money you want to withdraw. Due\r\nto the high payment rates of the professors they may input the\r\namounts in exponential forms. So if you want to withdraw 16 MWU (mineral\r\nwater units) you can enter 16, 2^4 or 2^2^2.One day, Stanescu tried to withdraw some money from his account\r\nwhich had balance of 80MWU. He mistakenly entered 2^3^2 and for his\r\nsurprise he got 512MWU, although he should not be able to take more than 80.The system was composed of two main modules – the first module checks\r\nwhether the account has enough money to execute the transaction\r\nand the second module gives the money to the user. It turned out\r\nthat the first module has a problem with the '^' operator. It\r\nevaluates it from left to right, while the second evaluates\r\nthem from right to left (the correct way). Thus for the first module\r\n2^3^2=(2^3)^2=64 while for the second it’s 2^3^2=2^(3^2)=512.You have to write program which helps Stanescu get as much as he can\r\nfrom the university system. If you think it’s not legal or something,\r\nbe sure that the University of Mineral Water\r\nProduction is bad and evil.In the input file the amounts of the accounts of Stanescu will be given.\r\nEach amount is given on a separate line and is an integer between 2 and 10^100-1.For each given amount, your program should print to the\r\nstandard output what Stanescu should enter to get maximal number\r\nof money. The output should:Consists only of integers and the '^' operator between them.Pass the check of the first module and be as much as possible for the second.Not contain the number 1 (it is useless anyway).If more than one answers exist, output the one whose first number\r\nis minimal, if still more exist, choose the one whose second number\r\nis minimal and so on.SampleInput:16\r\n80\r\n49\r\n1025\r\n12341234\r\n12345678901234567890Ouput:2^2^2\r\n2^3^2\r\n7^2\r\n2^2^5\r\n2^2^2^5\r\n2^2^2^2^3^2",
  "sample_input": "Input:16\r\n80\r\n49\r\n1025\r\n12341234\r\n12345678901234567890Ouput:2^2^2\r\n2^3^2\r\n7^2\r\n2^2^5\r\n2^2^2^5\r\n2^2^2^2^3^2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MSE06E",
  "scraped_at": "2025-08-17 00:33:52"
}