{
  "problem_code": "problems",
  "title": "Byteantean towns",
  "tags": [],
  "text": "“Segment is the shortest path connecting two points” — this motto was the main motivation for road designers\r\nin the Byteantean Empire. For this reason all roads constructed in the Empire were straight and led across\r\nthe whole country. At each crossing of two roads Byteanteans planted a town. To avoid misunderstandings,\r\nByteanteans never constructed more than two roads that would intersect at a single point.The Emperor of Byteantis would now like to divide his country into two provinces, as equal in the sense\r\nof the number of towns as possible. One of the roads of the Empire will become the borderline between the\r\nprovinces. The towns that are located strictly on the borderline will not be under authority of any of the\r\nprovinces, but only of the Emperor himself. He, therefore, would like to compute, for each road, the absolute\r\nvalue of the difference between the number of towns located on one side of the road and on the other side of\r\nthe road.Byteman, the court cartographer, spent many days trying to fulfill the Emperor’s order. Your task is to\r\nwrite a program that will help perform his work.InputThe first line of the standard input contains an integer n (1 ≤ n ≤ 1 000) denoting the number of roads in the Empire. Each of the following n lines contains a description of a single road — four of integers x1, y1, x2, y2 (−1 000 ≤ x1, y1, x2, y2 ≤ 1 000, points (x1, y1) and (x2, y2) do not coincide) separated by single spaces. Each such quadruple represents a single road that is a straight line passing through points (x1, y1) and (x2, y2). No\r\ntwo roads coincide. No three roads intersect at a single point. We assume that the Empire is so large that all\r\nintersections of lines representing roads are located within its boundary.OutputYour program should write out n lines to the standard output — the answers for all roads from the input (in\r\nthe same order as in the input). The answer for a road is the absolute value of the difference of numbers of\r\ntowns at both sides of the road.ExampleFor the input data:4\r\n1 -1 1 10\r\n0 0 1 0\r\n2 0 2 1\r\n4 4 -1 -1the correct result is:1\r\n2\r\n3\r\n2There are five towns in the example, with coordinates (0, 0), (1, 0), (1, 1), (2, 0), and (2, 2).",
  "sample_input": "4\r\n1 -1 1 10\r\n0 0 1 0\r\n2 0 2 1\r\n4 4 -1 -1",
  "sample_output": "1\r\n2\r\n3\r\n2",
  "link": "https://www.spoj.com/problems/AE5B1",
  "scraped_at": "2025-08-17 00:34:02"
}