{
  "problem_code": "problems",
  "title": "Permutacja",
  "tags": [],
  "text": "You are given a sequence of positive integers a1, a2, . . . , an. We would like to order the numbers from 1 to\r\nn in such a way, that the i-th number is not greater than ai(for each i). In other words, we are looking for\r\na permutation p of numbers from 1 to n, which satisfies: pi≤ aifor each 1 ≤ i ≤ n. There is one more problem,\r\nthe sequence ai may change over time. . .InputThe first line of standard input contains one integer n (1 ≤ n ≤ 200 000), the number of elements of the aisequence. In the second line, there is a sequence of n positive integers ai(1 ≤ ai≤ n), separated by single\r\nspaces. The third line contains one integer m (0 ≤ m ≤ 500 000), representing the number of modifications\r\nmade to the ai sequence. The following m lines describe these modifications. Each description consists of two\r\nintegers jiand wi(1 ≤ ji, wi≤ n for 1 ≤ i ≤ m), separated by single spaces and meaning that ji-th element\r\nof the sequence becomes wi. The operations take place in turns, so the i-th modification is applied to the\r\nsequence altered by (i − 1) previous modifications.OutputYour program should output exactly m + 1 lines to the standard output. Each of those lines should contain\r\none word TAK (meaning YES) or NIE (meaning NO). The word in the first line should tell if there exists\r\na permutation p, which satisfies pi≤ aifor each i (for the original aisequence), whereas the words from\r\nfollowing lines answer the question whether there exist any (potentially different) permutations that satisfy\r\nthe given conditions for the ai sequence after each modification.ExampleFor the input data:5\r\n3 4 3 2 5\r\n2\r\n5 4\r\n1 5the correct result is:TAK\r\nNIE\r\nTAKExplanation of the example. For the original ai sequence, the condition is satisfied by permutation\r\n2, 4, 3, 1, 5. After the first modification, the sequence becomes 3, 4, 3, 2, 4 and for this sequence no valid\r\npermutation exists. After the second modification, the sequence is 5, 4, 3, 2, 4. An example of a permutation\r\np satisfying all constraints for this sequence is 5, 1, 3, 2, 4.",
  "sample_input": "5\r\n3 4 3 2 5\r\n2\r\n5 4\r\n1 5",
  "sample_output": "TAK\r\nNIE\r\nTAK",
  "link": "https://www.spoj.com/problems/AE5B2",
  "scraped_at": "2025-08-17 00:34:05"
}