{
  "problem_code": "problems",
  "title": "(K,N)",
  "tags": [],
  "text": "Bytean chess is one of the most peculiar variants of chess in the world.\r\n  Playing each match is a major difficulty, because the game is played on an infinite chessboard.\r\n  The basic ability learnt by young enthusiasts of Bytean chess is considering all possible situations on a chessboard after millions of moves.\r\n  To perform this, they need to know whether a given chess piece can get from one given square to another one.The most powerful chess piece in Bytean chess is a (K, N)-knight.\r\n  Its moves resemble the moves of a knight in traditional chess.\r\n  Each of its moves consists of: either moving K squares vertically\r\n  and afterwards N squares horizontally, or moving N squares vertically and afterwards\r\n  K squares horizontally.\r\n  The knight from traditional chess can therefore be thought of as (2, 1)-knight or\r\n  (1, 2)-knight.The task is to verify, for two given squares of the chessboard, if a (K, N)-knight can get\r\n  from the first square to the second one (the number of necessary moves is not important).InputThe first line of the standard input contains one integer T\r\n  (1 ≤ T ≤ 20000) denoting the number of test cases.\r\n  Each of the following T lines contains a description of a single test case\r\n  in the form of six integers K, N, x1, y1, x2, y2(0 ≤ K, N ≤ 109, K + N > 0, -109≤ x1, y1, x2, y2≤ 109)\r\n  separated by single spaces.\r\n  K and N describe the possible moves of the knight.\r\n  The knight starts its movement in square (x1, y1). We would like to check if it can get to square (x2, y2).OutputFor each test case exactly one line should be written to the standard output.\r\n  It should contain a wordTAK(meaning YES) orNIE(meaning NO)\r\n  depending on whether a (K, N)-knight starting from square (x1, y1)\r\n  can get to square (x2, y2).ExampleFor the input data:3\r\n2 1 0 0 3 3\r\n1 1 1 1 1 2\r\n1 0 2 3 4 6the correct result is:TAK\r\nNIE\r\nTAKTask author: Jakub Onufry Wojtaszczyk.",
  "sample_input": "3\r\n2 1 0 0 3 3\r\n1 1 1 1 1 2\r\n1 0 2 3 4 6",
  "sample_output": "TAK\r\nNIE\r\nTAK",
  "link": "https://www.spoj.com/problems/AE2B",
  "scraped_at": "2025-08-17 00:33:51"
}