{
  "problem_code": "problems",
  "title": "Drilling",
  "tags": [],
  "text": "Byteman is the person in charge of a team that is looking for crude oil reservoirs. He has made two boreholes:\r\nhe found crude oil in point A and found out that there is no crude oil in point B. It is known that the oil\r\nreservoir occupies a connected fragment of segment AB with one end at point A. Now Byteman has to check,\r\nhow far, along the segment connecting points A and B, does the oil reservoir reach. It is not that simple,\r\nhowever, because in some locations one can drill faster than in other locations. Moreover, Byteman’s team is\r\nrather small, so they can drill in at most one location at a time. Byteman’s boss would like him to predetermine\r\nwhen he will be able to identify the boundary of the oil reservoir.Byteman has asked you for help. He has divided the segment connecting points A and B into n+1 segments\r\nof equal length. If we assume that point A has coordinate 0, and point B coordinate n + 1, then there are\r\nn points with coordinates 1, 2 ... n between them. It is enough to find the farthest from A of these points\r\nin which some crude oil occurs. Byteman has informed you about the amounts of time necessary for making\r\nboreholes in these points — they are equal to t1, t2... tnrespectively. You should create such a plan of\r\ndrilling, that the time necessary to identify the oil reservoir’s boundary is shortest possible, assuming the\r\nworst-case scenario.InputThe first line of the standard input contains a single positive integer n (1 ≤ n ≤ 2000). The second line contains\r\nn positive integers t1, t2 ... tn separated by single spaces (1 ≤ ti≤ 106).OutputYour program should write a single integer to the standard output—the smallest amount of time that Byteman\r\nhas to spend (assuming the worst-case scenario) drilling in search of oil, to be sure that he will identify the\r\nreservoir’s boundary.ExampleFor the input data:4\r\n8 24 12 6the correct result is:42Explanation of the example.Assume that Byteman makes the first borehole at point 1, what takes him\r\ntime 8. It can then turn out that he finds crude oil there and he will have to check, how far to the right does\r\nthe reservoir reach. He will need two more boreholes, making which requires 36 units of time in the worst case.\r\nTherefore, in this case Byteman will spend in total 44 units of time drilling.It turns out that it is better to start at point 2. If there is no crude oil there, it is sufficient to check point\r\n1. However, in the worst case Byteman will have to make two more boreholes in points 3 and 4 and end his\r\nwork in total time equal to 42.",
  "sample_input": "4\r\n8 24 12 6",
  "sample_output": "42",
  "link": "https://www.spoj.com/problems/AE3A",
  "scraped_at": "2025-08-17 00:33:56"
}