{
  "problem_code": "problems",
  "title": "Jumping Hands",
  "tags": [],
  "text": "In Shanghai, there are some famous clock towers built more than 100 years ago, such as the office building of Shanghai Customs, Xujiahui Church, etc. Every clock tower’s clock-face consists of three hands: an hour hand, a minute hand, and a second hand. The hands are not move smoothly as time passing. When a second passes, the hands jump to the next place clockwise: the second hand moves 1/60 ring, the minute hand moves 1/3600 ring and the hour hand moves 1/43200 ring.We assume that every hand’s mass is evenly distributed, and its thickness can be ignored. In other words, every hand’s centre of gravity is at the middle position of the respective hand. Supposep1,p2andp3are, respectively, the position of the centre of gravity of the hour hand, that of the minute hand, and that of the second hand. The position of all three hands’ centre of gravity,P, is the average ofp1,p2andp3weighted by the hands’ mass.SupposeP1andP2are the positions of the three hands’ centre of gravity at the start time and at the end time, respectively. Your task is to calculate the length of the path fromP1toP2. That is, ifP3is the position of the three hands’ centre of gravity on the clock-face at a point of time between start time and end time,Xis the length of the path fromP1toP3, andYis the length of the path fromP3toP2, the length of the path fromP1toP2isX+Y.InputInput consists of one or more lines, each line describing one data set. Each line begins with 6 integers:L1,L2,L3,M1,M2,M3, followed by start time and end time.L1,L2andL3indicate the lengths of hour hand, minute hand and second hand respectively, where 1 ≤L1<L2<L3≤ 100.M1,M2andM3indicate the weights of hour hand, minute hand and second hand respectively, where 1 ≤M1,M2,M3≤ 100. The format of start time and end time ishh:mm:ss, where 0 ≤hh ≤23, 0 ≤mm ≤59, and 0 ≤ss ≤59. Start time and end time should be in the same day.End of input is indicated by a line consisting of -1.OutputFor each data set, output a single line. Each line should give the length of the path for the positions of three hands’ centre of gravityat the start time and at the end time. We accept solutions with absolute error less than 10-2.ExampleInput:1 2 3 1 2 3 00:00:00 00:00:01\r\n3 4 5 1 1 1 09:00:00 18:00:00\r\n-1Output:0.08\r\n2826.27",
  "sample_input": "Input:1 2 3 1 2 3 00:00:00 00:00:01\r\n3 4 5 1 1 1 09:00:00 18:00:00\r\n-1Output:0.08\r\n2826.27",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/JUMP1",
  "scraped_at": "2025-08-17 00:34:06"
}