{
  "problem_code": "problems",
  "title": "Roads Repair",
  "tags": [],
  "text": "EnglishVietnameseThe traffic network in a country consists of N cities (labeled with integers 1 to N) and N-1 roads connecting the cities. There is a unique path between each pair of different cities.Because of the many years of lazy maintenance the roads are pretty damaged and for each road two numbers A and B are known – the integer A represents the current time (in seconds) needed to travel along the road, and the integer B represents the smallest possible time (in seconds) needed to travel along this road if we repair all the damage.We want to invest a certain amount of money into road repair. For a particular road, the result will be proportional to the amount of invested money. For each euro invested in some road, the time needed to travel along that road will be reduced by one second (the amount of money invested in some road has to be an integer). The travel time cannot be reduced beyond the smallest possible time B described above.We are given a certain amount of money. We want to distribute this money along different roads in such a way that the time needed to travel from the city 1 to the most distant city (after all the repairs) is as small as possible.Write a program that will find this smallest time.InputThe first line of input contains two integers N and K, 2 ≤ N ≤ 100 000, 0 ≤ K ≤ 1 000 000, the number of cities and the total amount of money (in euros).Each of the next N-1 lines contains four integers X, Y, A and B, 0 ≤ B ≤ A ≤ 10 000. It means that there is a road between cities X and Y, with the numbers A and B representing the current time and the minimum time as described above.OutputThe first and only line of output should contain a single integer – the minimum time from the task description.SampleInput:3 200\r\n1 2 200 100\r\n2 3 450 250Output:450Input:5 11\r\n1 2 10 5\r\n1 3 3 2\r\n1 4 9 6\r\n3 5 7 3Output:6Input:11 12\r\n1 2 7 5\r\n1 3 20 15\r\n2 4 10 8\r\n2 5 5 3\r\n2 6 6 2\r\n4 7 3 0\r\n4 8 7 2\r\n5 9 8 4\r\n5 10 9 8\r\n5 11 6 5Output:17",
  "sample_input": "Input:3 200\r\n1 2 200 100\r\n2 3 450 250Output:450",
  "sample_output": "Input:5 11\r\n1 2 10 5\r\n1 3 3 2\r\n1 4 9 6\r\n3 5 7 3Output:6",
  "link": "https://www.spoj.com/problems/MROADS",
  "scraped_at": "2025-08-17 00:34:01"
}