{
  "problem_code": "problems",
  "title": "Determinant of Banded Matrices",
  "tags": [],
  "text": "Computing the determinant of a matrix using Gaussian elimination takes O(n^3). On the other hand, computing the determinant of tridiagonal matrix is O(n) using a recurrence. In this problem you will compute the determinant of banded matrices. A band matrix is a sparse matrix, whose non-zero entries are confined to a diagonal band, comprising the main diagonal and zero or more diagonals on either side. In this problem, given a bandedNxNsquare integer matrix withMbands on each side of the diagonal, we ask you to compute the determinant of this matrix. For example a tridiagonal matrix has exactly 1 band on each side, and the 8x8 Matrix in the sample input has 2 bands on each side. For a good discussion of banded matrices, see Thorson's paper at: www.stanford.edu/oldreports/sep20/20_11_abs.htmlInputA total of < 10 inputs. For each input,First line has dimension,N (1 < N < 501), of the matrix, followed byNlines withNintegers, each less than10001, and greater than-10001. It is guaranteed that the number of bands on each side of the diagonal,M < 51.That is there are at most101bands in total including the diagonal. Use scanf IO, and avoid stl IO.OutputFor each input matrix, output its determinantmodulo 10^9+7.Hint:Use Montgomery multiplication for fast computation, i.e., see: http://everything2.com/title/Montgomery%2520multiplicationExampleInput:2\r\n2 0\r\n0 2\r\n2\r\n1 0\r\n0 1\r\n8\r\n1 0 -1 0 0 0 0 0\r\n-1 1 0 -1 0 0 0 0\r\n-1 0 -1 1 -1 0 0 0\r\n0 -1 0 -1 0 -1 0 0\r\n0 0 -1 0 1 0 -1 0\r\n0 0 0 -1 -1 1 0 -1\r\n0 0 0 0 -1 0 -1 1\r\n0 0 0 0 0 -1 0 -1Output:4\r\n1\r\n36",
  "sample_input": "Input:2\r\n2 0\r\n0 2\r\n2\r\n1 0\r\n0 1\r\n8\r\n1 0 -1 0 0 0 0 0\r\n-1 1 0 -1 0 0 0 0\r\n-1 0 -1 1 -1 0 0 0\r\n0 -1 0 -1 0 -1 0 0\r\n0 0 -1 0 1 0 -1 0\r\n0 0 0 -1 -1 1 0 -1\r\n0 0 0 0 -1 0 -1 1\r\n0 0 0 0 0 -1 0 -1Output:4\r\n1\r\n36",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BANDMATR",
  "scraped_at": "2025-08-17 00:33:57"
}