{
  "problem_code": "problems",
  "title": "Dixon Dominoes",
  "tags": [],
  "text": "Dixon was in his house, he was a little bored, so he took some dominoes from the case and started thinking: “It is possible to use Qx pieces from the Dominoes so it can make a simulation of a game?” so, Dixon is not a super programmer, but he knows a little bit of constraints in the problems, so he will give it to you, your task, if you choose to accept it, is to find all the possible ways of some N pieces of Domino can be joined together to make a game simulation using exactly Qx dominoes pieces. If you can’t do this, you should print “0”InputThe input will consists of an integer T, denoting the number of test cases, next, T cases will follow, every case starts with 2 lines N and Q, being N the number of dominoes David has and Q the number of queries you should do, then, N lines will follow, denoting the two parts of a domino piece, as you may know, the domino piece is split in two, so you can join by any side another piece, after this, Q lines will follow, denoting the number of piece you must use to build the game simulation.Constraints1 ≤ T ≤ 1001 ≤  N ≤ 161 ≤ Q ≤ 160 ≤ N1… NN≤ 61 ≤ Q1… QN≤ NOutputYou should outputallthe possible ways to form a game using Qx pieces (with any possible permutation too), as this number can grow very huge, we need you to print the output modulo 31337.ExampleInput:34 32 33 11 44 31342 11 21 222 11 11 12Output:8\r\n10\r\n4\r\n4\r\n8Domino idea credits goes to:Daniel AmpueroandLuis ArguelloExample of the output with the first case and Q=4solution 1: joining the pieces 1, 2, 3 and 4.solution 2: joining the pieces 4, 3, 2 and 1.solution 3: joining the pieces 2, 3, 4 and 1.solution 4: joining the pieces 1, 4, 3 and 2.Tip: In the case with one piece only, you can form a game starting with the two faces of every single piece, i.e. if we want to form a game using just the piece \"2 1\", one possible game is \"2 1\" and the other \"1 2\", resulting in two different ways.",
  "sample_input": "Input:34 32 33 11 44 31342 11 21 222 11 11 12Output:8\r\n10\r\n4\r\n4\r\n8",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DIXDOOM",
  "scraped_at": "2025-08-17 00:33:59"
}