{
  "problem_code": "problems",
  "title": "Discord is Cornered",
  "tags": [],
  "text": "The ponies have finally cornered Discord. His earlier escape attempts didn't help him much.The unicorn ponies have begun casting magic spells at Discord to turn him back into stone.\r\nThere are N ponies and pony I has a casting rate A_I. That is, once pony I began casting\r\nher magic spell, it would send a bolt of magic at Discord every A_I seconds, precisely.At time t = 0 seconds, all the ponies began casting their magic. It has now been M seconds since they began casting.Discord is wearing down. He only can survive being hit by K-1 more spells before being turned into stone (so the Kth spell will turn him to stone).Determine which pony has the honor of casting the final blow against Discord.Notes: If multiple ponies send a bolt of magic at the same time, then they hit in order of the smaller rate first.All the ponies are casting different spells, so all the casting rates are distinct.If some ponies cast a bolt of magic after exactly M seconds, that bolt has already hit Discord. He can survive an additional K-1 spells.InputThe input file will begin with a number T on the first line, indicating the number of test cases in the file. It is followed by 2T lines, which represent the T test cases. Test case i begins with the label \"Case #i: \" and is followed by space separated N, M, and K for that case. On the next line are N space separated integers representing the rates of pony0, pony1... ponyN-1.T //number of test cases\r\nCase #1: N M K//number of ponies, number of seconds since they began casting, the spell which will turn him to stone\r\nA0A1... AN-1... (etc.)OutputThe output contains T lines, one for each test case. For test case i, begin the line with the label \"Case #i: \", and then the index of the pony which has dealt the final blow against Discord.Case #1: C1// C1is the pony which casts the final blow against Discord\r\nCase #2: C2...\r\nCase #T: CTConstraintsNumber of test cases varies. Depends on the instance size.1 ≤ N ≤ 50000 ≤ M ≤ 1018- 11 ≤ K < 263- 11 ≤ Ai≤ 1018ExampleInput:5\r\nCase #1: 2 0 4\r\n2 3\r\nCase #2: 2 0 5\r\n2 3\r\nCase #3: 3 7 4\r\n2 3 5\r\nCase #4: 4 55 88\r\n10000 55 3 16\r\nCase #5: 4 9950 23\r\n10000 55 3 16Output:Case #1: 0\r\nCase #2: 1\r\nCase #3: 2\r\nCase #4: 2\r\nCase #5: 0You can be assured that it will not take more than 1018seconds to turn Discord into stone from when the ponies began casting.",
  "sample_input": "T //number of test cases\r\nCase #1: N M K//number of ponies, number of seconds since they began casting, the spell which will turn him to stone\r\nA0A1... AN-1... (etc.)",
  "sample_output": "Case #1: C1// C1is the pony which casts the final blow against Discord\r\nCase #2: C2...\r\nCase #T: CT",
  "link": "https://www.spoj.com/problems/PONY4",
  "scraped_at": "2025-08-17 00:34:10"
}