{
  "problem_code": "problems",
  "title": "IPL",
  "tags": [],
  "text": "NOTE: This problem needs knowledge about the gamecricket.Those who know the basics about IPL can skip the first paragraph.IPL is one of the famous cricket tournaments. Every match is played between two teams. Each team has eleven players. When the first team bats, the second team bowls. The second team’s aim is to get more score/runs than the first team and the first team’s aim is to defend their score. Each team can bat either until the end of 20 overs or until they lose 10 wickets. 6 balls are bowled every over.The possible things that can happen in any ball are dot-ball, 1 run, 2 runs, 3 runs, 4 runs, 5 runs, 6 runs, wide, no-ball, wicket. For any no-ball or a wide, 1 run is granted and the ball is not counted. Assume that these things can happen with equal probability.You are given the overs gone, the current score/wickets and the target. Find the winning probability of the chasing team.InputThe first line consists of an integer t, denoting the number of test cases. Then for the next t lines, each test case consists of three inputs. The overs, current score and the target score.OutputFor each test case output the winning probability (in percentage) of the chasing team.Note: The first two decimal places in its representation should be printed without rounding.Constraints1 <= t <= 10000.0 <= Overs <= 20.00<= Score <= 3000<= Wickets <= 10Score <= Target <= 300ExampleInput:10\r\n19.4 129/9 129\r\n20.0 100/10 100\r\n19.5 0/9 100\r\n19.5 0/0 1\r\n0.0 0/0 300\r\n0.0 0/0 200\r\n0.0 0/0 100\r\n10.0 0/0 100\r\n10.0 0/5 100\r\n13.5 112/4 222Output:100.00\r\n100.00\r\n0.00\r\n80.00\r\n18.02\r\n61.65\r\n97.60\r\n97.60\r\n55.49\r\n35.84",
  "sample_input": "Input:10\r\n19.4 129/9 129\r\n20.0 100/10 100\r\n19.5 0/9 100\r\n19.5 0/0 1\r\n0.0 0/0 300\r\n0.0 0/0 200\r\n0.0 0/0 100\r\n10.0 0/0 100\r\n10.0 0/5 100\r\n13.5 112/4 222Output:100.00\r\n100.00\r\n0.00\r\n80.00\r\n18.02\r\n61.65\r\n97.60\r\n97.60\r\n55.49\r\n35.84",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/IPL1",
  "scraped_at": "2025-08-17 00:34:05"
}