{
  "problem_code": "problems",
  "title": "Two Famous Companies",
  "tags": [],
  "text": "In China, there are two companies which offer the internet service for the people from all cities: China Telecom and China Unicom. They both are planning to build cables between cities. The government wants to connect all the cities in minimum costs of course. So the minister of finance Mr. B wants to choose some of the cable plans from the two companies and calculate the minimum cost needed to connect all the cities. Mr. B knows that there areN-1 cables should be built in order to connect allNcities of China. For some political reason, Mr. B should chooseKcables from the China Telecom and the restN-1-Kcables from the China Unicom. Your job is to help Mr. B determine which cables should be built and the minimum cost to build them. You may assume that the solution always exists.InputEach test case starts with a line containing the number of citiesN(1 ≤N≤ 50,000), number of cable plansM(N-1 ≤M≤ 100,000) and the number of required cables from China TelecomK(0 ≤K≤N-1).  This is followed byMlines, each containing four integersa,b,c,x(0 ≤a,b≤ N-1,a≠b, 1 ≤c≤ 100,x=[0,1]) indicating the pair of cities this cable will connect, the cost to build this cable and the company this cable plan belongs to.x=0 denotes this cable plan belongs to China Telecom andx=1 denotes this cable plan is from China Unicom.OutputFor each test case, display the case number and the minimum cost of the cable building plan.ExampleInput:2 2 1\r\n0 1 1 1\r\n0 1 2 0\r\n2 2 0\r\n0 1 1 1\r\n0 1 2 0Output:Case 1: 2\r\nCase 2: 1ExplanationIn the first case, there are two cable plans between the only two cities, one from China Telecom and one from China Unicom. Mr. B needs to choose the one from China Telecom to satisfy the problem requirement even the cost is higher.In the second case, Mr. B must choose the cable from China Unicom, which leads the answer to 1.",
  "sample_input": "Input:2 2 1\r\n0 1 1 1\r\n0 1 2 0\r\n2 2 0\r\n0 1 1 1\r\n0 1 2 0Output:Case 1: 2\r\nCase 2: 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/COMPANYS",
  "scraped_at": "2025-08-17 00:34:11"
}