{
  "problem_code": "problems",
  "title": "Mountain Walking",
  "tags": [],
  "text": "In this problem your task is to program a robot that will output some data about a terrain after traversing it. Input will be in the form a 2D picture containing only 4 types of characters:'/' :  Forward slash, indicating ascent.'\\' :  Backward slash, indicating descent.'_' :  Underscore, denoting horizontal plane.Additionally there will be only SPACE (Ascii value = 32) characters. (Refer to the below figure).The robot starts its journey at bottom left corner of the terrain and after traversing stops at the bottom right corner. Also note that the robot will always start and end at the SAME LEVEL.Given the picture as input you will have to output 2 things. The \"Total Walk Distance\" i.e, the total length of the path and the type of steps taken to complete the Journey. For the sake of simplification we will assume that each character ('/' , '\\' and '_') has length = 1.Now Consider the following example:_\r\n      / \\/\\\r\n     /     \\\r\n    /       \\The robot starts at the bottom left corner and takes the following path:Ascends 3 stepsMoves forward by 1 stepDescends 1 stepAscends 1 stepDescends 3 stepsand robot ends it journey at bottom right corner (At the same level). The Total Walk Distance = 9.InputFirst line of input will be an integer N (N < 20). The next line will be an empty. Then exactly N lines follow describing the terrain.You can assume the following for the input (terrain).Input will contain only four types of characters (\" \", \"_\", \"/\", \"\\\").The terrain will start and end at the same level.Each line is guaranteed to have at least one non white space character.Maximum width of any line won't be larger than 200.There will be no trailing white spaces.OutputFirst line of output should be the Total Walk Distance followed by the description of the terrain. Each line must be ONE of the followingUp xx stepsDown xx stepsWalk xx stepsWhere xx is an integer. Refer to the examples for exact specification.ExampleInput:3\r\n\r\n  /\\\r\n /  \\\r\n/    \\Output:Total Walk Distance = 6\r\nUp 3 steps\r\nDown 3 stepsInput:2\r\n _____  ___\r\n/     \\/   \\Output:Total Walk Distance = 12\r\nUp 1 steps\r\nWalk 5 steps\r\nDown 1 steps\r\nUp 1 steps\r\nWalk 3 steps\r\nDown 1 stepsInput:5\r\n\r\n        _\r\n   /\\__/ \\\r\n  /       \\\r\n /         \\/\\_\r\n/              \\Output:Total Walk Distance = 16\r\nUp 4 steps\r\nDown 1 steps\r\nWalk 2 steps\r\nUp 1 steps\r\nWalk 1 steps\r\nDown 3 steps\r\nUp 1 steps\r\nDown 1 steps\r\nWalk 1 steps\r\nDown 1 steps",
  "sample_input": "_\r\n      / \\/\\\r\n     /     \\\r\n    /       \\",
  "sample_output": "Input:3\r\n\r\n  /\\\r\n /  \\\r\n/    \\Output:Total Walk Distance = 6\r\nUp 3 steps\r\nDown 3 steps",
  "link": "https://www.spoj.com/problems/QCJ1",
  "scraped_at": "2025-08-17 00:34:06"
}