{
  "problem_code": "problems",
  "title": "The hunt for Gollum",
  "tags": [],
  "text": "Along the skirts of the Dead Marshes I followed it, and then I had him. Lurking by a stagnant mere, peering in the water as the dark eve fell, I caught him, Gollum. He was covered with green slime. He will never love me, I fear; for he bit me, and I was not gentle. Nothing more did I ever get from his mouth than the marks of his teeth.“The Lord of the Rings: The fellowship of the Ring”Hearing Gandalf’s advice, Aragorn has started hunting creature Gollum. After several days following his footprints, he has arrived to the Dead Marshes. He has a map of the marshes, that can be viewed as an M1× M2matrix containing lowercase letters form English alphabet (i.e. letters from ‘a’ to ‘z’).Being a skilled ranger, Aragorn has been able to fully characterize Gollum preferred place (if you are interested, you should know that it must be dark, wet, creepy and full of fishes!). It can be described as an N1× N2matrix containing lowercase letters form English alphabet.Your task is simple: write a program that, given Gollum’s preferred place description and Aragorn’s map, output all possible locations of the creature.Let’s look at an example: suppose Gollum’s preferred place is described by the following 3 × 3 matrix:ababababaand that Aragorn’s map looks something like this:aababaabababbababaababababababbababaabababThen your program must output the following: (1,2), (1,4), (2,1), (2,3), (5,1) and (5,3), these being the upper-left corners of all places on the Dead Marshes that match Gollum’s preferred place description. If none match is found, you should output the string “NO MATCH FOUND...” without the quotes.InputLine 1: Two integers: N1and N2.Lines 2… N1+ 1: A string with N2characters as described above.Lines N1+ 2: Two integers: M1and M2.Lines N1+ 3… N1+ M1+ 3: A string with M2characters as described above.Constraints1 ≤ N1, N2≤ 3001 ≤ M1* M2≤ 2000N1≤ M1N2≤ M2OutputOn each line print the upper-left corner of all places that match Gollum’s preferred place description on the form “(x,y)” without the quotes, where x stands for the row and y for the column. They should be lexicographically sorted, i.e. imagine them as an ordered pair. Then (x1, y1) < (x2, y2) if and only if x1< x2or, if they are equal, y1< y2.ExampleInput:3 3\r\naba\r\nbab\r\naba\r\n7 6\r\naababa\r\nababab\r\nbababa\r\nababab\r\nababab\r\nbababa\r\nabababOutput:(1,2)\r\n(1,4)\r\n(2,1)\r\n(2,3)\r\n(5,1)\r\n(5,3)",
  "sample_input": "Input:3 3\r\naba\r\nbab\r\naba\r\n7 6\r\naababa\r\nababab\r\nbababa\r\nababab\r\nababab\r\nbababa\r\nabababOutput:(1,2)\r\n(1,4)\r\n(2,1)\r\n(2,3)\r\n(5,1)\r\n(5,3)",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ARDA1",
  "scraped_at": "2025-08-17 00:34:18"
}