{
  "problem_code": "problems",
  "title": "Rock",
  "tags": [],
  "text": "Daniel enjoys watching TV series. One of his favorite is \"The Big Bang Theory\". The main characters of this series are: Sheldon – genius theoretical physicist, his friend Leonard – talented experimental physicist, their attractive, blonde neighbor Penny, and also their friends  an aerospace engineer Howard and a particle astrophysicist Rajesh.One time Rajesh tells Sheldon:“I'll tell you what. How about we go rock-paper-scissors?”“Ooh”, – Sheldon replies – “I don't think so. Anecdotal evidence suggests that in the game of rock-paper-scissors, players familiar with each other will tie 75 to 80% of the time due to the limited number of outcomes. I suggest rock-paper-scissors-lizard-Spock”.“What?”“It's very simple. Scissors cuts paper. Paper covers rock. Rock crushes lizard. Lizard poisons Spock. Spock smashes scissors. Scissors decapitates lizard. Lizard eats paper. Paper disproves Spock. Spock vaporizes rock. And as it always has, rock crushes scissors”.“Okay, I think I got it”.And the friends decided to play rock-paper-scissors-lizard-Spock. And we would determine what the probability that Rajesh beats Sheldon in this game. We know the probabilities that any of the friends choose any object in the game. Also we know that they play till two wins, so the winner of the game is the person who first wins two rounds.InputThe first line of input contains the number t - the number of tests. Next comes the description of t tests. Each test case consists of two lines. The first line contains five integers RR, RSc, RP, RL, RSp– the probabilities that Rajesh chooses rock, scissors, paper, lizard or Spock respectively. The second line contains five integers SR, SSc, SP, SL, SSp– the probabilities that Sheldon chooses rock, scissors, paper, lizard or Spock respectively. (Note:the order of the objects in the input is rock, scissors, paper, lizard, Spock. The original problem is in Russian and we have scissors before paper in Russian variant of the game. Otherwise the rules are the same.)Constraints1 <= t <= 5000 <= RR, RSc, RP, RL, RSp<= 100, RR+ RSc+ RP+ RL+ RSp= 1000 <= SR, SSc, SP, SL, SSp<= 100, SR+ SSc+ SP+ SL+ SSp= 100OutputFor each test case print the probability that Rajesh beats Sheldon in percent rounded to the nearest integer.ExampleInput:2\r\n10 20 30 40 0\r\n10 10 10 10 60\r\n20 20 20 20 20\r\n20 20 20 20 20Output:66\r\n50",
  "sample_input": "Input:2\r\n10 20 30 40 0\r\n10 10 10 10 60\r\n20 20 20 20 20\r\n20 20 20 20 20Output:66\r\n50",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RPSSL",
  "scraped_at": "2025-08-17 00:34:24"
}