{
  "problem_code": "problems",
  "title": "Point on the side of the rectangle",
  "tags": [],
  "text": "EnglishVietnameseThe government is planning to build a walkway for tourists in the middle of an oak forest. The forest can be represented as plane with N special lattice points representing oaks. The walkway is represented as a rectangle with sides parallel to the axes. If the sides of walkway rectangle intersect any oak lattice points, such oaks need to be axed down.Oaks inside the rectangle do not represent problems and need not be cut down. Ljubo is the state secretary of Forestry and an passionate nature lover, so he ordered the secretary of Tourism to provide him with a list of P possible rectangle walkways that are attractive enough to draw in tourists.Ljubo plans to select the walkway that needs the smallest amount of oak trees to be cut down.Since we also like trees, would you be so kind and write a program that will determine the number of oaks that will be cut down for each walkway. Remember only the oaks intersecting the sides ofthe rectangle need to be cut.InputThe first line of input contains one integer N (1 ≤ N ≤ 300 000), number of oaks.The next N lines contain two integers each Xi Yi (1 ≤ X, Y ≤ 109) coordinates of oaks. There will be at most one oak on each lattice point.The next line contains one integer P (1 ≤ P ≤ 100 000), number of walkways.The next P lines contain four integers each X1, Y1, X2, Y2 (1 ≤ X1 < X2 ≤ 109, 1 ≤ Y1 < Y2 ≤ 109), the coordinates of the lower left (X1, Y1) and upper right (X2, Y2) corner of the rectangle.OutputOutput P integers, one per line, the number of oaks that need to be cut down for each walkway in the\r\norder they are presented in the input.SampleInput:6\r\n1 2\r\n3 2\r\n2 3\r\n2 5\r\n4 4\r\n6 3\r\n4\r\n2 2 4 4\r\n2 2 6 5\r\n3 3 5 6\r\n5 1 6 6Output:3\r\n4\r\n0\r\n1",
  "sample_input": "Input:6\r\n1 2\r\n3 2\r\n2 3\r\n2 5\r\n4 4\r\n6 3\r\n4\r\n2 2 4 4\r\n2 2 6 5\r\n3 3 5 6\r\n5 1 6 6Output:3\r\n4\r\n0\r\n1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MRECT1",
  "scraped_at": "2025-08-17 00:34:02"
}