{
  "problem_code": "problems",
  "title": "Load Testing",
  "tags": [],
  "text": "Now that you have won Code Jam and been hired by Google as a software engineer, you have been assigned to work on their wildly popular programming contest website.Google is expecting a lot of participants (P) in Code Jam next year, and they want to make sure that the site can support that many people at the same time. During Code Jam 2010 you learned that the site could support at leastLpeople at a time without any errors, but you also know that the site can't yet supportPpeople.To determine how many more machines you'll need, you want to know within a factor ofChow many people the site can support. This means that there is an integerasuch that you know the site can supportapeople, but you know the site can't supporta*Cpeople.You can run a series ofload tests, each of which will determine whether the site can support at leastXpeople for some integer value ofXthat you choose. If you pick an optimal strategy, choosing what tests to run based on the results of previous tests, how many load tests do you need in the worst case?InputThe first line of the input gives the number of test cases,T.Tlines follow, each of which contains space-separated integersL,PandCin that order.OutputFor each test case, output one line containing \"Case #x: y\", where x is the case number (starting from 1) and y is the number of load tests you need to run in the worst case before knowing within a factor ofChow many people the site can support.Limits1 ≤T≤ 1000.2 ≤C≤ 10.L,PandCare all integers.Small dataset1 ≤L<P≤ 103.Large dataset1 ≤L<P≤ 109.ExampleInput:4\r\n50 700 2\r\n19 57 3\r\n1 1000 2\r\n24 97 2Output:Case #1: 2\r\nCase #2: 0\r\nCase #3: 4\r\nCase #4: 2ExplanationIn Case #2, we already know that the site can support between 19 and 57 people. Since those are a factor of 3 apart, we don't need to do any testing.In Case #4, we can test 48; but if the site can support 48 people, we need more testing, because 48 * 2 < 97. We could test 49; but if the site can't support 49 people, we need more testing, because 24 * 2 < 49. So we need two tests.",
  "sample_input": "Input:4\r\n50 700 2\r\n19 57 3\r\n1 1000 2\r\n24 97 2Output:Case #1: 2\r\nCase #2: 0\r\nCase #3: 4\r\nCase #4: 2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/GCJ101C",
  "scraped_at": "2025-08-17 00:34:00"
}