{
  "problem_code": "problems",
  "title": "Long Tiling",
  "tags": [],
  "text": "There is a long gap with fixed width of 1 unit in the ground withN + 1vertices, which is composed ofNsegments with same width. A segment connects to at most one segment on its head and tail vertically or horizontally, that is, it can connect to at most two segments. The long gap formed by those segments is simply a open polyline. Duck doesn't like the gap, he is given a set of tiles and wants to know if the long gap can be tiled by the limited number of tiles. There areMdistinct tiles, each withKiand hasCisegments. It is not necessary to use all tiles, and Duck can rotate the tile to fill the gap. It is guaranteed that both long gap and tiles are open polyline with fixed width of 1 unit. Can you help him check if he is possible to do so.InputThe first line is the number of test casesT. (1 ≤ T ≤ 25)For each test case, it starts with the number of segments of the long gapN. (1 ≤ N ≤ 20)Following N lines, each consisting of one uppercase characterW1i, either up (U), down(D), left(L) or right(R), and one integerF1i, indicating the direction to turn to and the length of that segment. (1 ≤ ∑ni=1F1i≤ 100)Next line is the number of distinct tilesM. (1 ≤ M ≤ 15)For each distinct tile, it starts with two integers, the available amount of that tileKiand number of segmentsCi. (1 ≤ Ki, ∑Mi=1Ki≤ 15, 1 ≤ Ci≤ 20)Following Cilines, same as above, one uppercase characterW2iand one integerF2iindicating the direction and the length of that segment.OutputIf it is possible to tile the gap with given tiles, print \"YES\", else \"NO\". (without quotes)ExampleInput:2\r\n16\r\nL 4\r\nU 2\r\nL 7\r\nU 2\r\nL 4\r\nD 4\r\nR 2\r\nD 2\r\nL 3\r\nD 2\r\nR 6\r\nU 1\r\nR 2\r\nD 4\r\nL 3\r\nU 1\r\n7\r\n2 5\r\nD 6\r\nL 2\r\nU 3\r\nL 2\r\nD 2\r\n1 2\r\nD 7\r\nL 2\r\n2 2\r\nD 2\r\nR 2\r\n1 1\r\nR 8\r\n3 1\r\nU 3\r\n4 1\r\nD 4\r\n2 2\r\nR 3\r\nU 1\r\n\r\n2\r\nR 6\r\nU 2\r\n2\r\n1 2\r\nD 3\r\nL 2\r\n1 1\r\nU 2Output:YES\r\nNOExplanation",
  "sample_input": "Input:2\r\n16\r\nL 4\r\nU 2\r\nL 7\r\nU 2\r\nL 4\r\nD 4\r\nR 2\r\nD 2\r\nL 3\r\nD 2\r\nR 6\r\nU 1\r\nR 2\r\nD 4\r\nL 3\r\nU 1\r\n7\r\n2 5\r\nD 6\r\nL 2\r\nU 3\r\nL 2\r\nD 2\r\n1 2\r\nD 7\r\nL 2\r\n2 2\r\nD 2\r\nR 2\r\n1 1\r\nR 8\r\n3 1\r\nU 3\r\n4 1\r\nD 4\r\n2 2\r\nR 3\r\nU 1\r\n\r\n2\r\nR 6\r\nU 2\r\n2\r\n1 2\r\nD 3\r\nL 2\r\n1 1\r\nU 2Output:YES\r\nNO",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LNTILING",
  "scraped_at": "2025-08-17 00:33:59"
}