{
  "problem_code": "problems",
  "title": "Earth Sled Tour",
  "tags": [],
  "text": "So it's Christmas! And Santa Claus needs to perform a series of deliveries of gifts in different locations around the world.For those who do not know, the reindeers are sick and he will need to use the gas-powered thunder to deliver the presents.A curious fact is that the roads between cities are perfectly straight and there is a gas station in each city. Santa Claus is a very smart guy and, to avoid problems, he fills the tank with a specific value X is the value of the largest road between the cities that Santa is traveling, so he knows that he will never run out of gas between the two cities and the gifts will not be stolen. In addition, it always selects the path where the largest road is as minimum as possible.Can you help the Santa Claus determine what X value of gas he should use?InputThe first line is composed of two integers N (1 ≤ N ≤ 105) and M (N−1 ≤ M ≤ min(2×105, N×(N−1)/2)) is the number of cities and the number of roads. Next come M lines with three integers u, v, w (u ≠ v) (0 ≤ u, v < N) (1 ≤ w ≤ 106), that there is a road connecting it with weight (you can use the road in any direction). After M lines, has an integer Q\r\n(1 ≤ Q ≤ 105) is the number of queries that Santa Claus will perform. Each of Q lines is composed of two integers x and y (0 ≤ x, y < N) corresponds to the query: how much X gasoline that Santa Claus will need to supply in every city between the cities x and y.OutputPrint Q lines each with an integer X is the answer of the dilemma what Santa Claus is passed.ExampleInput:7 11\r\n0 1 15\r\n0 2 53\r\n1 2 40\r\n1 3 46\r\n2 4 31\r\n2 5 29\r\n3 4 3\r\n4 5 29\r\n3 6 11\r\n4 6 8\r\n5 6 40\r\n7\r\n0 1\r\n0 3\r\n0 6\r\n2 4\r\n4 6\r\n5 1\r\n1 1Output:15\r\n40\r\n40\r\n29\r\n8\r\n40\r\n0",
  "sample_input": "Input:7 11\r\n0 1 15\r\n0 2 53\r\n1 2 40\r\n1 3 46\r\n2 4 31\r\n2 5 29\r\n3 4 3\r\n4 5 29\r\n3 6 11\r\n4 6 8\r\n5 6 40\r\n7\r\n0 1\r\n0 3\r\n0 6\r\n2 4\r\n4 6\r\n5 1\r\n1 1Output:15\r\n40\r\n40\r\n29\r\n8\r\n40\r\n0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CNURI18H",
  "scraped_at": "2025-08-17 00:34:11"
}