{
  "problem_code": "problems",
  "title": "Line Follower Robot",
  "tags": [],
  "text": "In this Years RoboFest in IUT (International University Of Technology) there a segment called LFR contest. An LFR contest is a contest where the robots have to follow a specific line. The track was bound by a inner and a outer polygon. More clearly the space between the two polygon was track. Now, to make the contest easier, the authority created glass walls along with the lines of the polygons so that no robot gets out of the track. There is a rule that all the robots have to be circular. Given the coordinates of the points of both polygon in consecutive order, Find the biggest diameter possible for a robot so that it does not get stuck anywhere in the track. (Does not get stuck between walls.InputFirst line of the input contains 0 < t < 101, number of test cases.Then in the next t test cases:Each test case starts with a number 2 < Ni< 101, number of points of the inner polygon.Then next Nilines contains two integer each, Xi, Yidenoting coordinates of the point in inner polygon.Then comes a number 2 < No< 101 Number of points in the outer polygon.Then next Nolines contains two integer each, Xi, Yidenoting coordinates of the point in the outer polygon.All coordinates have absolute value no larger than 1000. The points of the polygons can be given in either clockwise or counterclockwise order and the two polygons do not intersect or touch themselves or each other. The outer polygon encloses the inner polygon.OutputFor each testcase on a new line print a floating point number rounded to 6 digits denoting the maximal diameter possible for the robot.ExampleInput:2\r\n4\r\n-5 -5\r\n5 -5\r\n5 5\r\n-5 5\r\n4\r\n-10 -10\r\n-10 10\r\n10 10\r\n10 -10\r\n3\r\n0 0\r\n1 0\r\n1 1\r\n5\r\n3 -3\r\n3 3\r\n-4 2\r\n-1 -1\r\n-2 -2Output:5.000000\r\n1.414214",
  "sample_input": "Input:2\r\n4\r\n-5 -5\r\n5 -5\r\n5 5\r\n-5 5\r\n4\r\n-10 -10\r\n-10 10\r\n10 10\r\n10 -10\r\n3\r\n0 0\r\n1 0\r\n1 1\r\n5\r\n3 -3\r\n3 3\r\n-4 2\r\n-1 -1\r\n-2 -2Output:5.000000\r\n1.414214",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ILOVEGEO",
  "scraped_at": "2025-08-17 00:33:54"
}