{
  "problem_code": "problems",
  "title": "Smallest on the Stack",
  "tags": [],
  "text": "Every Christmas the good old man can go to every  house in the world and leave gifts for the children who have been good  throughout the year, but this is only possible because of his magic gift  bag. It would be impossible for Santa to carry all the presents in his  bag, the volume and weight of them all makes this obviously unfeasible.  What actually happens is that your bag is a kind of magical portal to  your gift factory at the North Pole. Where the presents are stacked by  their elves and Noel always takes the gift from the top of that pile  when he accesses his magical bag.Gifts have a numerical measure of the degree of fun  they can provide children, and Santa is always concerned with the least  fun gift he will deliver throughout the night because he does not want  any child to feel bad about it. you receive. However, this can not be  done in advance because throughout the night as the good old man takes  gifts from the pile to deliver, others are still being made and placed  on the pile. So the most he can know is the value of the least fun  present on the stack up to that point.Your task is, given the sequence of operations done  on the stack of gifts, answer Santa's queries about the value of the  least entertaining gift on the stack thus far.InputThe first line of the input contains an integerN(1 ≤N≤ 106) corresponding to the number of operations performed on the present stack. The operations can be of three types: \"PUSHV\" whereV(1 ≤V≤ 109) is an integer representing the degree of fun of the present being placed on the stack; \"POP\" which represents that Santa Claus is taking a gift from the cell to deliver and \"MIN\" representing a Noel query to know the smallest gift value in the stack.OutputThe output consists of a line containing an integer with the smallest  present value in the stack for queries of type \"MIN\" or \"EMPTY\" for  \"MIN\" and \"POP\" operations when the stack is empty.ExampleInput:11\r\nPUSH 5\r\nPUSH 7\r\nPUSH 3\r\nPUSH 8\r\nPUSH 10\r\nMIN\r\nPOP\r\nPOP\r\nMIN\r\nPOP\r\nMINOutput:3\r\n3\r\n5ExampleInput:9\r\nPUSH 100\r\nPUSH 50\r\nMIN\r\nPUSH 45\r\nMIN\r\nPOP\r\nMIN\r\nPOP\r\nMINOutput:50\r\n45\r\n50\r\n100",
  "sample_input": "Input:11\r\nPUSH 5\r\nPUSH 7\r\nPUSH 3\r\nPUSH 8\r\nPUSH 10\r\nMIN\r\nPOP\r\nPOP\r\nMIN\r\nPOP\r\nMINOutput:3\r\n3\r\n5",
  "sample_output": "Input:9\r\nPUSH 100\r\nPUSH 50\r\nMIN\r\nPUSH 45\r\nMIN\r\nPOP\r\nMIN\r\nPOP\r\nMINOutput:50\r\n45\r\n50\r\n100",
  "link": "https://www.spoj.com/problems/MINSTACK",
  "scraped_at": "2025-08-17 00:34:08"
}