{
  "problem_code": "problems",
  "title": "Full Sleigh",
  "tags": [],
  "text": "It's Christmas Eve, and it's almost time for the sled to leave.  Everything is already in Santa's sack and the reindeers in position,  there is only one thing left: decide which helpers will work with Noel  this year. Yes, contrary to popular belief, the good old man does not do  everything himself. He always takes with him a group of elves on his  round the world in one night.However, the elves must be chosen carefully, because their weight  will directly affect the aerodynamics of the Sled. If it is very light  it will swing very much during the flight and if it is very heavy it  will tire the reindeers very early.As it is in hurry Noel decided to make a try and chose a group of  helpers. But the Reindeers soon accused them of being too light. Then  Noel made a second attempt, chose another group. But again the Reindeers  complained, however, stating that it was now too heavy. The good old  man, who has an appointment time, became irritated and gave an ultimatum  to his subordinates: \"That's enough! ChooseKelves  soon to go in such a way that the sled is neither too light nor too  heavy! That is, the sum of the weights can not be less than the sum of  first group that I tried and neither greater than the second one. And do it fast!\".Of course the little ones despaired. Apart from the restriction  of weights and now the number of Elves that have to be exact, they still  have the fact that each Elf weighs twice as much or more than an Elf  younger than him. Which obviously only complicates everything.Knowing that all Elves are of different ages can you help these  little ones tell how many ways they can choose a group to go with Santa  respecting all the requirements?InputThe first line of the entry contains an integerTthat represents the number of test cases. Then there areTtest cases. The first line of a test case contains two integersN(1 ≤N≤ 50) andK(1 ≤K≤ 50) respectively representing the total number of Elves and the  determined number of Elves to be boarded on the sled. The second line of  a test case containsNintegersPi(1 ≤Pi≤ 1018) representing the weight in mg of the Elves. The third and last line of a test case contains two integersAandB(0 ≤A≤B≤ 1019) representing respectively the weight of the lighter group tested and the weight of the heaviest group tested. Both in mg.OutputThe output is composed of one line per test case containing an integer  representing the number of ways to choose a group according to  requirements.ExampleInput:3\r\n3 2\r\n10 1 3\r\n4 13\r\n4 3\r\n20 10 50 1\r\n21 81\r\n6 3\r\n14 70 3 1 6 31\r\n10 74Output:3\r\n4\r\n11",
  "sample_input": "Input:3\r\n3 2\r\n10 1 3\r\n4 13\r\n4 3\r\n20 10 50 1\r\n21 81\r\n6 3\r\n14 70 3 1 6 31\r\n10 74Output:3\r\n4\r\n11",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TRENOLOT",
  "scraped_at": "2025-08-17 00:33:54"
}