{
  "problem_code": "problems",
  "title": "Prismata",
  "tags": [],
  "text": "Mariusz and Pawel are playing a Prismata game. After many turns the situation is as follows. Pawel has:one Gauss Fabricator, withfhhealth, which will produce one Gauss Cannon per turn for the nextflturnsgGauss Cannons, each Gauss Cannon hasghhealthMariusz hastTarsiers. Each Tarsier has one health. The Gauss Cannon and the Tarsier are the units with one attack. This means that the unit inflicts one damage per turn on a one of the opponent's units. A unit that has lost all its health is immediately destroyed. A unit which has only lost part of its health remains fully operational.A single turn in Prismata goes like below:Mariusz attacks. Mariusz decides how many Tarsiers attack the Gauss Fabricator and how many attack the Gauss Cannons. The same Gauss Cannon can be attacked by more than one Tarsier.Pawel attacks. If Pawel hasnGauss Cannons, then Pawel destroysnMariusz's Tarsiers (Pawel does not make any decisions).If the Gauss Fabricator has not yet been destroyed, then it produces one Gauss Cannon withghhealth. Independently of the remaining health, the Gauss Fabricator is destroyed after producingflGauss Cannons. Pawel can start attacking with the new Gauss Cannon in the next turn.The player who destroys all the opponent's units wins.Your task is to help Mariusz to find out whether he can win the game and calculate the minimum number of turns needed for the victory.InputThe first line contains the number of testsT (1 ≤ T ≤ 10). Each of theTnext lines contains one test. A single test consists of:fh(1 ≤ fh≤ 1000000)- the health of the Gauss Fabricatorfl(1 ≤ fl≤ 1000000)- the maximum number of Gauss Cannons produced by the Gauss Fabricatorgh(1 ≤ gh≤ 1000)- the health of a single Gauss Cannong (0 ≤ g ≤ 1000000)- the initial number of Gauss Cannonst (1 ≤ t ≤1000000)- the initial number of TarsiersOutputFor each test your program should output:\"PAWEL\" if Mariusz is unable to win the game\"MARIUSZ t\" if Mariusz can win the game andtis the minimum number of turns needed for the victoryExampleInput:3\r\n5 100 2 5 7\r\n100 3 10 0 8\r\n100 1 60 0 10Output:MARIUSZ 4\r\nMARIUSZ 6\r\nPAWELExplanation of the sample testsTest 1: If left alone, the Gauss Fabricator will produce too many cannons. Therefore Mariusz has to destroy it. One of the possible way for Mariusz to win is:Turn #1: Mariusz: 7 Tarsiers, Pawel: 5 Gauss Cannons (each with 2 health), the Gauss Fabricator has 5 healthMariusz destroys 3 cannons and inflicts one damage on one of the remaining cannons.Pawel has 2 cannons. He destroys 2 Tarsiers.The Gauss Fabricator produces one cannon.Turn #2: Mariusz: 5 Tarsiers, Pawel: 3 Gauss Cannons (2 Gauss Cannons with 2 health, one Gauss Cannon with 1 health), the Gauss Fabricator has 5 healthMariusz destroys all 3 cannons.Pawel hasn't got any cannons, all Tarsiers remain.The Gauss Fabricator produces one cannon.Turn #3: Mariusz: 5 Tarsiers, Pawel: 1 Gauss Cannon with 2 health, the Gauss Fabricator has 5 healthMariusz destroys one cannon and inflicts 3 damage on the Gauss Fabricator.Pawel hasn't got any cannons, all Tarsiers remain.The Gauss Fabricator produces one cannon.Turn #4: Mariusz: 5 Tarsiers, Pawel: 1 Gauss Cannon with 2 health, the Gauss Fabricator has 2 healthMariusz destroys one cannon and the Gauss Fabricator.Test 2: In this test the Gauss Fabricator has a lot of health but will produce only few cannons. Mariusz should attack only the cannons and wait for the Gauss Fabricator to be destroyed after 3 turns.Test 3: Even though the Gauss Fabricator will produce only one cannon, the health of this cannon is too high for Mariusz to win.",
  "sample_input": "Input:3\r\n5 100 2 5 7\r\n100 3 10 0 8\r\n100 1 60 0 10Output:MARIUSZ 4\r\nMARIUSZ 6\r\nPAWEL",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PRISMATA",
  "scraped_at": "2025-08-17 00:34:10"
}