{
  "problem_code": "problems",
  "title": "Plant the potatoes",
  "tags": [],
  "text": "You have a sack ofnpotatoes and a strip of land(n+ 1) ⋅kcentimeters long.You want to evenly plant the potatoes on this strip. If we mark the beginning of the strip as centimeter0, then you want to plant the first potato at centimeterk, plant the second potato at centimeter2k,..., plant then-th potato at centimeternk(and then the strip of land ends at(n+ 1) ⋅kcentimeters).Each potato has a growth rangeri. This means that if you plant the potato at centimeterx, and it has enough space, it will grow you some new tasty potatoes all across[x−ri,x+ri].However, a potato will never grow over another potato's growth territory, or beyond your strip of land - in other words, if the potato comes across the edge of the plot or bumps into a different potato plant, it stops growing in that direction.Givenn,kandriof yournpotatoes, how many potatoes can you grow if you plant them optimally?InputThe first line contains an integer1 ≤T≤ 20- the number of test cases.Ttest cases follow.For each test case:The first line contains the integers1 ≤n≤ 106and1 ≤k≤ 109. The second line containsnintegers1 ≤ri≤k- the growth radii of the potatoes.The sum ofnwithin an input file will never exceed2 ⋅ 106.OutputFor each test case, output a single integer: the maximum length of strip you can cover in grown potatoes.ExamplesInput3\r\n3 20\r\n6 12 4\r\n3 20\r\n12 12 12\r\n3 5\r\n1 1 5Output44\r\n64\r\n13In the first case, if we plant the potatoes in the same order as in the input, that is 6->20cm, 12->40cm, 4->60cm, they will grow on [14,26], [28,52], [56,64] for a total of 12+24+8 = 44 cm of potatoes. Any other order works just as well, though.In the second case we don't really have much to choose from.. The potatoes would want to grow out to [8,32], [28,52], [48,72], but they get in each other's way. So they will end up growing on [8,30], [30,50], [50,72] for a total of 64cm.In the last case the best order to plant the potatoes is, for example, 5 1 1.",
  "sample_input": "3\r\n3 20\r\n6 12 4\r\n3 20\r\n12 12 12\r\n3 5\r\n1 1 5",
  "sample_output": "44\r\n64\r\n13",
  "link": "https://www.spoj.com/problems/POTATOPL",
  "scraped_at": "2025-08-17 00:34:01"
}