{
  "problem_code": "problems",
  "title": "Ono at the river 1",
  "tags": [],
  "text": "Oňo the grasshopper wants to cross the river. But the river is very wide –wmeters from one bank to the other, and Oňo can only jump up todmeters at once. Fortunately, there arenlily pads growing in the river. They’re not big enough yet, but once they are adult, they will be able to hold Oňo’s weight.Thei-th lily pad is locatedmimeters away from the left bank, where Oňo is right now. It will become able to support Oňosiseconds from now. Buteiseconds from now it will become too old and die.Oňo is very fast and he can perform multiple jumps (each up todmeters) in a single second – every jump is practically instant. But he is still nervous. If he doesn’t plan things through, he could end up jumping across some lily pads only to find out there is no way forward, and now the lily pads behind him are gone and he can’t even get back! Oh, the horror! To prevent this, Oňo will only jump across the lily pads when he can immediately get from one side of the river to the other without stopping.It would be great if someone wrote a program telling him at what time he can do so, and the total time that the river is crossable.TaskEach lily pad has a timesiwhen it turns adult and a timeeiwhen it dies; it can hold Oňo from thesi-th to theei-th second. The lily pad is locatedmimeters from the left bank of the river.Find the earliest time that Oňo can cross the river without stopping, and also how many seconds there are such that he is able to do so.Note that Oňo is not brave enough to jump from a lily pad which grows old at timetto a lily pad which becomes adult at the same timet- in other words, you may imagine that at the beginning of each second, first the appropriate lily pads die and then the appropriate lily pads become adult.InputThe first line contains an integer1 ≤ T ≤ 3- the number of test cases. The only input file withT > 1is the sample shown below.Ttest cases follow, each ends with a blank line.The first line contains three integersn,wandd- the number of lily pads, the width of the river, and Oňo’s jump distance, where1 ≤n≤ 500 000and1 ≤d<w≤ 109.nlines will follow, each containing three integersmisieidescribing one lily pad: its distance in meters from the left bank, the time it turns adult, and the time it grows old.0 <mi<wand1 ≤si<ei≤ 1015.No two lily pads with the same positionmiwill be alive at the same time, in particular if any two lily pads have the samemi, one will die at least a second before the other becomes adult.OutputFor each test case, output two integerseandtin a single line, whereeis the earliest time at which Oňo can jump all the way from the left to the right bank of the river without stopping, andtis the total number of seconds during which he can do so (not necessarily continuously frome).If Oňo can never cross the river, printeas−1.ExamplesInput:3\r\n7 60 10\r\n10 1 10\r\n20 1 7\r\n20 8 11\r\n40 1 20\r\n50 4 15\r\n30 5 12\r\n30 1 3\r\n\r\n2 100 80\r\n1 1 5\r\n81 5 123\r\n\r\n20 5 1\r\n1 1 189\r\n2 1 2\r\n3 1 2\r\n4 1 2\r\n2 109 189\r\n3 109 189\r\n4 109 323\r\n1 281 462\r\n2 281 323\r\n3 281 323\r\n2 337 743\r\n3 337 462\r\n4 337 462\r\n1 616 743\r\n3 616 743\r\n4 616 1016\r\n1 874 1327\r\n2 874 1327\r\n3 874 1327\r\n4 1163 1327Output:5 4\r\n-1 0\r\n1 681In the first case, at time 5, the first, second, fourth, fifth, and sixth lillies are alive, and Oňo can jump across. He can do so until the 7th second for a total of 2 seconds, when the second lily pad dies, then again from the 8th second to the 10th second, after which the first lily pad dies and the river becomes uncrossable forever.In the second case the lily pads just barely miss themselves, and Oňo can never get across.",
  "sample_input": "3\r\n7 60 10\r\n10 1 10\r\n20 1 7\r\n20 8 11\r\n40 1 20\r\n50 4 15\r\n30 5 12\r\n30 1 3\r\n\r\n2 100 80\r\n1 1 5\r\n81 5 123\r\n\r\n20 5 1\r\n1 1 189\r\n2 1 2\r\n3 1 2\r\n4 1 2\r\n2 109 189\r\n3 109 189\r\n4 109 323\r\n1 281 462\r\n2 281 323\r\n3 281 323\r\n2 337 743\r\n3 337 462\r\n4 337 462\r\n1 616 743\r\n3 616 743\r\n4 616 1016\r\n1 874 1327\r\n2 874 1327\r\n3 874 1327\r\n4 1163 1327",
  "sample_output": "5 4\r\n-1 0\r\n1 681",
  "link": "https://www.spoj.com/problems/ONORIVER1",
  "scraped_at": "2025-08-17 00:34:05"
}