{
  "problem_code": "problems",
  "title": "Machine Cooling II",
  "tags": [],
  "text": "Duck is a busy guy who hasNtasks to do in a single day, each task has four sub tasks. The i-th task is scheduled at theSisecond starting from 00:00:00, for example, 65 is 00:01:05 and 82800 is 23:00:00, and its j-th sub task requiresDi,jseconds to complete. That is, the j-th sub task of i-th task ends at Si+ Di,jsecond. Duck plans to buy some machines to help him complete the tasks automatically. One machine can only deal with one task at the same time, but can deal with all four sub tasks simultaneously. Therefore, if any of the sub tasks of that task is not finished, the machine cannot deal with next task. If the whole task is finished, it can deal with the next task immediately without waiting.However, Duck doesn't want that happens because he wants the machines to be more durable. He wants to maximize the cooling time of each machine whenever it completes a task. Given that the maximum cooling time of each machine is 86400, no matters at what second a machine completes a task, but the cooling time must be the same for all machines. What is the maximum cooling time that every machine can have if Duck uses as few machines as possible to complete all tasks by distributing it optimally?InputThe first line is the number of test casesT. (1 ≤ T ≤ 20)For each test case, it starts with the number of tasksN. (1 ≤ N ≤ 100)Following N lines, each consisting of five integers: the second counting from 00:00:00 that the i-th task is scheduled atSi, the seconds required to complete the j-th sub taskD1,D2,D3,D4. (1 ≤ Si≤ 86399, 1 ≤ Di,j≤ 86400 - Si)OutputOutput the maximum cooling time that every machine can have.ExampleInput:2\r\n6\r\n39999 7643 9987 13924 694\r\n2000 3100 3804 2010 1999\r\n4900 15238 28098 27777 27777\r\n28813 11186 15742 886 20016\r\n70000 200 300 400 500\r\n51234 3555 30 7000 24567\r\n3\r\n52024 10000 7321 8864 20\r\n62024 7321 10000 20 8864\r\n72024 20 8864 10000 7321Output:2405\r\n0ExplanationIn case 1, Duck needs two machines for task {2, 4, 6} and {1, 3, 5}, the answer is then 2405 choosing the cooling time of 2405 and 7322.In case 2, one machine is enough but there is no gap between each task.",
  "sample_input": "Input:2\r\n6\r\n39999 7643 9987 13924 694\r\n2000 3100 3804 2010 1999\r\n4900 15238 28098 27777 27777\r\n28813 11186 15742 886 20016\r\n70000 200 300 400 500\r\n51234 3555 30 7000 24567\r\n3\r\n52024 10000 7321 8864 20\r\n62024 7321 10000 20 8864\r\n72024 20 8864 10000 7321Output:2405\r\n0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MACHCOOL2",
  "scraped_at": "2025-08-17 00:34:11"
}