{
  "problem_code": "problems",
  "title": "Heroes",
  "tags": [],
  "text": "Heroes... ugh...My plan to destroy the world was almost finished, but now heroes have gathered in their last attempt to save the earth (which, as everybody knows, is pretty flat). Heroes formed a defensiveN×Mgrid, each of the N × M heroes stands in one position of the grid. Also, the hero in positioni, jhas hijlife points.Of course, they stand no chance against my wrath. I'll attack them withQspells, the i-th spell will have power piand will attack the submatrix with corners (r1i, c1i) and (r2i, c2i). Heroes can decide how to distribute the power of the spell over the heroes in the attacked submatrix, so, for each spell, each hero of the submatrix will decrease his life points by a number of integer points (possibly zero), such that between all the heroes of the submatrix take all the pipoints of damage. Of course, a hero can only take more damage if his life is greater than zero. Note that the damage they receive will accumulate over all the Q spells.If heroes cannot receive the damage points of a spell, my spell will reach the (flat) earth and immediately destroy it.Assuming heroes know the sequence of spells I'll use, can they save the earth if they work optimally?InputIn the first line, two integers, N and M, the number of rows and columns in the grid.Next N lines, each one contains M integers hij, the initial life points of each hero.Then a line with integer Q, the number of spells.Then follow Q lines, each with 5 integers: r1i, c1i, r2i, c2i, pi.OutputPrint ”BOOM!” (without quotes) if the earth is destroyed, print ”ugh” (without quotes) otherwise.ExampleInput:2 3\r\n2 1 3\r\n2 4 4\r\n2\r\n1 1 2 2 7\r\n1 2 2 3 9Output:ughInput:2 3\r\n2 1 3\r\n2 4 4\r\n2\r\n1 1 2 2 7\r\n1 2 2 3 10Output:BOOM!Constraints1 ≤ N ≤ 101 ≤ M ≤ 100001 ≤ Q ≤ 5001 ≤ r1i≤ r2i≤ N1 ≤ c1i≤ c2i≤ M1 ≤ pi, hij≤ 104",
  "sample_input": "Input:2 3\r\n2 1 3\r\n2 4 4\r\n2\r\n1 1 2 2 7\r\n1 2 2 3 9Output:ughInput:2 3\r\n2 1 3\r\n2 4 4\r\n2\r\n1 1 2 2 7\r\n1 2 2 3 10Output:BOOM!",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/VZLA2019H",
  "scraped_at": "2025-08-17 00:34:10"
}