{
  "problem_code": "problems",
  "title": "Friendship",
  "tags": [],
  "text": "I live for a world full of chaos, mayhem is my dream. Sadly, friendship bonds keep the world together. This has to end.Initially, there areNpeople living in the world, and I know the strength of each one and the friendship bonds between them. A group of connected people will sum up their strengths if attacked (the power of friendship...disgusting, right?), so I'm interested in the strength of full groups of connected people, specially in the maximum strength of a group.I have already set a plan of action, the order in which I will destroy friendships! But, turns out, that when one destroys friendships, people may react and increase or decrease their strength. I need your help to find out how successful my plan is.I'll give you the initial information (strengths and bonds) and a list ofQevents, each event will be either a destruction event, or a strength change event.I need to know the maximum strength of a group after each event.InputThe first line of input consists of two integersNandM, the number of people and the initial number of bonds respectively.Next line will containNintegers s1, s2... sNseparated with exactly one white space, being sithe initial strength of the i-th person.NextMlines will contain two integers aiand bi, representing a friendship bond between those two people.The next line will contain a single integerQ, the number of events.The following Q lines will be either:1 k: Indicating the destruction of bond number k (in the input order)2 p x: Indicates that the person p changed her strength to xOutputPrint Q lines, the maximum strength of a group after each event.ExampleInput:5 6\r\n3 3 3 3 3\r\n1 2\r\n1 3\r\n2 3\r\n2 5\r\n3 4\r\n4 5\r\n5\r\n2 1 2\r\n1 5\r\n1 4\r\n2 4 8\r\n2 3 7Output:14\r\n14\r\n8\r\n11\r\n12Constraints1 ≤ N, M, Q ≤ 1051 ≤ si, xi≤ 1051 ≤ ai, bi≤ N1 ≤ ki≤ M1 ≤ pi≤ Nevery bond will be deleted at most once.between two people there is at most one bond.",
  "sample_input": "Input:5 6\r\n3 3 3 3 3\r\n1 2\r\n1 3\r\n2 3\r\n2 5\r\n3 4\r\n4 5\r\n5\r\n2 1 2\r\n1 5\r\n1 4\r\n2 4 8\r\n2 3 7Output:14\r\n14\r\n8\r\n11\r\n12",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/VZLA2019F",
  "scraped_at": "2025-08-17 00:34:06"
}