{
  "problem_code": "problems",
  "title": "Not So Blind Escape",
  "tags": [],
  "text": "Illidan Stormage, the blind Warcraft hero is thrown in a maze for punishment. Being a blind hero, he cannot see anything but he can sense which direction is North, East, South and West.Assume that the maze is laid out on aN x Mgrid, and each grid location is either blocked or free. Illidan starts from a free location at time 0, and his goal is to escape from the maze. He has four possible moves - move to North, East, South or West. Making a move to an adjacent cell takesexactly 1 unitof time. If Illidan attempts to move out of the grid or attempts to move into an obstacle, he will stay in his current location but it will still cost him 1 unit of time. There is exactly one exit in the maze, located in one of the free cells. Illidan escapesimmediatelywhenever he reaches the exit.Keep in mind that Illidan is blind, so he may get confused while making a move. To avoid all this chaos, he decided to follow a rather simple strategy. Before he starts his journey to escape the maze, he selects four real numbers:PN,PE,PSandPWdenoting the probability to move North, East, South and West respectively. No matter where he is, he will always attempt to move North with probabilityPN, East with probabilityPE, South with probabilityPS, and West with probabilityPW. At any moment, Illidan must attempt to make a move in one of these four directions. In other words, this means thatPN+ PE+ PS+ PW= 1.Illidan does not want to be stuck in the maze for too long. He has information about the maze so he knows his starting position, the location of the exit cell and all the free cells and obstacles initially. Before he attempts to escape, he would like to set the valuesPN,PE,PSandPWsuch that theexpected time for him to escape the maze is minimized.Given the description of the maze, Illidan’s starting position and the location of the exit cell, calculate the minimum expected time for Illidan to escape. You can safely assume that Ilidan’s starting cell and the exit cell willalways be connected, that is, it will be possible to reach the exit cell via some sequence of moves.InputThe first line of the input contains an integerT, denoting the number of test cases. Then the description ofTtest cases follow. The first line of every test case will start with a blank line.\r\nThe second line contains two space separated integers,NandMdenoting the number of rows and the number of columns of the grid. Each of the nextNlines will contain exactlyMcharacters on each line describing the grid. The grid will only consist of the characters.@#and*..indicates a free cell.@indicates Illidan’s starting position which is also a free cell and will occur exactly once.#denotes an obstacle.*denotes the location of the exit cell, is of course a free cell and will occur exactly once.Constraints1 ≤ T ≤ 321 ≤ N, M ≤ 8OutputFor each test case, print the expected time for Illidan to escape the maze if he chooses the probabilities optimally in a single line.Absoluteerror less than10-6will be ignored.Sample Input2\r\n\r\n1 2\r\n@*\r\n\r\n3 3\r\n@..\r\n#.#\r\n..*Sample Output1.0000000000000\r\n16.360252929211CreditsProblem name and story inspired byLightOJ 1426 - Blind EscapeOr if you prefer a blinder (easier) versionSPOJ BLINDESC - Blind Escape II",
  "sample_input": "2\r\n\r\n1 2\r\n@*\r\n\r\n3 3\r\n@..\r\n#.#\r\n..*",
  "sample_output": "1.0000000000000\r\n16.360252929211",
  "link": "https://www.spoj.com/problems/NBLINDESC",
  "scraped_at": "2025-08-17 00:34:08"
}