{
  "problem_code": "problems",
  "title": "Blind Escape II",
  "tags": [],
  "text": "Illidan Stormage, the blind Warcraft hero is thrown in a maze for punishment. Being a blind hero, he cannot see anything but he can sense which direction is North, East, South and West.Assume that the maze is laid out on a grid, and each grid location is either blocked or free or contains a demon. He has four possible moves: North, East, South, and West. Illidan starts from a free location at timet = 0, and his goal is to kill all the demons within timeT. Illidan kills a demon immediately (takes0 unitof time) whenever he lands on a grid location containing a demon, however making a move to an adjacent cell takes exactly1 unitof time. If Illidan attempts to move out of the grid or attempts to move to an obstacle, he will stay in his current location but it will still cost him1 unitof time. When Illidan kills the last demon, he isimmediatelyfreed from the maze but if he fails to kill all the demons within timeT, he will be trapped in the maze for eternity.Keep in mind that Illidan is blind, so he may get confused while making a move. To avoid all this chaos, he decides to follow a rather simple strategy. Before he starts his journey to hunt and kill all the demons, he selects four real numbers:PN,PE,PSandPWdenoting the probability to move North, East, South and West respectively. No matter where he is, he will always attempt to move North with probabilityPN, East with probabilityPE, South with probabilityPS, and West with probabilityPW.Given the description of the maze, the location of all the demons, Illidan's starting position and the probabilities of each move, calculate the probability that Illidan will be able to kill all the demons before the time runs out.Assume the grid will be of dimensionsN x Mand will containKdemons.InputThe first line of the input contains an integerQ, denoting the number of test cases. Then the description ofQtest cases follow. The first line of every test case will be a blank line.The second line contains three space separated integers,N,MandT, denoting the number of rows, the number of columns of the grid and the time by which Illidan needs to kill all the demons respectively. The third line contains four space separated real numbersPN,PE,PSandPWin that order. All these numbers will contain at most2 digitsafter the decimal point.Each of the nextNlines will contain exactlyMcharacters on each line describing the grid. The grid will only consist of the characters.@#and*..indicates a free cell.@indicates Illidan's starting position which is also a free cell and will occur exactly once.#denotes an obstacle.*denotes the location of a demon, there can be at most one demon in a cell.Constraints1 ≤ Q ≤ 51 ≤ N, M ≤ 81 ≤ T ≤ 167772161 ≤ K ≤ 3PN+ PE+ PS+ PW= 1OutputFor each test case, print the probability of Illidan escaping the maze in a single line. Error less than10-6will be ignored.ExampleInput:3\r\n\r\n1 2 3\r\n0 0.5 0 0.5\r\n@*\r\n\r\n1 8 64\r\n0 0.5 0 0.5\r\n@......*\r\n\r\n8 8 10000000\r\n0.05 0.25 0.45 0.25\r\n##....#.\r\n.##.....\r\n.*#.##..\r\n.##..*#.\r\n...###..\r\n.#.#....\r\n.#.#.#..\r\n@#.*.#..Output:0.875000000000\r\n0.693211582717\r\n0.157323987423CreditsProblem name and story inspired byLightOJ 1426 - Blind Escape.Or if you prefer a not so blind versionSPOJ NBLINDESC- Not So Blind Escape.",
  "sample_input": "Input:3\r\n\r\n1 2 3\r\n0 0.5 0 0.5\r\n@*\r\n\r\n1 8 64\r\n0 0.5 0 0.5\r\n@......*\r\n\r\n8 8 10000000\r\n0.05 0.25 0.45 0.25\r\n##....#.\r\n.##.....\r\n.*#.##..\r\n.##..*#.\r\n...###..\r\n.#.#....\r\n.#.#.#..\r\n@#.*.#..Output:0.875000000000\r\n0.693211582717\r\n0.157323987423",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BLINDESC",
  "scraped_at": "2025-08-17 00:34:05"
}