{
  "problem_code": "problems",
  "title": "Learn You a Haskell for Great Good!",
  "tags": [],
  "text": "Gus is really smart guy. He really like challenges and he wants to be the best functional programmer in the world. He knows that the best way to start is reading theLearn You a Haskell for Great Good!book. But Gus isn’t so good at making decisions, nevertheless Gus is super good making “problem resolver” friends. So, let's solve this problem and help Gus!There arenchapters in the book, the time that takes to move from the chapterito the chapter (i+1) or vice versa, is ti. The time to move from the chapter n-th to the first one, or vice versa, is tn(yes, Gus sometimes is weird and starts to read from the end of the book). Also, all the chapters have different difficulty for Gus. The difficulty of the i-th chapter is di.Gus tries to read some chapters each day in the morning. He does the following steps each morning:He chooses two different chapters i and j.He starts to read the first selected chapter.When he finished the first chapter he moves to the next chapter (in one of the two possible directions).He reads all chapters between i and j i.e. (i, i + 1 ... j) or (i, i − 1 ... j)But Marcos is a competitive person and he wants to be the best functional programmer too. So each day in the morning he takes away some consecutive chapters of Gus’s book and he puts them back in the night. Gus can't stand the disorder, so he can't read the chapters in a non-consecutive order (remember that for Gus the consecutive of the chapter i is the chapter i+1 or the chapter i-1).If the two chapters that Gus chooses are x-th and y-th, we can estimate the energy the morning reading takes to him as 2 * (dx+ dy) + time(x, y). Since Marcos takes away chapters on exactly one of the two sequences connecting x and y, the time time(x, y) between chapters x and y is uniquely defined.In the i-th day Marcos will take away the chapters between aiand bi. More formally, if ai≤ bi, Marcos takes away the chapters with indices from range [ai, bi], otherwise he takes away the chapters with indices from [ai, n] ∪ [1, bi].Please help Gus to decide which two chapters he should choose in order to consume the most energy.InputThe first line contains two integer n and m, denoting number of chapters and number of days, respectively.The second line contains n integers t1, t2... tn, the time between consecutive chapters.The third line contains n integers d1, d2... dn, the difficulty of chapters.Each of following m lines contains two integers aiand bidescribing each new day. There are always at least two different chapters Gus can choose that are not affected by Marcos.OutputFor each day print the answer in a separate line.ExampleInput:3 3\r\n5 1 4\r\n5 1 4\r\n3 3\r\n2 2\r\n1 1Output:17\r\n22\r\n11Constraints(3 ≤ n ≤ 105, 1 ≤ m ≤ 105)t1, t2... tn(1 ≤ ti≤ 109)d1, d2... dn(1 ≤ di≤ 109)aiand bi(1 ≤ ai, bi≤ n)",
  "sample_input": "Input:3 3\r\n5 1 4\r\n5 1 4\r\n3 3\r\n2 2\r\n1 1Output:17\r\n22\r\n11",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/VZLA2019L",
  "scraped_at": "2025-08-17 00:34:13"
}