{
  "problem_code": "problems",
  "title": "GOOD COMMUNICATION",
  "tags": [],
  "text": "Binary Representation of a number represents a point (vertex) in the N-th dimensional hyper-cube (N is the number of bits used to represent the number in binary form). Eg. point 3 (011) and 5 (101) are shown in 3-dimensional cube in the figure. As the value of points increases, number of axes to represent it in the hyper-cube increases.Given an N-th dimensional hyper-cube and an array (of size n) of selected points from the cube. We select its complementary point from the cube. We call communication between these points \"GOOD\" if the distance between given point and its complementary point is maximum. Distance between two points is defined as the bitwise XOR of two points. Let this complementary point be M. The cost of building communication between them is given byCost = 2n; where n is position of unset bit which is at farthest distance from MSB in MTo decrease the cost we have two operations:Type1: ' q l r ' :- we select two positions l and r from the array. Output the point from the array, between the smaller and larger position being selected, which has minimum cost of building the communication. In case there are multiple answers, print the point with minimum value.Type2: ' u x y ' :- update the point at index x with value y.NOTE:- ' l r x ' are according to 1-based indexing (1 ≤ l, r, x ≤ n)Constraints1 ≤ T ≤ 201 ≤ n, q ≤ 1051 ≤ array elements ≤ 109InputFirst line contains number of test cases. Next line contains n and q representing size of array and number of operations. Next line contains array elements. Next q lines operations of type1 and type2 in the specified format.OutputGive answer of the required type in new lines.ExampleInput:1\r\n3 3\r\n2 3 4\r\nq 1 3\r\nu 2 5\r\nq 1 2Output:3\r\n5",
  "sample_input": "Cost = 2n; where n is position of unset bit which is at farthest distance from MSB in M",
  "sample_output": "Input:1\r\n3 3\r\n2 3 4\r\nq 1 3\r\nu 2 5\r\nq 1 2Output:3\r\n5",
  "link": "https://www.spoj.com/problems/GCOM",
  "scraped_at": "2025-08-17 00:34:06"
}