{
  "problem_code": "problems",
  "title": "March Of The King",
  "tags": [],
  "text": "The white king George lives all alone in achessboard(A standard chessboard consists of8rows and columns). He lives alone because the evil black king Andrew killed all the other pieces in frustration after George beat him in a game of chess.Wandering all alone with no purpose and literally bored to death, King George invented a new game to keep him occupied. King George has asecret wordin his mind. It is the word he used to shout instead of the usualcheckmateafter beating the black king in a chess game. King George loves to march, so he decided to take a tour through the chessboard. He assigns a single lowercase letter to each square of the chessboard first. He can then start his tour from any square on the chessboard. From a square, the king can move to any neighboring square inside the board as in the game ofchess. However, it is not allowed to move to the same square twice during the journey. In other words, all the squares visited by the king must bedistinct.After completing his tour (the tour can be stopped anytime), George concatenates all the characters in the order of his travel to form a word. Since he has nothing better to do, the white king wants to know how many different ways he can complete the tour so that the secret word is formed afterward.Two ways are considered different if a different square is visited at any moment. Note that the order in which the squares are visited also matters. As a consequence, for example the path(1, 2) → (2, 1)and(2, 1) → (1, 2)are considered different.Formally the problem is as follows:LetB(X, Y)be the lowercase letter assigned to square(X, Y). Also, let thesecret wordbeS1S2... SK.\r\nYour task is to find the number of possibleKing's tours. A King's tour is a sequence of coordinates(X1, Y1), (X2, Y2) ... (XK, YK)satisfying:1 ≤ Xi, Yi≤ 8B(Xi, Yi) = Sifor all 1 ≤ i ≤ K(Xi, Yi) ≠ (Xj, Yj) for all 1 ≤ i < j ≤ Kmax(|Xi- Xi + 1|, |Yi- Yi + 1|) = 1 for all 1 ≤ i < KInputThe first line of input consists of a single integerKdenoting the length of the secret word. The next line contains the secret word consisting ofKlowercase letters. The next8lines each contain8characters describing the lowercase letters assigned to the chessboard in row-major order.Constraints1 ≤ K ≤ 11OutputPrint a single line containing a single integer denoting the number of different tours forming the secret word.ExampleInput:2\r\naa\r\naabbbbbb\r\naabbbbbb\r\nbbbbbbbb\r\nbbbbbbbb\r\nbbbbbbbb\r\nbbbbbbbb\r\nbbbbbbbb\r\nbbbbbbbbOutput:12Input:9\r\ncheckmate\r\ncheckmat\r\ncheckmee\r\ncheckmat\r\ncheckmee\r\ncheckmat\r\ncheckmee\r\ncheckmat\r\ncheckmeeOutput:7698ReferenceHackerRank - March Of The King",
  "sample_input": "Input:2\r\naa\r\naabbbbbb\r\naabbbbbb\r\nbbbbbbbb\r\nbbbbbbbb\r\nbbbbbbbb\r\nbbbbbbbb\r\nbbbbbbbb\r\nbbbbbbbbOutput:12",
  "sample_output": "Input:9\r\ncheckmate\r\ncheckmat\r\ncheckmee\r\ncheckmat\r\ncheckmee\r\ncheckmat\r\ncheckmee\r\ncheckmat\r\ncheckmeeOutput:7698",
  "link": "https://www.spoj.com/problems/CHECKMEET",
  "scraped_at": "2025-08-17 00:34:05"
}