{
  "problem_code": "problems",
  "title": "Random Magic Trick",
  "tags": [],
  "text": "A standard deck of cards has52cards in total,4suits - Hearts, Diamonds, Clubs, and Spades and each suit has13cards (2, 3, 4, 5, 6, 7, 8, 9, 10, Jacks, Queens, Kings and Aces). Oompa Loompa is an amateur magician who loves card magics. As you know, many magic tricks are rather simple once you know the secret behind them. Oompa Loompa's favorite trick is the random magic trick. The trick goes on like this. At first, he takes a deck of cards consisting of some suits, and each suit containing some cards, and randomly shuffles them. The magician's trick here is to show there are at least2consecutive Kings as well as2consecutive Queens in the shuffled deck. As you can see, this trick relies on pure luck, and may be unsuccessful if the magician's luck runs out :)Performing the trick with a non-standard deck of cards, with any number of suits and any number of cards in each suit, what is the probability of performing a successful magic trick?Note:Assume that the deck is shuffled uniformly randomly.Assume that any suit contains at least two cards, and every suit contains the king card and the queen card.A suit consists of  distinct cards numbered from1toC, and the cards numbered1and2are Kings and Queens respectively. Note that any card is uniquely identified by its suit and card number.InputThe first line containsTdenoting the number of test cases. Each of the nextTlines consists of two space-separated integersSandC, denoting the number of suits and the number of cards in each suit respectively.Constraints1 ≤ T ≤ 16921 ≤ S ≤ 362 ≤ C ≤ 48Outputp>For each test case, print the probability of the magician performing a successful magic trick. Anabsoluteerror less than10-6will be ignored.ExampleInput:2\r\n2 2\r\n2 3Output:0.333333333333\r\n0.133333333333ExplanationIn the first test case, there are4cards in the deck (2suits with2cards each). This means that there can be4!different permutations of the shuffled cards. Only8of them contain at least one pair of adjacent Kings and Queens. The probability of a successful magic trick is, therefore,8/24 = 1/3ReferenceHackerRank - Random Magic",
  "sample_input": "Input:2\r\n2 2\r\n2 3Output:0.333333333333\r\n0.133333333333",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RANAGIC",
  "scraped_at": "2025-08-17 00:33:58"
}