{
  "problem_code": "problems",
  "title": "Queue of Soldiers",
  "tags": [],
  "text": "In a planet far away from Earth, there is a deadly war going on between two countries: Bitland and Byteland. The queen of Bitland has an army ofNsoldiers. She has found a strategy to attack the weakest part of the border of Byteland, but to reach there, the soldiers of Bitland has to form a queue and pass through a very narrow valley. Moreover, there is some defense mechanism set in the valley by Byteland: If any soldierPwith heightvpasses through the valley, then anybody followingPwith height (strictly) greater thanvwill be killed by automatic firing.The queen of Bitland is also aware of this scenario, but it is not always possible to send her soldiers according to the non-increasing order of heights (so that no soldier dies). She understands that some soldiers have to sacrifice their lives. To find the best possible permutation, she wants your help to calculate the number of different permutations of the heights of her soldiers so that exactly K soldiers die in that valley. A permutation isXdifferent from another permutationYif there exists somei(1 ≤i≤N) for which the height ofi-thsoldier is different in these two permutations.InputThe first line of input file contains the number of test cases,T(1 ≤T≤ 20). ThenTcases follow: Each case consists of two lines. The first line contains two integers:N(1 ≤N≤ 50000) andK(0 ≤K≤ 1000). Then the second line contains N integers denoting the heights of the soldiers. There will be at most 100 different values of their heights. There will be at most1000soldiers with same height. For 80% of the cases,Nwill be less than 10000.OutputFor each case, print “Case <x>: <y>” in a separate line, wherexis the case number andyis the number of permutations such that exactlyKsoldiers die. As the number can be very large, printy modulo 1000000007ExampleInput:3\r\n3 1\r\n1 2 3\r\n3 1\r\n1 2 2\r\n3 2\r\n1 2 3Output:Case 1: 3\r\nCase 2: 1\r\nCase 3: 2",
  "sample_input": "Input:3\r\n3 1\r\n1 2 3\r\n3 1\r\n1 2 2\r\n3 2\r\n1 2 3Output:Case 1: 3\r\nCase 2: 1\r\nCase 3: 2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/AR2015PE",
  "scraped_at": "2025-08-17 00:34:16"
}