{
  "problem_code": "problems",
  "title": "Votka and String",
  "tags": [],
  "text": "Votka loves string very much. Recently he learned prefixes and suffixes. A prefix of a string S is any leading contiguous part of S and a suffix of string S is any trailing contiguous part of S, e.g., the prefixes of string “abc” are { “a”, “ab”, “abc” } and the suffixes are { “abc”, “bc”, “c” }. Votka considers a suffix Si of string S beautiful, if Si has at least b prefixes which are also prefixes of S.Formally,let, P = the set of prefixes of the string SPi = the set of prefixes of the suffix SiThen, Si is a beautiful suffix if |P ∩ Pi| ≥ b.For example, consider S = “abcabcd” and b = 3, then suffix S3 i.e. “abcd” is a beautiful suffix because it has 3 (≥ b) prefixes { “a”, “ab”, “abc” } which are also prefixes of S. Note that, S itself is a beautiful suffix for all b ≤ |S|.Now Votka thinks about a problem. The problem is, you are given a string S and m numbers {K1, K2, … , Km }. For each number Ki, you have to find the number of beautiful suffixes of S considering b = Ki.Votka announces that he will give a treat to the first solver of this problem. Luffy, a close friend of Votka, wants to have that treat. As Luffy is very dumb, he asks for your help. Can you help him? :)InputInput starts with an integerT (≤ 10), denoting the number of test cases. The first line of each case contains a stringS (1 ≤ |S| ≤ 100000). S contains only lowercase English letters. The next line contains an integerm (1 ≤ m ≤ 100000). The following line contains m space separated integers K1, K2, … , Km(0 ≤ Ki≤ 100000).OutputFor each test case, print m space separated integers (number of beautiful suffixes of S considering b = Ki) in a single line. (Caution: Dataset is large. Use faster I/O. )SampleInput:2\r\nabcabcd\r\n3\r\n3 7 8\r\naaaaa\r\n5\r\n1 2 3 4 5Output:2 1 0\r\n5 4 3 2 1",
  "sample_input": "Input:2\r\nabcabcd\r\n3\r\n3 7 8\r\naaaaa\r\n5\r\n1 2 3 4 5Output:2 1 0\r\n5 4 3 2 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/VOTAS",
  "scraped_at": "2025-08-17 00:34:05"
}