{
  "problem_code": "problems",
  "title": "Domino's effect",
  "tags": [],
  "text": "Dominik \"Domino\" Domański is a scientist. He's conducting research on quantum physics. Lately, he started taking a closer look at certain very interesting effect, which can be observed when some quantum objects interact.In his next experiment, he placedninfinitely thin lines on the table, perpendicularly to the surface, in a row. Lines have different heights, distances between the lines can also differ. (Dominik calls these lines \"domino tiles\"). Looking from the front, they look likensegments, standing vertically on the X axis of the Cartesian coordinate system.Domino tiles can be toppled. If a tile has a height ofh, it will topple other tiles at mosthunits away. More precisely, if tile is placed at the positionx, and is knocked over to the right, it will topple the tiles placed at positionsx+1,x+2 ...x+h. If this tile is knocked over to the left, it will topple the tiles at positionsx-1,x-2 ...x-h.Dominik observed a very interesting phenomenon, which he called \"Domino's effect\" - toppling one domino tile can cause other tiles to topple, which can in turn topple other tiles. He started to wonder how to take advantage of this effect in a best possible way. What is the minimum number of tiles that need to be toppled, in order for all the dominoes to fall?InputThe first line contains a single integert, denoting the number of test cases. Then, testcases follow.The description of a single test case begins with a single integern(1 ≤n≤ 1000) - the number of domino tiles in an arrangement.It is followed bynintegershi- heights of subsequent tiles.It ends withn-1 integersdi- distances between neighboring tiles.(1 ≤hi,di≤ 106).OutputFor every test case you should find a sequence of domino tiles, that will knock down the whole arrangement. It should begin with an integerk(1 ≤k≤n), denoting the number of tiles to be pushed. Then, descriptions of moves should follow. One move is described by one integerxi(1 ≤xi≤n) and one letter (either L or P). It means that during thei-th move, we topple a tile numberxi(counting from 1, according to original arrangement). L means that we knock it over to the left, P means knocking over to the right.The sequence should knock over all the tiles, while using as few moves as possible.ExampleInput:1\r\n6\r\n1 5 1 1 1 1\r\n2 1 2 1 1Output:2\r\n2 P\r\n1 LExplanationFirst we topple the domino tile number 2 (of length 5) to the right, which knocks over everything to the right of that tile. Then, we topple tile number 1 - the only one that remains.",
  "sample_input": "Input:1\r\n6\r\n1 5 1 1 1 1\r\n2 1 2 1 1Output:2\r\n2 P\r\n1 L",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DOM",
  "scraped_at": "2025-08-17 00:34:11"
}