{
  "problem_code": "problems",
  "title": "Inquire",
  "tags": [],
  "text": "(EN:)Every tourist visiting our city must visit the May 4 avenue. There areNhouses, numbered from 1 toN. There arePipeople living at housei.The statistic institute is proceeding with the survey this year. They will make many queries about the avenue's population. For each query, two numbersAandB, withA≤B, are given. You must determine the total number of people living in all houses from houseAto houseB, inclusive.InputFirst line contains the numberN(1 ≤N≤ 105). Second line containsNintegersP1,P2...PN, indicating how many people live at each house (for each 1 ≤ i ≤N, 0 ≤Pi≤ 100). Next line contains the integerQ(1 ≤Q≤ 104), the number of queries to be processed. Each of the nextQlines describes a query with two integersAandB(1 ≤A≤B≤N).OutputFor each query, print a line with its result.(PT-BR:)Todo turista que visita a cidade deve conhecer a Avenida Quatro de Maio. HáNcasas na avenida, numeradas sequencialmente de 1 aN. HáPipessoas morando na casa de númeroida avenida.O instituto de estatística está realizando o censo deste ano. Para tal, o instituto irá realizar diversas consultas sobre a população da avenida. Em cada consulta, são dados dois númerosAeB, comA≤B. Para cada consulta, é necessário determinar o número total de pessoas que moram entre as casasAeB, inclusive.Sua tarefa é, dada a população de cada casa e as consultas que o instituto irá fazer, determinar a resposta para cada consulta dada.EntradaA primeira linha da entrada contém o inteiroN(1 ≤N≤ 105). A segunda linha contémNinteirosP1,P2, ...,PN, indicando a população de cada casa da avenida (Para cada 1 ≤ i ≤N, 0 ≤Pi≤ 100). A terceira linha contém um inteiroQ(1 ≤Q≤ 104), indicando o número de consultas a serem realizadas. Por fim, cada uma das próximasQlinhas descreve uma consulta. Cada linha contém dois inteirosAeB(1 ≤A≤B≤N).SaidaPara cada consulta, imprima uma linha contendo sua resposta.ExampleInput:410 2 8 7234 41 32 4Output:722082Input:51 2 3 4 521 51 1Output:151",
  "sample_input": "Input:410 2 8 7234 41 32 4Output:722082",
  "sample_output": "Input:51 2 3 4 521 51 1Output:151",
  "link": "https://www.spoj.com/problems/UFPR14D",
  "scraped_at": "2025-08-17 00:34:16"
}