{
  "problem_code": "problems",
  "title": "Congratulations, Fidel!",
  "tags": [],
  "text": "Fidel has finished a fruitful stage of his academic formation by achieving his PhD in Physics. This was mainly the result of his firm attitude towards the formalization of the fabulous results in his fantastic investigation.Fidel has always spread happiness among his friends and family, and that is why we have all agreed to sign a congratulation letter addressed to our favourite doctor. Having finished writing the letter, the only remaining task is to include the fervent signature of the F signers. For that purpose, we have bought two markers, one of which is French blue and the other fuchsia. Each of the signers will write their name using these markers.It is our intention to emphasize the doctor title that Fidel has just achieved, and so we want that the abbreviation of such title (\"DR\") can be seen many times disguised within our signatures. To that end, we will sign using both colors, and write some letters in blue and others in fuchsia, in such a way that by reading only the fuchsia letters, Fidel may read the \"DR\" abbreviation.More precisely, our goal is that by reading only those letters written in fuchsia, Fidel only reads 'D' and 'R' letters, in an alternating fashion. Consequently, the first fuchsia letter must be a 'D', and for every 'D' written in fuchsia, the next letter written in that same colour will have to be an 'R'. Similarly, for each 'R' written in fuchsia, the next letter written in that same colour will have to be a 'D', and the very last letter written in fuchsia will have to be an 'R'.We want to write the fuchsia letters in such a way that Fidel reads the letters 'D' and 'R' written in that colour as many times as possible. In order to accomplish our goal, we can choose in which order we will write our names, and which letters we will write using each colour. Since there are many different ways to do so, we need your help to find out what is the maximum number of times that we can write the \"DR\" abbreviation in fuchsia, by following the rules that were explained in the previous paragraph.Fidel has finished a fruitful stage of his academic formation by achieving his PhD in Physics. This was mainly the result of his firm attitude towards the formalization of the fabulous results in his fantastic investigation.Fidel has always spread happiness among his friends and family, and that is why we have all agreed to sign a congratulation letter addressed to our favourite doctor. Having finished writing the letter, the only remaining task is to include the fervent signature of theFsigners. For that purpose, we have bought two markers, one of which is French blue and the other fuchsia. Each of the signers will write their name using these markers.It is our intention to emphasize the doctor title that Fidel has just achieved, and so we want that the abbreviation of such title (\"DR\") can be seen many times disguised within our signatures. To that end, we will sign using both colors, and write some letters in blue and others in fuchsia, in such a way that by reading only the fuchsia letters, Fidel may read the \"DR\" abbreviation.More precisely, our goal is that by reading only those letters written in fuchsia, Fidel only reads 'D' and 'R' letters, in an alternating fashion. Consequently, the first fuchsia letter must be a 'D', and for every 'D' written in fuchsia, the next letter written in that same colour will have to be an 'R'. Similarly, for each 'R' written in fuchsia, the next letter written in that same colour will have to be a 'D', and the very last letter written in fuchsia will have to be an 'R'.We want to write the fuchsia letters in such a way that Fidel reads the letters 'D' and 'R' written in that colour as many times as possible. In order to accomplish our goal, we can choose in which order we will write our names, and which letters we will write using each colour. Since there are many different ways to do so, we need your help to find out what is the maximum number of times that we can write the \"DR\" abbreviation in fuchsia, by following the rules that were explained in the previous paragraph.InputThere are multiple test cases in the input file. For each test case, the first line contains an integerF, representing the number of signers (1 ≤ F≤1000). Each of the nextFlines will contain the name of one of Fidel's friends. The name of each friend is formed by no more than100characters from 'A' to 'Z'.OutputFor each test case, you must write a single line containing an integer, indicating the maximum number of times that the \"DR\" abbreviation can appear in fuchsia once we sign our letter, if we follow the rules explained in this problem statement.ExampleInput:10\r\nRAMIRO\r\nAUGUSTO\r\nJOAQUIN\r\nJACINTO\r\nNICOLAS\r\nALEJANDRO\r\nDIJKSTRA\r\nKAJITA\r\nMCDONALD\r\nSCHRODINGE\r\n4\r\nDDD\r\nRRR\r\nDRDR\r\nRDRD\r\n12\r\nMELANIE\r\nDAMIAN\r\nRAMIRO\r\nAUGUSTO\r\nJOAQUIN\r\nJACINTO\r\nNICOLAS\r\nALEJANDRO\r\nDIJKSTRA\r\nKAJITA\r\nMCDONALD\r\nSCHRODINGER\r\n4\r\nABCEFG\r\nHIJKLM\r\nNOPQST\r\nUVWXYZOutput:4\r\n5\r\n5\r\n0",
  "sample_input": "Input:10\r\nRAMIRO\r\nAUGUSTO\r\nJOAQUIN\r\nJACINTO\r\nNICOLAS\r\nALEJANDRO\r\nDIJKSTRA\r\nKAJITA\r\nMCDONALD\r\nSCHRODINGE\r\n4\r\nDDD\r\nRRR\r\nDRDR\r\nRDRD\r\n12\r\nMELANIE\r\nDAMIAN\r\nRAMIRO\r\nAUGUSTO\r\nJOAQUIN\r\nJACINTO\r\nNICOLAS\r\nALEJANDRO\r\nDIJKSTRA\r\nKAJITA\r\nMCDONALD\r\nSCHRODINGER\r\n4\r\nABCEFG\r\nHIJKLM\r\nNOPQST\r\nUVWXYZOutput:4\r\n5\r\n5\r\n0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2016F",
  "scraped_at": "2025-08-17 00:34:23"
}