{
  "problem_code": "problems",
  "title": "Drawing triangles",
  "tags": [],
  "text": "Daniela was offered aGame of Thronescoloring book. Each of the book's pages hasNpoints marked on it, being these points numbered from1toN. The challenge is meant to be joining these points with lines in such a way that the figure of a dragon is formed. This problem would be a lot of fun if it was titled \"Drawing dragons\" and the main character was Daenerys Targaryen, but this is not so. The main character is notDaenerys Stormborn of the House Targaryenthe first of her nameQueen of the Andals, the Rhoynar and the First MenLady of the Seven Kingdoms and Protector of the RealmKhaleesi of the Great Grass Seathe UnburntBreaker of ChainsMother of DragonsQueen of Meereenbut it's Daniela, who likes to draw triangles and study their properties. This is definitely a lot more fun than drawing dragons!Daniela is interested in similar triangles. A triangle is the figure that is formed by joining with line segments three unaligned points. Two triangles are said to be similar if the ratio between their corresponding sides' lengths are always the same. In the figure, trianglesABCandDEFare similar becauseAB/DE = BC/EF = CA/FD.Daniela has been looking at one of the books' pages for a while, thinking about the triangle formed by the first three points marked on it. She is wondering how many triangles similar to the one formed by these points can be formed using any three of theNpoints marked on the page. There are many points so it's going to take a while to find out the answer. She is now very sleepy, but she knows she won't be able to go to bed without knowing it. Can you help her by counting how many triangles similar to the one formed by the first three points (counting this triangle itself) can be formed by joining three points marked on the book's page? This way, she can go to bed and sleep peacefully during the long night.InputThere are multiple test cases in the input file. For each test case, the first line contains an integer numberN, representing the number of points marked on the book's page (3 ≤ N ≤ 1000). Each of the followingNlines contains two integer numbers, corresponding to one point marked on the page. The integer numbers in thei-th of these lines areXiandYi, and they represent the coordinates of thei-th point in a cartesian coordinate system (-100 ≤ Xi, Yi≤ 100fori = 1, 2 ... N). All points given in the input for a test case are distinct, and the first three points always form a triangle.OutputFor each test case, print a single line containing an integer number, representing the number of triangles similar to the one formed by the first three points in the input, which can be formed by joining three of the points marked on the page (counting the triangle formed by the first three points itself).ExampleInput:6\r\n0 0\r\n1 1\r\n-2 1\r\n5 2\r\n5 0\r\n2 3\r\n3\r\n0 0\r\n1 0\r\n1 1\r\n4\r\n0 0\r\n12 12\r\n3 21\r\n28 -4\r\n4\r\n-100 -100\r\n-100 100\r\n100 -100\r\n100 100Output:2\r\n1\r\n3\r\n4",
  "sample_input": "Input:6\r\n0 0\r\n1 1\r\n-2 1\r\n5 2\r\n5 0\r\n2 3\r\n3\r\n0 0\r\n1 0\r\n1 1\r\n4\r\n0 0\r\n12 12\r\n3 21\r\n28 -4\r\n4\r\n-100 -100\r\n-100 100\r\n100 -100\r\n100 100Output:2\r\n1\r\n3\r\n4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2016D",
  "scraped_at": "2025-08-17 00:34:20"
}