{
  "problem_code": "problems",
  "title": "Efficient managing",
  "tags": [],
  "text": "Nlogonia's train network consists ofNstations, each of them strategically placed in a different city of the kingdom. Certain pairs of stations are connected by railways, and on each railway there is a train service going on both directions. For centuries theInstitute for the Cities' Perfect Connection(ICPC) has been in charge of optimizing public transportation in Nlogonia, so today the train network is so efficient there is exactly one way to travel between any pair of cities using trains. Note that it may be necessary for a traveller to successively take several trains, in case there is no direct connection between the pair of stations he is traveling to/from. In other realms this might be considered an inconvenience, but Nlogonia's inhabitants are happy knowing that they will not waste a single minute thinking about which route to take from one city to another.The ticket for each train service has certain price, so that a passenger taking one or more trains to travel between two cities has to buy the corresponding tickets before boarding each train. Nlogonia's currency is also extremely efficient, as there are bills with values corresponding to every non-negative power of two. This is, the denomination of bills in Nlogonia is of20= 1unit,21= 2units,22= 4units, and so on. As a result of this monetary efficiency, Nlogonians always pay their tickets by providing the minimum number of bills with which it is possible to reach the exact amount of the ticket they are buying.To speed up ticket buying, theAgency for Counting Money(ACM) would like to introduce the following offer. When a passenger is going to make a trip, he can pay all the tickets he will be needing in advance. When doing so, he must present all the bills he would use along his journey, and the ACM will only take one bill of each denomination for which the passenger provided an odd amount of bills. In this way, if for example a passenger wants to buy three tickets with prices of3,7and10units, he will present two bills for the first ticket (with denominations1and2), three bills for the second one (with denominations1,2and4) and two bills for the third (with denominations2and8). The ACM would then take only one of the bills with denomination2, along with each of the bills with denominations4and8, returning to the passenger two bills of denomination1, as well as two bills with denomination2.Now the ACM's steering committee is worried because this offer might be too expensive for the kingdom's treasury. There is certainly good cause for this, as one should note that it is even possible to travel for free (e.g.any round trip will be free, as an even number of tickets of each value will always be required). Your job is to evaluate the extent of the problem, for which the ACM has commanded you to determine the maximum price a passenger might have to pay when starting his journey from each of theNtrain stations in Nlogonia.InputThere are multiple test cases in the input file. The first line contains an integer numberN, representing the number of train stations in Nlogonia (2 ≤ N≤105). Train stations in Nlogonia are numbered from1toN. Each of the followingN-1lines contains three integer numbersA,BandC, indicating there is a railway directly connecting stationsAandB, beingCthe price of the ticket for the train service operating on said railway (1≤A, B≤Nand1≤C≤109, withA ≠ B). The description of the railway network is always such that for each pair of distinct stations there exists one and only one sequence of train services connecting them.OutputFor each test case, printNlines each containing one integer number. The number printed on thei-th line should correspond to the maximum value of the tickets that may be payed by a passenger starting his journey at the station identified by the numberi, when the offer described in the problem statement is applied.ExampleInput #1:4\r\n1 2 3\r\n2 3 7\r\n3 4 10Output #1:14\r\n13\r\n10\r\n14Input #2:6\r\n1 2 1\r\n3 2 2\r\n2 4 3\r\n4 5 4\r\n4 6 5Output #2:7\r\n7\r\n5\r\n5\r\n7\r\n7Input #3:7\r\n1 2 1\r\n1 3 2\r\n1 4 3\r\n1 5 4\r\n1 6 5\r\n1 7 6Output #3:6\r\n7\r\n7\r\n7\r\n7\r\n7\r\n7",
  "sample_input": "Input #1:4\r\n1 2 3\r\n2 3 7\r\n3 4 10Output #1:14\r\n13\r\n10\r\n14",
  "sample_output": "Input #2:6\r\n1 2 1\r\n3 2 2\r\n2 4 3\r\n4 5 4\r\n4 6 5Output #2:7\r\n7\r\n5\r\n5\r\n7\r\n7",
  "link": "https://www.spoj.com/problems/TAP2016G",
  "scraped_at": "2025-08-17 00:34:24"
}