{
  "problem_code": "problems",
  "title": "Cricket Selection",
  "tags": [],
  "text": "Swagger loves playing cricket and its his childhood dream to represent his country at international level. A cricket tournament is being organised by BCCI to select few young talents in country. He playedNmatches and he was rated by selectors and public on basis of his performance in each match. Rating for his performances are given below in1indexed arrayAwhereAiis his rating inithmatch.His performance in some of the matches were extraordinary but unfortunately, some were total failure. Now swagger has a chance to improve his total rating which is sum of ratings in each of the matches. As he knows some ofMjudges, he tried to bribe them and finally they agreed to remove the rating of few matches where they were in charge. Theithjudge demandedCiamount of money for removing each match of swagger's choice in the rangeLitoRi(both inclusive). Ratings of removed match will not be used in calculating total rating.Now the real problem begins, he only hasKamount of money and he wants to increase his total rating as high as possible. He is your friend and he also knows that you are a genius. Help him maximise his rating within the budget constraint.That's a simple task for you, isn't it?InputFirst line contains number of test casesT.First line of each test case contains3space separated integerN, K, Mdenoting number of matches he played, amount of money he has and number of judges he can bribe.Next line containsNspace separated integers whereithinteger denotes rating ofithmatch.NextMlines of each test case contains three integers:L, RandCwhere the integers in theithline denotes valueLi,Ri,Cirespectively.OutputFor each test case, print a single integer which is maximum possible sum in a new line.ExampleInput:2\r\n5 7 5\r\n5 -4 3 -3 3\r\n1 1 5\r\n1 3 2\r\n2 4 5\r\n1 5 7\r\n3 3 2\r\n5 10 2\r\n-1 -2 -3 -4 -5\r\n1 3 3\r\n3 4 4Output:11\r\n-6Constraints0 <T< 110 <N, M< 1040 <K< 5010 <Ci< 201|Ai|≤ 109",
  "sample_input": "Input:2\r\n5 7 5\r\n5 -4 3 -3 3\r\n1 1 5\r\n1 3 2\r\n2 4 5\r\n1 5 7\r\n3 3 2\r\n5 10 2\r\n-1 -2 -3 -4 -5\r\n1 3 3\r\n3 4 4Output:11\r\n-6",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CRICKDP",
  "scraped_at": "2025-08-17 00:34:30"
}