{
  "problem_code": "problems",
  "title": "Palindrome in a Tree",
  "tags": [],
  "text": "John has got a tree with N vertices. The vertices are numbered from 1 to N. He considers vertex 1 as the root of the tree. Each vertex of the tree contains a character C.Now John is doing a weird experiment with this tree.He often changes the character of a node in the tree and then sometimes he randomly selects a node v and tries to form a palindrome with all the characters in the subtree of node v.But since John is very busy man and has a lot of other important experiments to do he needs your help on this one.InputFirst line of the input contains an integer N (1 ≤ N ≤ 100000) denoting the number of vertices.Next N-1 lines contains two integers A and B (1 ≤ A, B ≤ N) which means there is an edge between vertex A and B.Next line contains a string of length N. The ithcharacter of this string denotes the character in node i.Then there will be an integer M (1 ≤ M ≤ 100000) in a separate line denoting the number of queries. Next M lines will contain a query.Each query will be in one of the following form:0 x C: which means the character of node x has been changed to C.1 x: which means you are asked to answer if a palindrome can be formed with all the characters in the sub tree of node x. There will be at least one query of this type.OutputFor each query of the form“1 x”print “YES” if a palindrome can be formed with all the characters in subtree of node x. Otherwise print “NO” (without the quotes).All the characters in the input will be small letters of English alphabet, i.e. a, b, c ... x, y, z.See sample input / output for details.SampleInput7\r\n5 4\r\n1 5\r\n6 3\r\n1 7\r\n5 6\r\n6 2\r\nabdaabc\r\n7\r\n1 1\r\n1 5\r\n1 3\r\n0 7 a\r\n1 1\r\n0 4 z\r\n1 5outputNO\r\nYES\r\nYES\r\nYES\r\nNOExplanationIn the 2ndquery, the formed palindrome can be “badab” or “abdba”.In the 3rdquery, there is only 1 character “d”, which is a palindrome.",
  "sample_input": "Input7\r\n5 4\r\n1 5\r\n6 3\r\n1 7\r\n5 6\r\n6 2\r\nabdaabc\r\n7\r\n1 1\r\n1 5\r\n1 3\r\n0 7 a\r\n1 1\r\n0 4 z\r\n1 5outputNO\r\nYES\r\nYES\r\nYES\r\nNO",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PLNDTREE",
  "scraped_at": "2025-08-17 00:34:28"
}