{
  "problem_code": "problems",
  "title": "Folding Stick",
  "tags": [],
  "text": "Folding StickToday Satria really excited about fractals (recurrence pattern), the first fractal type he learn is the dragon curve fractal. To make the dragon curve, it can be easily simulated by folding the paper and open it 90 degrees (parellel to X axis or Y axis) like this image below:Satria realized that the can be many ways to fold the paper, so he make an experiment. Initially there is a stick length 2N, he then place the stick parallel to x axis with one end lies on coordinate (0,0) and the other end lies on coordinate (2N,0). He then fold the stick, so the new folded stick occupy (0,0) to (2N-1,0) he keep doing that until the final folded stick occupy (0,0) to (1,0). In each foding there are two types of folding, folding UP (via possitive Y coordinate) and folding down (via negative Y coordinate). he then open all the folding with angle 90 degrees so each stick segment will be parallel ot X axis or Y axis. Now he wonder if he open all the folding with angle 90 degrees, what is the coordinate of the other end of that stick. Can you help him?InputThe first line there is an integer N denoting number of folding and a string S the sequence of folding and the type of folding.OutputYou sould output two integers x and y which is the coordinate of the other end of that stick.Constraint1 ≤ N ≤ 50Length of string S is equal to N, in other word: |S|=N.String S containing two possible characters:'U' means folding UP (positive Y direction)'D' means folding DOWN (negative Y direction)Sample 1Input1 UOutput1 1Sample 2Input1 DOutput1 -1Sample 3Input2 UDOutput2 0Sample 4Input2 DUOutput2 0Sample 5Input3 UUUOutput-2 2Sample 3 ExplanationHere is the image illustrating sample 3 on how the stick is folded and openned with 90 degrees angle.As seen in the picture above the other end of the stick after folding and openning lies on coordinate (2,0).Sample 5 explanationHere is the final openned stick on test case 5, the other end of the stick after folding and openning lies on coordinate (-2,2)",
  "sample_input": "1 U",
  "sample_output": "1 1",
  "link": "https://www.spoj.com/problems/JC15B",
  "scraped_at": "2025-08-17 00:34:07"
}