{
  "problem_code": "problems",
  "title": "Alicias Afternoon Amble",
  "tags": [],
  "text": "Alicia is staying in a hotel on the edge of town. She sets out in the morning with a list of landmarks to visit all across the city. This day of sightseeing will take her through the city, visiting a number of locations, all the way to the far-side of city where she will pause for lunch at the prestigious Pete’s Polygon Pizza Parlour. Anything she misses must be visited on the return trip to the hotel in the evening.Given the set of locations that Alicia would like to visit, find the length of the shortest tour which starts at her hotel, visits each of the locations, and returns back to the hotel. Beside the starting location, each location should be visited exactly once.The starting hotel will be located at the leftmost x-coordinate. From there, the optimal path should visit locations at strictly increasing x-coordinates until Pete’s Parlour is reached at the rightmost x-coordinate. From here, the optimal return path should visit any and all unseen locations in strictly decreasing x-coordinates.Note that the x-coordinate of each location will be unique.InputThe first line of input contains a single integer N, 1 ≤ N ≤ 1000, representing the number of locations.Each of the next n lines contains two integers X and Y, 0 ≤ X, Y ≤ 100000, representing the coordinates of the N locations.The (X, Y) coordinates of all locations are given as integers on a Euclidean plane.OutputThe output should consist of a single decimal containing the the total length of the tour rounded to two decimal places. This should immediately be followed by a newline.Example OneInput:51 32 13 44 45 2Output:10.87Example TwoInput:104 113 421 325 928 1042 143 250 467 1068 9Output:131.65",
  "sample_input": "Input:51 32 13 44 45 2Output:10.87",
  "sample_output": "Input:104 113 421 325 928 1042 143 250 467 1068 9Output:131.65",
  "link": "https://www.spoj.com/problems/AMBLE",
  "scraped_at": "2025-08-17 00:34:21"
}