{
  "problem_code": "problems",
  "title": "Theater shade in Berland",
  "tags": [],
  "text": "In Berland a new movie was released on the occasion of 14th Feb. The craze for this movie was very much among the peoples of the city. So many of them decided to go to the only movie theatre of Berland. As Berland is very much developed there are many large buildings, including the movie theatre. At each building except the theatre, there exists either a person who wants to see the movie or a taxi driver with his taxi. As it is very late in the night each taxi driver will only accommodate one passenger and also he will only drive forT[i]hours (return journey is not included). You will be given the distance between buildingD[i]and the speed of each taxi driverS[i]. As I am the owner of this theatre help me by telling, the maximum number of people I will see in the theatre for the movie.N + P + 1th building is the my theatre. Also, if a taxi starts his journey by taking a passenger, it only stops at the theatre.InputFirst line containsTTthe number of test cases.First line of each test test case containsN,PandRdenoting the number of taxi, number of people, and the number of roads between buildings.Next line containsNspace-separated integers representing the building where taxi is present.Next line containsPspace-separated integers representing the building where passengers is present.NextRlines containsX,Y, andD[i]the building connected via road and the distance between them in km.Next line containsNspace-separated integersS[i]giving the speed details of each taxi in km/h.Next line containsNspace-separated integersT[i]giving the time details of each taxi in hours.OutputMaximum number of people that will visit my theatre.Constraints1 ≤ TT ≤ 51 ≤ N ≤ 5001 ≤ P ≤ 10001 ≤ R ≤ 500001 ≤ X, Y ≤ N5 ≤ S[i] ≤ 501 ≤ T[i] ≤ 51 ≤ D[i] ≤ 100ExampleInput:1\r\n1 2 4\r\n2\r\n1 3\r\n1 2 5\r\n2 3 5\r\n3 4 10\r\n1 3 8\r\n20\r\n1Output:1",
  "sample_input": "Input:1\r\n1 2 4\r\n2\r\n1 3\r\n1 2 5\r\n2 3 5\r\n3 4 10\r\n1 3 8\r\n20\r\n1Output:1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAXI2",
  "scraped_at": "2025-08-17 00:34:18"
}