{
  "problem_code": "problems",
  "title": "Gears",
  "tags": [],
  "text": "A set of gears is installed on the plane. You are given the center coordinate and radius of each gear, which are all integer-valued. For a given source and target gear, indicate what happens to the target gear if you attempt to turn the source gear. Possibilities are:The source gear cannot move, because it would drive some gear in the arrangement to turn in both directions.The source gear can move, but it is not connected to the target gear.The source gear turns the target gear, at a certain ratio.If the source gear cannot move, give this result, even if the source and target gears are not connected.InputEach input will consist of a single test case. Note that your program may be run multiple times on different inputs. The first line of input contains a single integern(1 ≤n≤ 1,000), the total number of gears. Following this will benlines, one per gear, containing thex,y(-10,000 ≤x,y≤10,000) andr(1 ≤r≤ 10,000) values for the gear, where (x,y) is the position of the axle of the gear, andris its radius. Assume that the teeth of the gears are properly designed, and accounted for in the radius, so that any gear will mesh with any other gear if (and only if) they are tangent to each other. The gears will never overlap.OutputOutput a single line, with the following content, based on the result:\"-1\"- if the source gear cannot move.\"0\"- if the source gear can move but is not connected to the target.\"a b\"- if the source gear moves the target gear, whereaandbare two space-separated integers, anda:bis the ratio of source gear revolutions to target gear revolutions reduced to its lowest form (i.e. they have no common factor other than 1).ais always positive.If the target turns in the same direction as the source,bis positive.If the target turns in the opposite direction as the source,bis negative.ExampleInput:1610 10 520 10 530 10 540 10 510 20 520 20 530 20 540 20 510 30 520 30 530 30 540 30 510 40 520 40 530 40 540 40 5Output:1 1",
  "sample_input": "Input:1610 10 520 10 530 10 540 10 510 20 520 20 530 20 540 20 510 30 520 30 530 30 540 30 510 40 520 40 530 40 540 40 5Output:1 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SERGEARS",
  "scraped_at": "2025-08-17 00:34:20"
}