{
  "problem_code": "problems",
  "title": "SUPER CELL",
  "tags": [],
  "text": "Titania, the largest moon of Uranus. Recently a living cell has been found there and scientists say that this is the beginning of life there. They call it Super cell.The super cell is very surprising. It lives forTseconds. Every secondK-mitosisevent occurs in the super cell. In aK-mitosisevent,Knew super cells born from the mother super cell. These new super cells also lives for exactlyTseconds andK-mitosisevent occurs every second in all the living super cells.When the initial super cell has been found the time is 0 second. This super cell lives for nextTseconds and at theT'th second it dies. Every super cell dies afterT'th second when it is born.You have to tell how many super cell will be there in Titania atN'th second.InputInput starts with an integerTCdenoting number of test cases. In nextTClines there will be three integersT,KandNin each line.Tdenotes the amount of time a super cell lives.Kdenotes how many new super cells born during mitosis event.Ndenotes that you have to answer how many super cells live there in Titania atN'th second.OutputFor every test case print a single integer modulo 1000000007 (1e9+7), the number of super cells living atN'th second in Titania.Constraints1 ≤TC≤ 500 ≤T≤ 301 ≤K≤ 1000 ≤N≤ 1000000000SampleInput3\r\n5 2 4\r\n3 1 5\r\n1 2 4Output81\r\n24\r\n16ExplanationIn the first sample:At 0thsecond, 1 cell is there.At 1stsecond, 2 new cells are born and there are total 3 living cells.At 2ndsecond, 6 new cells are born and there are total 9 living cells.At 3rdsecond, 18 new cells are born and there are total 27 living cells.At 4thsecond, 54 new cells are born and there are total 81 living cells.In the second sample:At 0thsecond, 1 cell is there.At 1stsecond, 1 new cell is born and there are total 2 living cells.At 2ndsecond, 2 new cells are born and there are total 4 living cells.At 3rdsecond, 4 new cells are born and the cell which is born at 0thsecond dies. So, there are total 7 living cells.In the third sample:At 0thsecond, 1 cell is there.At 1stsecond, 2 new cells are born and the cell which is born at 0thsecond dies. So, there are 2 living cells.At 2ndsecond, 4 new cells are born and the cells which are born at 1stsecond die. So, there are 4 living cells.At 3rdsecond, 8 new cells are born and the cells which are born at 2ndsecond die. So, there are 8 living cells.At 4thsecond, 16 new cells are born and the cells which are born at 3rdsecond die. So, there are 16 living cells.",
  "sample_input": "Input3\r\n5 2 4\r\n3 1 5\r\n1 2 4Output81\r\n24\r\n16",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SCELL",
  "scraped_at": "2025-08-17 00:34:04"
}