{
  "problem_code": "problems",
  "title": "Ada and Panels",
  "tags": [],
  "text": "Ada the Ladybug has proved successful in solving some hard problems, so a construction\r\ncompany has asked her to solve a problem for them. There are multiple cities in\r\nthe country and each city owns exactly one panel-block. There are also\r\nunidirectional roads between some pairs of cities (note that circular\r\nself-roads and multi-roads with several traffic lines are allowed). A city can\r\nsell its panel-block to any city, to which they could transport the panel\r\nblock, and from which they can bring back their reward for it (i.e. there must\r\nbe a path from actual city to destination city and back). As long a city hasKpanel-blocks, it builds a prefab of heightKwhich looks exactly\r\nsame as each other prefab of heightK.The construction company notes all the heights down and puts them in an array. They are wondering how many distinct arrays are possible by moving the panel blocks between cities. However there is a catch. Consider a set of cities in which each city is reachable by every other city. Since we can easily shuffle the panel blocks between such a set of cities, we can create new permutations with the same set of heights. The construction company will NOT count any such cases. Hence they will only consider the distinct set of heights for such a set of cities.You have proved successful in helping Ada with some hard problems, so she has\r\nasked you to help her. Your job is following - count the number of possible\r\nstructures which could arise. Since this number might be pretty big, you have to\r\noutput it modulo109+7.InputThe first line contains two integers1 ≤ N, M ≤ 2*105,\r\nthe number of cities  an the number of unidireectional roads between them.The nextMlines contains two integers0 ≤ a, b < N,\r\nthe road from cityato citybOutputPrint a single line - the number of possible structures modulo1000000007.Example Input7 9\r\n0 1\r\n1 2\r\n2 3\r\n3 1\r\n2 0\r\n4 5\r\n5 4\r\n6 4\r\n5 6Example Output15Example Input 27 7\r\n0 1\r\n1 2\r\n2 3\r\n3 4\r\n4 5\r\n5 6\r\n6 0Example Output 215Example Input 36 3\r\n0 1\r\n3 2\r\n4 5Example Output 31Example Input 48 7\r\n0 1\r\n1 0\r\n2 3\r\n3 2\r\n4 5\r\n5 6\r\n6 4Example Output 412",
  "sample_input": "7 9\r\n0 1\r\n1 2\r\n2 3\r\n3 1\r\n2 0\r\n4 5\r\n5 4\r\n6 4\r\n5 6",
  "sample_output": "15",
  "link": "https://www.spoj.com/problems/ADAPANEL",
  "scraped_at": "2025-08-17 00:34:09"
}