{
  "problem_code": "problems",
  "title": "Walk home together",
  "tags": [],
  "text": "A group offfriends get together to have a coding problem-solving party at their university computer lab every weekend. Unfortunately, it closes at 22:00, at which point they have no other option but to walk home. The city they live in can be described asnjunctions connected bymbidirectional roads. Since these friends have been interrupted from coding their solutions, each one of them wants to get home as fast as possible to finish his and submit it. At the same time, they each have a few problems that they want to discuss with the others, so they will pick such a path that the entire group can walk together for as long as possible. On top of that, so that this walk would feel fresh every time, they would like to take a different path each weekend, for as long as possible.The group of friends were able to figure out both the length of the longest path they could all efficiently walk together, as well as how many distinct such paths there are - do you think you can do it too?InputThe first line contains an integerT- the number of test cases.Ttest cases follow, each in the given format. Test cases are separated by a blank line.The first line of a case contains four integersn m c f- the number of junctions, the number of two-way roads connecting the junctions, the junction at which thecomputer lab is located, and the number offriends. Junctions are numbered from1ton.The second line containsfdistinct integersF1...Ff-Fiis the junction where friend numberilives. None of them are equal toc.The followingmlines contain three integersx y z, denoting a two-way road connecting junctionsxandy, of lengthz.Each unordered pairx, ywill be present at most once.You can assume that the city is connected.OutputOutput two integersLandW.A 'path' is a sequence of junctionsa1... akwhere for all1 ≤ i < kthe junctionsaiandai+1are connected by a road.Lis the length of the longest path, such that for all1 ≤ i ≤ fif after walking this path friend numberican get home the soonest at some timeL+ti, there exists no path fromctoFishorter thanL+ti. In other words, none of the friends could have gotten home sooner if they would have chosen a different path which did not include the one of lengthL.Wis the number of such paths, modulo109+7.Two paths are considered distinct if either:a) they contain a different number of junctions, orb) they contain the same number of junctions (lets call thatk), where one path is described bya1...akand the other byb1...bk, and there exists some1 ≤ i ≤ ksuch thatai≠ bi.Constraints1 ≤ f < n ≤ 5000n-1 ≤ m ≤ min(106, n × (n - 1) / 2)1 ≤ c ≤ n1 ≤ Fi≤ n1 ≤ x < y ≤ n1 ≤ z ≤ 4 × 1051 ≤ T ≤ 500Additionally, if T > 1, n ≤ 50.The largest input file is under 16MB.ExampleInput:3\r\n9 12 2 3\r\n9 8 1\r\n2 5 3\r\n2 3 7\r\n2 4 5\r\n3 6 4\r\n6 7 2\r\n5 7 20\r\n4 7 8\r\n4 8 50\r\n7 9 10\r\n7 8 30\r\n1 8 15\r\n1 9 15\r\n\r\n9 12 2 3\r\n9 8 1\r\n2 5 3\r\n2 3 7\r\n2 4 5\r\n3 6 4\r\n6 7 2\r\n5 7 20\r\n4 7 8\r\n4 8 10\r\n7 9 10\r\n7 8 30\r\n1 8 15\r\n1 9 15\r\n\r\n9 12 2 3\r\n9 8 1\r\n2 5 3\r\n2 3 7\r\n2 4 5\r\n3 6 4\r\n6 7 2\r\n5 7 20\r\n4 7 8\r\n4 8 10\r\n7 9 10\r\n7 8 30\r\n1 8 4\r\n1 9 4Output:13 2\r\n5 1\r\n15 1ExplanationIn the first case, the paths are 2, 3, 6, 7 and 2, 4, 7. Friends number 1 and 2 can then go straight home, and friend number 3 can go home either through junction 8 or 9. For each friend, this is an optimal path.In the second case, friend number 1 can get home the fastest the same ways as before, friend number 2 can get home fastest by going 2, 4, 8 and friend number 3 by going 2, 4, 8, 1. Hence the longest path which all friends are willing to take is 2, 4 of length 5, and no other such path exists.In the third case, the first friend can get home the fastest by 2, 3, 6, 7, 9 or 2, 4, 7, 9 or 2, 4, 8, 1, 9; the second friend's only fastest path is 2, 4, 8, and the third friend is only willing to take the path 2, 4, 8, 1. Hence the longest path they are all willing to take has length 15 and it is 2, 4, 8.",
  "sample_input": "Input:3\r\n9 12 2 3\r\n9 8 1\r\n2 5 3\r\n2 3 7\r\n2 4 5\r\n3 6 4\r\n6 7 2\r\n5 7 20\r\n4 7 8\r\n4 8 50\r\n7 9 10\r\n7 8 30\r\n1 8 15\r\n1 9 15\r\n\r\n9 12 2 3\r\n9 8 1\r\n2 5 3\r\n2 3 7\r\n2 4 5\r\n3 6 4\r\n6 7 2\r\n5 7 20\r\n4 7 8\r\n4 8 10\r\n7 9 10\r\n7 8 30\r\n1 8 15\r\n1 9 15\r\n\r\n9 12 2 3\r\n9 8 1\r\n2 5 3\r\n2 3 7\r\n2 4 5\r\n3 6 4\r\n6 7 2\r\n5 7 20\r\n4 7 8\r\n4 8 10\r\n7 9 10\r\n7 8 30\r\n1 8 4\r\n1 9 4Output:13 2\r\n5 1\r\n15 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/WHT",
  "scraped_at": "2025-08-17 00:34:21"
}