{
  "problem_code": "problems",
  "title": "KNIGHTS level testing",
  "tags": [],
  "text": "The image above is an example of a level in Arzola's videogame 'KNIGHTS'. The rules are very simple. The player is given a chess board, where each square is either empty, contains a wall, or contains a knight of one of three colours. Some squares are also marked with a colour - the player beats the level if all marked squares contain a knight of their respective colour at the same time. To accomplish this, the player can select any knight and place him on an empty square using the classic chess knight move (2 squares in one direction, 1 square in a direction perpendicular to the first).You will help test a few new level designs for this game. Given a starting configuration and several goal configurations (depicting which squares contain which knight), find the minimum number of moves required to get to those goal configurations.InputThe first line contains two integers1 ≤ r,c < 24.The followingrlines containccharacters each, describing the starting configuration of the level. The characters in the grid will be '#'for wall, '.'for an empty square, and 'R', 'B' and 'Y' for a red, blue and yellow knight, respectively.The number of squares that are not walls will be at most 12.A blank line follows, followed by a line with an integer1 ≤ q ≤ 75,000- the number of suggested goal configurations for this level. You may assume thatq*r*c ≤ 106.qdescriptions of goal configurations follow, separated by blank lines. Each description will berrows consisting ofccharacters, from the same set as the starting configuration. You may assume that the walls are at the same places as in the starting configuration, and that the number of knights of each colour is the same as the number of knights of that colour in the starting configuration.OutputFor each suggested goal configuration, if it is not reachable from the starting configuration in any number of moves, output-1.Otherwise, output the minimum number of moves required to reach that goal configuration from the starting configuration.ExampleInput:3 4\r\n#BYY\r\n..R#\r\n.BYR\r\n\r\n4\r\n#BYY\r\n..R#\r\n.BYR\r\n\r\n#.YY\r\n..R#\r\nBBYR\r\n\r\n#Y.Y\r\nB.R#\r\n.YRB\r\n\r\n#..R\r\nYYB#\r\nYBR.Output:0\r\n1\r\n19\r\n-1",
  "sample_input": "Input:3 4\r\n#BYY\r\n..R#\r\n.BYR\r\n\r\n4\r\n#BYY\r\n..R#\r\n.BYR\r\n\r\n#.YY\r\n..R#\r\nBBYR\r\n\r\n#Y.Y\r\nB.R#\r\n.YRB\r\n\r\n#..R\r\nYYB#\r\nYBR.Output:0\r\n1\r\n19\r\n-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/KNIGHTSG",
  "scraped_at": "2025-08-17 00:34:23"
}