{
  "problem_code": "problems",
  "title": "First to meet the spaceship",
  "tags": [],
  "text": "A spaceship has been sighted heading towards Earth. For the entire time that humanity has been monitoring it, it has not altered its course, it only changed speed for unknown reasons. As such, all the possible places on Earth where the spaceship might end up landing form a straight line; depending on how much it changes speed, it will land at different times, meaning a different point on this line due to Earth's rotation.npeople want to be the first to meet the aliens - they picked a pointxion this line and wait at that point in their vehicle with speedvi. Now they are all anxiously waiting for the spaceship's arrival. NASA has given a list ofqmost likely locations where the spaceship might end up landing - and everyone wants to know who would get to be the first to meet the aliens if the spaceship landed at each of the given points. They turned to you for help!InputThe first line contains two integers1 ≤ n , q ≤ 300,000- the number of people wishing to meet the aliens and the number of possible points where the spaceship might land.The followingnlines contain two integers0 ≤ xi< 109and0 < vi≤ 109- the point on the line where thei-th person is waiting and the speed of his vehicle. Additionally,xi= xj→ vi≠ vj.The last line containsqdistinct integers0 ≤ qi< 109- the points on the line where the spaceship might end up landing. You may assume the spaceship will not land at any point containing a person waiting in a vehicle.OutputFor each queryqioutput the number of people who will arrive at the spaceship first if it lands at that point. A person atxjwith speedvjwill arrive atqiin time|xj- qi| /vj. The people who will arrive at the spaceship first are thosejfor whom the fraction is minimal out of all people. Then, in the same line, output the 1-based indices of these people as they were given in the input, sorted in ascending order.ExampleInput:4 7\r\n10 5\r\n30 1\r\n20 4\r\n100 1\r\n5 31 22 15 85 60 61Output:1 1\r\n1 2\r\n1 3\r\n1 1\r\n2 1 4\r\n2 1 3\r\n1 1",
  "sample_input": "Input:4 7\r\n10 5\r\n30 1\r\n20 4\r\n100 1\r\n5 31 22 15 85 60 61Output:1 1\r\n1 2\r\n1 3\r\n1 1\r\n2 1 4\r\n2 1 3\r\n1 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MEETSHIP",
  "scraped_at": "2025-08-17 00:34:16"
}