{
  "problem_code": "problems",
  "title": "Minions v/s Minions",
  "tags": [],
  "text": "The minions have been recently troubling Gru for buying them bananas. Gru sets up anN×Nbanana field, where the cells that contain bananas are denoted byb, the cells which contains bombs are denoted byB. Two pack of minions are allowed to enter the field at a time from entry points marked in the fields asXandY. We all know how childish they are and competitive they can be. Each pack from a position can divide themselves into four directions – up, down, left, right (they don’t cross the boundaries of the field.) They are smart enough to avoid the bombs. Whichever minion pack reaches a cell first gets to keep the banana, but if both packs reach a cell at the same time they smash the banana and do not allow each other to move ahead from that point. However, if member of the same pack meet at a cell they reunite and move ahead on their hunt for bananas. Remember though Gru has strictly asked them not to travel through already visited cells because of the dropped off banana peels (they can be messy at times too!)Gru has to figure out which pack acquired more bananas. Gru dozes off in the middle of the banana battle. Please help him to declare the winner – Pack 1 or Pack 2.PS: You can assume each pack contains infinite number of minions, so the pack never runs out of individuals while dividing themselves in the four directions.InputThe first line contains number of test casesT. Following test case description containsNandN×Nbanana field’s description.1 ≤ T ≤ 301 ≤ N ≤ 1000OutputYou need to print “Pack 1” if Pack 1 wins and “Pack 2” if Pack 2 wins and “Gru gets to keep all bananas!” if there is a draw.ExampleInput:2\r\n3\r\nbXb\r\nbBb\r\nYBb\r\n5\r\nBBBBB\r\nXbbbY\r\nBBBBB\r\nBbbbb\r\nbbbbbOutput:Pack 1\r\nGru gets to keep all bananas!",
  "sample_input": "Input:2\r\n3\r\nbXb\r\nbBb\r\nYBb\r\n5\r\nBBBBB\r\nXbbbY\r\nBBBBB\r\nBbbbb\r\nbbbbbOutput:Pack 1\r\nGru gets to keep all bananas!",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MINVSMIN",
  "scraped_at": "2025-08-17 00:34:12"
}