{
  "problem_code": "problems",
  "title": "Ada and Contact",
  "tags": [],
  "text": "You might already know that Ada the Ladybug has some friends who live on a plumtree. Those friends are numbered from1toN(whereNis the number of her friends). Ada freely travels on the tree from one friend to another. As she passes a friend (with IDi), he/she always tells her \"Hey     Ada! If you meet i+1 or i-1, please give him my phone number.\". Also note that as long as someone obtains phone number of someone else, he distributes it to all friends whose number he/she has.Ada will undertake many walks on the tree (from one friend to another) and she ask you (for each walk), how many independent sets of friends she will make during her walk. The two sets are independent if nobody from one set has a number of someone else in the other set (and vice versa).NOTE:All walks are independent of each other (so no phone-distribution remains from previous walks).InputThe first line will contain two integers1 ≤ N, Q ≤     2×105, the number of Ada's friends and the number of walksThe nextN-1lines will contain two integers1 ≤ a, b ≤     N, meaning that there is a branch (edge) betweenathandbthfriend.The nextQlines will contain two integers1 ≤ a, b ≤     N, meaning that Ada will take walk betweenathandbthfriend.OutputFor each query, print the number of independent sets Ada will create by her walk (counting only friends on her path).Example Input7 6\r\n1 6\r\n1 3\r\n3 5\r\n5 7\r\n3 2\r\n2 4\r\n6 7\r\n1 4\r\n2 5\r\n4 7\r\n3 1\r\n5 5Example Output3\r\n1\r\n2\r\n2\r\n2\r\n1Example Input 26 5\r\n1 4\r\n4 6\r\n1 2\r\n2 5\r\n2 3\r\n6 5\r\n6 3\r\n3 5\r\n2 6\r\n4 5Example Output 22\r\n2\r\n2\r\n3\r\n2Example Input 310 10\r\n7 10\r\n2 10\r\n4 10\r\n1 7\r\n8 7\r\n3 10\r\n9 10\r\n5 8\r\n6 2\r\n4 3\r\n7 7\r\n2 5\r\n7 8\r\n7 6\r\n5 2\r\n4 9\r\n7 3\r\n9 6\r\n8 8Example Output 22\r\n1\r\n4\r\n1\r\n3\r\n4\r\n2\r\n3\r\n3\r\n1",
  "sample_input": "7 6\r\n1 6\r\n1 3\r\n3 5\r\n5 7\r\n3 2\r\n2 4\r\n6 7\r\n1 4\r\n2 5\r\n4 7\r\n3 1\r\n5 5",
  "sample_output": "3\r\n1\r\n2\r\n2\r\n2\r\n1",
  "link": "https://www.spoj.com/problems/ADAPHONE",
  "scraped_at": "2025-08-17 00:34:20"
}