{
  "problem_code": "problems",
  "title": "Angry Siam",
  "tags": [],
  "text": "You have an array ofNproblemsA. Each problem has a difficulty level.i-thproblemhas difficultyA[i].You want to give these problems to HrSiam. But you know, HrSiam doesn't like easy problems, so he will get angry. Also he doesn't want to solve problems with same difficulty again and again.So he also has an arrayangry, withNelements.When he visits a problem with certain difficultyd, his angriness will increase byd × angry[1].After some time if he again visits a problem with same difficulty for the second time, then his angriness will increase byd × angry[2], and so on.Generally, if he visit a problem with certain difficultydfor thei-thtime, his angriness will increase byd × angry[i].In this circumstances, you want to do 2 things:You are afraid that HrSiam may get too angry, so you want to present a part of the array to him. But you need to quickly determine: what will be his total angriness if you present the sub array of problemsA[l...r]to HrSiam?After certain time you may want to change difficulty of a problem, i.e. set difficulty ofx-thproblem toy.InputFirst line there will an integerN, the number of problems you have.Next line will contain the difficulty of the problems, the arrayA[].Next line will contain the arrayangry[]of lengthN.Next line, there will be an integerQ, the number of queries you want to make.NextQlines will describe the queries, in format:t x yIftis one, then you need to find the total angriness of the subarrayA[l...r]when presented to HrSiam. Otherwise you need to setA[x] = y.Constraints1 ≤ N, Q, x, y, A[i], angry[i] ≤ 100000Ifx, yis in query of first type, then1 ≤ x ≤ y ≤ NOutputFor each query of first type, print an integer: the total angriness of the subarray. Solutions to the queries should be printed in the order they appeared in the input.Explanation of SampleIn the first sample, the first query range is[3, 6], the array elements are{3, 3, 1, 1}.When HrSiam see the first problem with difficulty 3, his angriness will increase by3 × angry[1].Then he visit a problem with same difficulty he saw before, for the second time, so add3 × angry[2]Then1 × angry[1]and1 × angry[2]Total = (3 × 1) + (3 × 2) + (1 × 1) + (1 × 2) = 12ExampleInput:8\r\n1 2 3 3 1 1 2 3\r\n1 2 3 4 5 6 7 8\r\n2\r\n1 3 6\r\n1 1 5Output:12\r\n14",
  "sample_input": "Input:8\r\n1 2 3 3 1 1 2 3\r\n1 2 3 4 5 6 7 8\r\n2\r\n1 3 6\r\n1 1 5Output:12\r\n14",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HRSIAM",
  "scraped_at": "2025-08-17 00:34:21"
}