{
  "problem_code": "problems",
  "title": "LCM Pesticide",
  "tags": [],
  "text": "NSlovakistan farmers own neighbouring fields alongside a river, forming a straight line. Each field is infested with (possibly zero) pests.Thanks to ingenious Slovakistan science, each species of pest can be assigned a prime number. Each field can then be assigned a positive number, representative of the pests that are infesting it - the prime factorization of this number indicates which pests are present, with the powers of each prime number representing how strongly the field is infested with that pest.Every pesticide can then be assigned a positive number, which is designed in such a way that its prime factorization indicates what pests it can supress, with the powers of each prime number representing how strong infestations of that pest it is able to handle.To aid their farmers, the government of Slovakistan can select a pest, and then pump a pesticide designed specifically against it into the river, completely supressing that species on all fields. However, due to environmental concerns, they will only use one pesticide at a time - when the government switches to a different pesticide, designed against a different pest, the ones previously supressed return to all fields in full force.On top of that, the farmers union can request pesticide to be sprayed on the fields themselves. Since this is done using an airplane, they can only request pesticide to be sprayed on a contiguous segment of fields.Pesticides with higher numbers are more expensive. Now, for each request the government would like to know the cheapest pesticide they can use to supress all pests on all the fields in the requested segment.InputThe first line contains two integers1 ≤ N ≤ 50000and1 ≤ Q  ≤ 105- the number of fields and the number of events.The second line containsNintegersf1, ...,fN- the numbers assigned to the fields. They will be positive and not greater than105.Qlines follow, describing events in the order in which they happened. Each event is either of the form0 L Ror1 P.If the event is of the form1 P,1 ≤ P ≤ 105, it means that the government of Slovakistan began pumping pesticide against the pest numberP(a prime number) into the river, and are no longer pumping pesticide against the previous pest, if they were doing so. The exception isP = 1, meaning that there is simply no pesticide being pumped into the river. In the beginning, the government is not pumping any pesticide.If the event is of the form0 L R,1 ≤ L ≤ R ≤ N, it means that the farmers requested pesticide to be sprayed on the contiguous segment of fields from theL-th to theR-th, inclusive.OutputFor each event of form0 L R, output the smallest number of pesticide which can handle all infestations on the segment of fields fromLtoR, modulo109+7, taking into account that some pests may be supressed due to the government's aid. More formally, output the least common multiple of the numbersfL, ...,fR, after they have had all factors ofPfrom the last1 Pevent removed, modulo109+7.ExampleInput:10 12\r\n4 2 3 5 6 47 10007 32768 59049 1\r\n0 1 5\r\n0 2 5\r\n1 2\r\n0 1 5\r\n0 2 5\r\n0 6 10\r\n1 3\r\n0 6 10\r\n1 1\r\n0 1 10\r\n0 10 10\r\n0 1 5Output:60\r\n30\r\n15\r\n15\r\n772456932\r\n411740567\r\n342852967\r\n1\r\n60",
  "sample_input": "Input:10 12\r\n4 2 3 5 6 47 10007 32768 59049 1\r\n0 1 5\r\n0 2 5\r\n1 2\r\n0 1 5\r\n0 2 5\r\n0 6 10\r\n1 3\r\n0 6 10\r\n1 1\r\n0 1 10\r\n0 10 10\r\n0 1 5Output:60\r\n30\r\n15\r\n15\r\n772456932\r\n411740567\r\n342852967\r\n1\r\n60",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LCMP",
  "scraped_at": "2025-08-17 00:34:16"
}