{
  "problem_code": "problems",
  "title": "Cable TV Network",
  "tags": [],
  "text": "The interconnection of the relays in a cable TV network is bi-directional. The network is connected if there is at least one interconnection path between each pair of relays present in the network. Otherwise the network is disconnected. An empty network or a network with a single relay is considered connected. The safety factorfof a network withnrelays is:1.n, if the net remains connected regardless the number of relays removed from the net.2. The minimal number of relays that disconnect the network when removed.For example, consider the nets from figure 1, where the circles mark the relays and the solid lines correspond to interconnection cables. The network (a) is connected regardless the number of relays that are removed and, according to rule (1), f=n=3. The network (b) is disconnected when 0 relays are removed, hence f=0 by rule (2). The network (c) is disconnected when the relays 1 and 2 or 1 and 3 are removed. The safety factor is 2.InputThe input starts with a line containing a single integert<= 20, the number of test cases.ttest cases follow.Write a program that computes the safety factor for the cable networks encoded by the data sets. Each data set starts with two integers: 0 <=n<=50,the number of relays in the net, andm, the number of cables in the net. Followmdata pairs (u,v), u < v, where u and v are relay identifiers (integers in the range 0..n-1). The pair (u,v) designates the cable that interconnects the relays u and v. The pairs may occur in any order. Except the (u,v) pairs, which do not contain white spaces, white spaces can occur freely in input. Input data terminate with an end of file and are correct.OutputFor each data set, prints from the beginning of a line, the safety factor of the encoded net.ExampleInput:5\r\n0 0\r\n1 0\r\n3 3 (0,1) (0,2) (1,2)\r\n2 0\r\n5 7 (0,1) (0,2) (1,3) (1,2) (1,4) (2,3) (3,4)Output:0\r\n1\r\n3\r\n0\r\n2",
  "sample_input": "Input:5\r\n0 0\r\n1 0\r\n3 3 (0,1) (0,2) (1,2)\r\n2 0\r\n5 7 (0,1) (0,2) (1,3) (1,2) (1,4) (2,3) (3,4)Output:0\r\n1\r\n3\r\n0\r\n2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CABLETV",
  "scraped_at": "2025-08-17 00:34:09"
}