{
  "problem_code": "problems",
  "title": "The Tall Windmills",
  "tags": [],
  "text": "In the later days of his career Johnny purchased a long and narrow strip of land on which he intended to erect a row of windmills, and live off the electrical energy produced by his little power plant. To his dismay, he soon discovered that he had been badly cheated - throughout most of the year the wind blew lengthwise through the strip, rather than in a perpendicular direction. As a result, the wind was certain to lose most of its force on the first windmill it encountered, leaving all the others idle. Johnny could only see one way of coping with this problem, namely - to vary the height of windmills situated relatively close to each other. More precisely, Johnny intends to build exactlynwindmills along a straight line, with equal spacing (of one Bytelandian furlong) between adjacent windmills. It has been established by a team of experts that if two windmills arekBytelandian furlongs apart from each other, their height must differ by at leastn-kBytelandian yards. No windmill may ever be lower than 1 Bytelandian yard, and some, obviously, may need to be considerably higher. But tall windmills are far more expensive to construct, and thus you have been asked to choose the heights of Johnny's windmills in such a way as to guarantee that the tallest windmill has the minimum possible height.InputInput starts with a single integert, the number of test cases (t≤ 100).ttest cases follow.Each test case consists of exactly one integern(1 ≤n≤ 100) - the number of windmills Johnny intends to construct.OutputFor each test case output a line with exactlynnumbers, denoting the heights of successive windmills given in the order in which they are arranged along the road.ExampleInput:3\r\n1\r\n2\r\n3Output:1\r\n1 2\r\n2 4 1",
  "sample_input": "Input:3\r\n1\r\n2\r\n3Output:1\r\n1 2\r\n2 4 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/WINDMILL",
  "scraped_at": "2025-08-17 00:34:19"
}