{
  "problem_code": "problems",
  "title": "Alpha Centauri Tennis",
  "tags": [],
  "text": "As you may know, planets of Alpha Centauri (if they indeed do exist)\r\nwould provide excellent conditions for intelligent life forms.It is indeed true that there is a small Earthlike planet near Alpha\r\nCentauri, inhabited by a population of no particular significance.\r\nThese humanlike creatures have much in common with us. Living in\r\nsimilar communities and having similar body structure and behavioral\r\npatterns, they unsurprisingly appreciate (approximately) the same\r\ntime-killing activities as we do. One of these, the second most\r\npopular after Alpha Centauri Croquet, is the Alpha Centauri Tennis.Although its rules differ from Earth Tennis, the two player\r\nversion of Alpha Centauri Tennis resembles it in many ways.\r\nSame as Earth Tennis, it is played on a rectangular court\r\ndivided into two parts by a net. Two players, standing on\r\nopposite sides of it, use a stringed racket to hit a ball\r\nback and forth to each other. There are certain rules how\r\nto hit the ball. The player who forces his opponent to\r\nviolate one of these rules wins the current ball. The aim\r\n of both players is to win enough balls to win a game, enough\r\n games to win a set and enough sets to win the whole match.\r\nIn the N player version of the Alpha Centauri Tennis a ball\r\ncan be won by any one of the N players. Although technical\r\ndetails of this can be difficult to imagine, Alpha Centaurians\r\nare extremely inventive.In the general N-player version, players serve in turns, \r\nfollowing order determined before the match. Moreover, \r\nthey shift when starting individual games and sets. For\r\nexample, the players are A, B and C. They are ordered\r\nalphabetically. Player A serves the first ball of the\r\nfirst game. When the ball is won by one of the players, \r\nits B's turn to serve. After the game is won by one of\r\nthe players, player B starts the second game. Finally, \r\nwhen the first set is won by someone, player B starts\r\nthe second set. This repeats, always shifted by one player, \r\nuntil the match ends.For three players the serving order looks as follows:Set 1:Game 1: A, B, C, A, B, C ...Game 2: B, C, A ...Game 3: C, A, B ...Game 4: A, B, C ......Set 2:Game 1: B, C, A, B ...Game 2: C, A, B ...Game 3: A, B, C, A ......There are exact rules for counting the number of\r\nballs/games/sets won by a player.RULES FOR WINNING A GAMEThe state of a game can be described by assigning a non-negative\r\nnumber of points to each of the players. At the beginning of\r\na game, the score of each player is zero.Note: In Earth terminology, 0 points is called \"love\", 1 point\r\nis a \"fifteen\", 2 points is a \"thirty\", 3 points is a \"forty\"\r\nand 4 points is an \"advantage\". Be glad that you don't have to\r\nlearn the Centaurian terminology :)When a player P just won a ball, the new score is determined\r\nby using the first rule from the list that applies to the\r\nsituation.If P currently has 3 points and no other player has more than\r\n2 points, P wins the current game.If P currently has 4 points, he wins the game.If any other player currently has 4 points, that player\r\nloses one point. P gains a point.RULES FOR WINNING A SETThe set is won by the first player that at the same time:won at least 6 games in this set,won at least 2 games more than any other player.RULES FOR WINNING A MATCHThe winner is the first player to win at least three sets.\r\nA set in which no other player won a game counts as two won sets.Problem specificationAn observer from the Intergalactic Tennis Federation was\r\nwatching a tournament in Alpha Centauri Tennis. Being unable\r\n to understand Alpha Centaurian language, he only managed\r\nto write down the winner of each ball. Now, for each match, \r\nknowing the sequence in which the players were winning the\r\nballs, he would like to somehow determine its winner.Inputt - the number of test cases [t ≤ 150]\r\nthan t test cases follows, each corresponding to\r\none match. Each line contains the number of players N [N ≤ 10]\r\nand a string S consisting of uppercase letters [2 ≤ S ≤ 50000].\r\nThe players are represented by the first N letters of the English\r\nalphabet. If the i-th letter of S is X, it means the player X\r\nwon the i-th ball from the begining of the match. You may assume\r\nthat the match transcripts are correct and complete.The order in which the players serve is the same as the order of\r\ntheir letters in the English alphabet.OutputFor each line, output a single character, being the letter of\r\nthe player who won the corresponding match.ExampleInput:1\r\n3 BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBOutput:B(B has won two sets, each of them by winning 6 games, while A and C\r\nwon none. Thus each of these sets counts as two and B has won the match.)",
  "sample_input": "Input:1\r\n3 BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBOutput:B",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ACT",
  "scraped_at": "2025-08-17 00:34:16"
}