{
  "problem_code": "problems",
  "title": "Crane Operator",
  "tags": [],
  "text": "You are the operator of a crane. In the reach of the crane there areNlocations numbered from0toN-1. Initially the location0is empty and each of the other locations contains a box with the respective number (i.e. the box in the locationihas the numberi).You were assigned a task to rearrange the boxes to form a special top-secret configuration. Because of the secrecy the configuration had to be transferred in a special way that only you can understand.The secret configuration is characterized by five numbersq, p, m, dandM. To find out the final box locations you should follow this procedure: Consider the boxes in the order of their numbers. (I.e. the box number1comes first, the block number2second, etc.) The final location for thei-th box will have the numberpi= (ci+ d * x + y) mod N, where:Numbersciare defined by the recurrence equation:c0= 0, ci+ 1 = (ci* q + p) mod m.Numbersxandyare non-negative integers chosen in such a way thatpi≠ Mand no previous box was assigned to the locationpi.If there are more choices forxandysatisfying conditions 1 and 2, choose the one that minimizesy.If there are more choices forxandysatisfying conditions 1, 2 and 3, choose the one that minimizesx.Once you find the secret configuration, you are supposed to rearrange the boxes accordingly. Unfortunately there is almost no room to manipulate the boxes. The only operation you are able to do is to lift a box with the crane and drop it on the location that is currently empty. (Note that there will always be exactly one empty location.)There is one more problem. The whole operation is extremely time-critical and it is imperative that you should achieve the final configuration as soon as possible – i.e. you must reach it using the minimal number of box moves.Task specificationGiven the numbersN, M, q, p, mandd, determine how many described operations (lifting a box and dropping it to the free location) are sufficient and necessary to reach the configuration determined using the procedure above.InputOn the first line of input file there is one numberT– the number of test cases. [T ≤ 7000]Tlines follow, each of them describing one test case. On each of these lines there are six numbersN, M, q, p, manddseparated by spaces. [N, M, d ≤ 1000000] [q, p, m ≤ 10000]OutputFor each test case output one line containing the number of operations sufficient and necessary to reach the final configuration.ExampleInput:1\r\n8 3 5 2 7 4Output:6The recurrence gives the valuesc1= 2, c2= 5, c3= 6, c4= 4, c5= 1, c6= 0andc7= 2.\r\nThe secret configuration is: Box 6 on the location 0, box 5 on the location 1, box 1 on the location 2, location 3 empty, box 4 on the location 4, box 2 on the location 5, box 3 on the location 6 and box 7 on the location 7. We need 6 moves to reach this configuration.",
  "sample_input": "Input:1\r\n8 3 5 2 7 4Output:6",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/COPER",
  "scraped_at": "2025-08-17 00:34:19"
}