{
  "problem_code": "problems",
  "title": "Empodia",
  "tags": [],
  "text": "The ancient mathematician and philosopher Pythagoras believed that reality is\r\nmathematical in nature. Present-day biologists study properties of biosequences. A biosequence is a sequence of M integers, whichcontains each of the numbers 0, 1 ... M - 1,starts with 0 and ends with M - 1, andhas no two elements E, E + 1 in adjacent positions in this order.A subsequence consisting of adjacent elements of a biosequence is called a segment.A segment of a biosequence is called a framed interval if it includes all integers whose\r\nvalues are between the value of the first element, which must be the smallest element in the\r\nsegment, and the last element, which must be the largest and different from the first. A\r\nframed interval is called an empodio if it does not contain any shorter framed intervals.As an example, consider the biosequence (0, 3, 5, 4, 6, 2, 1, 7). The whole biosequence is a\r\nframed interval. However, it contains another framed interval (3, 5, 4, 6) and therefore it is\r\nnot an empodio. The framed interval (3, 5, 4, 6) does not contain a shorter framed interval, so\r\nit is an empodio. Furthermore, it is the only empodio in that biosequence.You are to write a program that, given a biosequence, finds all empodia (plural for empodio)\r\nin that biosequence.Inputt - the number of test cases (t ≤ 20), then t test cases follow.The first line of each test case contains a single integer M: the number\r\nof integers in the input biosequence. The following M lines contain the integers of the\r\nbiosequence in the order of the sequence. Each of these M lines contains a single integer.In one test case, 1000000 ≤ M ≤ 1100000. In all other test cases, 1 ≤ M ≤ 60000.\r\nAdditionally, in 50% of the test cases, M ≤ 2600.OutputThe first line for each test case is to contain one integer H:\r\nthe number of empodia in the input biosequence. The following H lines describe all\r\nempodia of the input biosequence in the order of appearance of the starting point in the\r\nbiosequence. Each of these lines is to contain two integers A and B (in that order) separated\r\nby a space, where the Ath element of the input biosequence is the first element of the\r\nempodio and the Bth element of the input biosequence is the last element of the empodio.ExampleInput:1\r\n8\r\n0\r\n3\r\n5\r\n4\r\n6\r\n2\r\n1\r\n7Output:1\r\n2 5",
  "sample_input": "Input:1\r\n8\r\n0\r\n3\r\n5\r\n4\r\n6\r\n2\r\n1\r\n7Output:1\r\n2 5",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/EMPODIA",
  "scraped_at": "2025-08-17 00:34:07"
}