{
  "problem_code": "problems",
  "title": "Decorate the wall",
  "tags": [],
  "text": "After building his huge villa, Mr. Rich cannot help but notice that\r\nthe interior walls\r\nlook rather blank. To change that, he starts to hang paintings from\r\nhis wonderful collection.\r\nBut soon he realizes that it becomes quite difficult to find a place on\r\nthe wall where a painting\r\ncan be placed without overlapping other paintings. Now he needs\r\na program which would tell him, given the already placed paintings,\r\nwhere to place the next painting without moving any other paintings\r\n(or indicating that this is impossible). Paintings have a rectangular\r\nshape and are to be placed parallel to the side of the wall.\r\nIf you do not mind a nice reward from Mr. Rich, go on and\r\nsolve the problem.InputThe first line of the input file contains a number representing the\r\nnumber of test cases to follow.\r\nEach test case starts with a line containing three numbersn,wandh.nis the number of paintings already hanging on the\r\nwall,wis the width of the wall\r\nandhis the height of the wall.The nextnlines contain 4 integersx1, y1,\r\nx2, y2each (0 ≤ x1< x2≤ w,0 ≤ y1< y2≤ h); the\r\nx-coordinates give\r\nthe distance to the left end of the wall, the y-coordinates give the\r\ndistance to the bottom of the wall.\r\n(x1, y1) is the position of the lower left corner of a painting,\r\n(x2, y2)\r\nis the position of the upper right corner.\r\nThe last line of each test case contains the dimensions of the next\r\npainting\r\nto be placed, first its widthw', then its heighth'(1 ≤ w' ≤ w,1 ≤ h' ≤ h).\r\nYou are not allowed to rotate the painting.You can assume that0 ≤ n ≤ 200and1≤ w, h ≤ 1000000.\r\nMoreover, all paintings already hanging do not overlap.OutputProduce one line of output for each test case. Write \"Fail!\" if\r\nthere is\r\nno place left on the wall where the painting could be placed without\r\noverlapping other paintings.\r\nOtherwise, write the coordinates where the lower left corner of the\r\npainting should be placed.\r\nIn case there is more than one solution, select the solution with\r\na minimum y-coordinate, and\r\nbreak ties using the minimum x-coordinate.ExampleInput:2\r\n1 10 9\r\n5 4 10 9\r\n9 5\r\n2 10 10\r\n5 5 10 10\r\n0 0 4 3\r\n3 4Output:Fail!\r\n4 0This image illustrates the second example test case:",
  "sample_input": "Input:2\r\n1 10 9\r\n5 4 10 9\r\n9 5\r\n2 10 10\r\n5 5 10 10\r\n0 0 4 3\r\n3 4Output:Fail!\r\n4 0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DECORATE",
  "scraped_at": "2025-08-17 00:34:16"
}