{
  "problem_code": "problems",
  "title": "European railroad tracks",
  "tags": [],
  "text": "As you may already know, different countries in Europe use different railroad systems. Not only do they use different voltages for their trains, but also the distance between the two rails (gauge) differs. The following table shows some railway gauges used:Broad gauge (Spain):1674 mmBroad gauge (Portugal):1665 mmBroad gauge (Ireland):1600 mmBroad gauge (Finland):1524 mmBroad gauge (former USSR):1520 mmStandard gauge:1435 mmNarrow gauge (meter gauge):1000 mmA museum has trains from several countries. It needs tracks for every train type in order to show visitors the trains in use. However, since only one train is used at a time, a rail can be used by trains of different types. It follows that forntrains, each requiring a different railway gauge,n + 1rails are sufficient (each train uses the leftmost rail and a rail that has exactly the required distance to it). But sometimes it is possible to save even more rails.Given the required railway gauges, your task is to construct a railway track that can be used by every train and requires the least number of rails. Note that a train can use any two rails, provided the distance between them is right.Input SpecificationThe first line of the input file contains a number representing the number of test cases to follow. Each test case starts with an integern(the number of different railway gauges required). The next line containsnintegers between1000and5000, each defining one required railway gauge.You can assume that1 ≤ n ≤ 8. Moreover, for every test case in the input file, there will be a solution requiring at most5rails.Output SpecificationThe output for each test case consists of three lines:The first line is of the form \"Scenario #X\", where X is the test case number starting with 1. The second line describes the solution your program has found; first your program should print how many rails are needed, followed by a colon, then the positions of each rail in increasing order (the first rail should be at position 0). The third line should be blank. If there are several solutions with the minimum number of rails, any one will do.Sample Input3\r\n4\r\n1524 1520 1609 1435\r\n3\r\n1000 1520 1600\r\n6\r\n1000 2000 3000 4000 1500 2500Sample OutputScenario #1\r\n4: 0 1520 1609 3044\r\n\r\nScenario #2\r\n4: 0 1000 1520 1600\r\n\r\nScenario #3\r\n5: 0 1500 3000 4000 5000",
  "sample_input": "3\r\n4\r\n1524 1520 1609 1435\r\n3\r\n1000 1520 1600\r\n6\r\n1000 2000 3000 4000 1500 2500",
  "sample_output": "Scenario #1\r\n4: 0 1520 1609 3044\r\n\r\nScenario #2\r\n4: 0 1000 1520 1600\r\n\r\nScenario #3\r\n5: 0 1500 3000 4000 5000",
  "link": "https://www.spoj.com/problems/EUROPEAN",
  "scraped_at": "2025-08-17 00:34:18"
}