{
  "problem_code": "problems",
  "title": "Game schedule required",
  "tags": [],
  "text": "Sheikh Abdul really loves football. So you better don't ask how much\r\nmoney he has spent to make famous teams join the annual tournament.\r\nOf course, having spent so much money, he would like to see certain\r\nteams play each other. He worked out a complete list of games\r\nhe would like to see. Now it is your task to distribute these games into rounds\r\naccording to following rules:In each round, each remaining team plays at most one gameIf there is an even number of remaining teams, every team plays\r\nexactly one gameIf there is an odd number of remaining teams, there is exactly\r\none team which plays no game\r\n(it advances with a wildcard to the next round)The winner of each game advances to the next round, the loser is\r\neliminated from the tournamentIf there is only one team left, this team is declared the winner\r\nof the tournamentAs can be proved by induction, in such a tournament withnteams,\r\nthere are exactlyn - 1games required until a winner is\r\ndetermined.Obviously, after round 1, teams may already have been eliminated which should take\r\npart in another game. To prevent this, for each game you also have to\r\ntell which team should win.Input SpecificationThe input file contains several test cases.Each test case starts with an integern(2 ≤ n ≤\r\n1000),\r\nthe number of teams participating in the tournament.\r\nThe followingnlines contain the names of the teams\r\nparticipating in the tournament. You can assume that each team name\r\nconsists of up to25letters of the English alphabet\r\n('a' to 'z' or 'A' to 'Z').Then follown - 1lines, describing the games the sheikh\r\nwould like to see (in any order). Each line consists of the two names of the teams\r\nwhich take part in that game. You can assume that it is always\r\npossible to find a tournament schedule consisting of the given games.The last test case is followed by a zero.Output SpecificationFor each test case, write the game schedule, distributed in rounds.For each round, first write \"Round #X\" (where X is the round number)\r\nin a line by itself. Then write the games scheduled in this round\r\nin the form: \"A defeats B\", where A is the name of the advancing team\r\nand B is the name of the team being eliminated. You may write the games\r\nof a round in any order. If a wildcard is needed\r\nfor the round, write \"A advances with wildcard\" after the last game of the round, where A is the name of\r\nthe team which gets the wildcard. After the last round, write the winner in the format shown below.\r\nPrint a blank line after each test\r\ncase.Sample Input3\r\nA\r\nB\r\nC\r\nA B\r\nB C\r\n5\r\nA\r\nB\r\nC\r\nD\r\nE\r\nA B\r\nC D\r\nA E\r\nC E\r\n0Sample OutputRound #1\r\nB defeats A\r\nC advances with wildcard\r\nRound #2\r\nC defeats B\r\nWinner: C\r\n\r\nRound #1\r\nA defeats B\r\nC defeats D\r\nE advances with wildcard\r\nRound #2\r\nE defeats A\r\nC advances with wildcard\r\nRound #3\r\nE defeats C\r\nWinner: ENote that there is always more than one possible game schedule;\r\nyou may print any of them.",
  "sample_input": "3\r\nA\r\nB\r\nC\r\nA B\r\nB C\r\n5\r\nA\r\nB\r\nC\r\nD\r\nE\r\nA B\r\nC D\r\nA E\r\nC E\r\n0",
  "sample_output": "Round #1\r\nB defeats A\r\nC advances with wildcard\r\nRound #2\r\nC defeats B\r\nWinner: C\r\n\r\nRound #1\r\nA defeats B\r\nC defeats D\r\nE advances with wildcard\r\nRound #2\r\nE defeats A\r\nC advances with wildcard\r\nRound #3\r\nE defeats C\r\nWinner: E",
  "link": "https://www.spoj.com/problems/GAME",
  "scraped_at": "2025-08-17 00:34:21"
}