{
  "problem_code": "problems",
  "title": "Spin",
  "tags": [],
  "text": "The classic Chinese Rings puzzle comes in a variety of forms. The original version has seven rings linked together by a sliding loop threaded through them. The aim is to remove the loop by manipulating the rings.A modern implementation uses seven disks with specially shaped cut-outs mounted on a slide. The slide can move left and right. The slide can always move left until it reaches its left-most position, shown here:A disk can be rotated between horizontal and vertical only if it is positioned over the indentation marked '0'andthe disk on its right is vertical. The right-most disk can always rotate if it is in position '0' since it has no disk on its right.The aim is to free the slide by moving it so its left edge aligns with the 'Win' mark:Your task is to write a program which will take several part-solved puzzles and compute the number of steps needed to move the slide to position 'Win' for each\r\npuzzle.InputThere will be several puzzles in the input file. The first line of the file will contain an integernspecifying the number of puzzles. There will then benlines, each of the form:length orientations positionwherelength(length < 30) is an integer indicating the number of disks on the slide,orientationsis a string oflengthcharacters from the set {h,v} giving the orientation of each disk from left to right (hstands for horizontal, andvfor vertical), andpositionis an integer from 0 tolengthspecifying the numbered mark which aligns with the left edge of the slide.OutputFor each puzzle, your program should output one integer on a line which counts the minimum number of steps needed to win the puzzle. A step is either a movement of the slide, one unit left or right, or the rotation of a disk.ExampleInput:3\r\n2 vv 2\r\n7 vhhhvhh 4\r\n29 vvvvvvvvvvvvvvvvvvvvvvvvvvvvv 29Output:7\r\n357\r\n1073741823Diagram of the first puzzle",
  "sample_input": "Input:3\r\n2 vv 2\r\n7 vhhhvhh 4\r\n29 vvvvvvvvvvvvvvvvvvvvvvvvvvvvv 29Output:7\r\n357\r\n1073741823",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SPIN",
  "scraped_at": "2025-08-17 00:34:15"
}