{
  "problem_code": "problems",
  "title": "Tin Cutter",
  "tags": [],
  "text": "In a Tin Cutting factory there is a machine for cutting parts from tin plates. It has an\r\nextraordinarily sharp knife able to make horizontal or vertical segment cuts in the tin plates. Each\r\ncutting process consists of a sequence of such cuts. Each segment cut is given by its endpoints that\r\nare always located inside the tin plate. During the cutting process some parts of tin plate can fall\r\nout and so some holes in the plate can emerge.Factory management needs to predict the number of holes in the plate at the end of the\r\ngiven sequence of cuts. Write a program that answers this question. Single segment cuts are not\r\nconsidered to be holes.Here there are examples of some situations that can arise after cutting:two holes      two holes      one hole      one holeInputThe input file consists of blocks of lines. Each block except the last\r\ndescribes one cutting process. In the first line of the block there is a number N <= 100.\r\nindicating the number of segment cuts in the cutting process. These cuts are defined by the followingNlines. The line defining one segment cut has the form X1Y1X2Y2where X1Y1and X2Y2are the co-ordinates of the end\r\npoints of the segment cut. They are separated by one space. The co-ordinates\r\nare integers and always define horizontal or vertical segment (i.e. segment parallel\r\nwithxoryaxis).The last block consists of just one line containing 0.OutputThe output file contains the lines corresponding to the blocks in the input\r\nfile. Each such line contains the number of holes that remain in the tin plate after the\r\nexecution of the corresponding cuts.There is no line in the output file corresponding to the\r\nlast \"null\" block of the input file.ExampleInput:4\r\n0 1 1 1\r\n1 1 1 0\r\n1 0 0 0\r\n0 0 0 1\r\n2\r\n0 1 2 1\r\n1 2 1 0\r\n0Output:1\r\n0",
  "sample_input": "Input:4\r\n0 1 1 1\r\n1 1 1 0\r\n1 0 0 0\r\n0 0 0 1\r\n2\r\n0 1 2 1\r\n1 2 1 0\r\n0Output:1\r\n0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TCUTTER",
  "scraped_at": "2025-08-17 00:34:19"
}