{
  "problem_code": "problems",
  "title": "Logic",
  "tags": [],
  "text": "Consider a  10×10  grid. Cells in this grid can contain one of\r\nfive logic operations (AND, OR, NOT,\r\nInput, Output). These can be joined together to form a logic circuit.\r\nGiven a description of a circuit\r\nand a set of boolean values, build the logic circuit and execute the input\r\nstream against it.InputThe first line of the input contains a single integern, which specifies the number of circuits to be\r\nprocessed. There will then bengroups of circuit descriptions and test values.A circuit is made up of a number of operations. Each line describing an operation begins with three\r\ncharacters: the co-ordinates for a cell, 0-9 on theX-axis then 0-9 on theY-axis, followed by a single\r\ncharacter to represent the operation of that cell ('&' for AND, '|' for OR,\r\n'!' for NOT, 'i' for Input and 'o'\r\nfor Output). Optionally following each triple is a set of co-ordinate\r\npairs which represent thexandyco-ordinates of cells that take the output of this cells operation as an input for theirs. This (possibly\r\nempty) output list is terminated by '..'. The list of operations is terminated by a line containing the\r\nword 'end'.Next, for each circuit, comes the set of test values. The first line contains\r\nan integertwhich gives the number of test cases your program must run. Next, there aretlines, each line containing a\r\nsequence of '0' and '1' characters symbolising the input values for one test case. The number of inputs will always correspond to the number of inputs defined by the circuit description. The input\r\nvalues are to be applied to the inputs in the order in which the input\r\noperations were defined in the circuit description.The next circuit description, if any, will then follow.OutputFor each circuit, your program should output one line for each test case given in the input. The line\r\nshould contain one '0' or '1' character for each output defined by the circuit description in the order in\r\nwhich the outputs were defined.Your program should output a blank line after each set of test cases.ExampleInput:1\r\n00i 11 13 ..\r\n02i 11 13 ..\r\n11& 21 ..\r\n21o ..\r\n13| 23 ..\r\n23o ..\r\nend\r\n4\r\n00\r\n01\r\n10\r\n11Output:00\r\n01\r\n01\r\n11Notes:i, o and ! operations will always have exactly one input.& and|operations will always have exactly two inputs.Even if an operation can feed others, it does not have to.No recursive circuits.o can also be an input for another gateHint:Sample input specifies a circuit consisting of an 'AND' and an 'OR' operation\r\nin parallel both fed from the same two inputs:+---------\\\r\n3              |          |OR #----------OUT(2)\r\n               |     +---/\r\n               |     |\r\n2     IN(2)----+     |\r\n               |     |\r\n               +---------\\\r\n1                    |    |AND#----------OUT(1)\r\n                     +---/\r\n                     |\r\n0      IN(1)---------+\r\n\r\n         0                 1              2In grid terms this is two inputs at 0,0 and 1,0. The first input feeds theANDoperation at 1,1 and theORoperation at 1,3. The second input operation feeds the second input for the sameANDandORoperations. TheANDoperation then feeds an output operation at 2,1. TheORoperation also feeds an output operation, this one at 2,3.",
  "sample_input": "Input:1\r\n00i 11 13 ..\r\n02i 11 13 ..\r\n11& 21 ..\r\n21o ..\r\n13| 23 ..\r\n23o ..\r\nend\r\n4\r\n00\r\n01\r\n10\r\n11Output:00\r\n01\r\n01\r\n11",
  "sample_output": "+---------\\\r\n3              |          |OR #----------OUT(2)\r\n               |     +---/\r\n               |     |\r\n2     IN(2)----+     |\r\n               |     |\r\n               +---------\\\r\n1                    |    |AND#----------OUT(1)\r\n                     +---/\r\n                     |\r\n0      IN(1)---------+\r\n\r\n         0                 1              2",
  "link": "https://www.spoj.com/problems/LOGIC",
  "scraped_at": "2025-08-17 00:34:21"
}