{
  "problem_code": "problems",
  "title": "Scanner",
  "tags": [],
  "text": "A body scanner works by scanning a succession of horizontal slices through\r\nthe body; the slices are imaged one at a time. The image slices can be\r\nreassembled to form a three dimensional model of the object. Write a\r\nprogram to construct a two dimensional image slice using data captured\r\nduring the scan.The scanner consists of four arrays of sensors arranged around\r\na10×15matrix. Array 1 consists of 10 sensors pointing to the right,\r\narray 2 has 24 sensors pointing diagonally to the top right, array 3\r\nhas 15 sensors pointing to the top and array 4 has 24 sensors pointing\r\nto the top left. Each sensor records the thickness of that portion of the\r\nobject directly in front of that sensor.Readings from the arrays of sensors are recorded in counterclockwise\r\norder. Within an array of sensors, data are also recorded counterclockwise.\r\nA complete scan consists of 73 readings.InputThe input file begins with a line with an integer indicating the number\r\nof image slices to follow. For each image slice, there are separate lines\r\nwith 10, 24, 15, and 24 integers representing sensor data from sensor\r\narrays 1 through 4 respectively. The order of the readings is indicated\r\nin the diagram. You can assume that there exist at least one image for the given sensor data.OutputFor each slice, your program should print 10 lines of 15 cells. To\r\nindicate that the cell represents a part of the object, print a hash\r\ncharacter (#) for the cell; to indicate that the cell is not a part of\r\nthe object, print a period (.). Between successive output image slices,\r\nprint a blank line.It is possible for the result of a scan to be ambiguous, in that\r\ncase you can print any solution.ExampleInput:1\r\n10 10 6 4 6 8 13 15 11 6\r\n0 1 2 2 2 2 4 5 5 6 7 6 5 6 6 5 5 6 6 3 2 2 1 0\r\n2 4 5 5 7 6 7 10 10 10 7 3 3 5 5\r\n0 0 1 3 4 4 4 4 3 4 5 7 8 8 9 9 6 4 4 2 0 0 0 0Output:.##########....\r\n.##########....\r\n....######.....\r\n......####.....\r\n.......####..##\r\n.......########\r\n#####..########\r\n###############\r\n..#########..##\r\n....######.....",
  "sample_input": "Input:1\r\n10 10 6 4 6 8 13 15 11 6\r\n0 1 2 2 2 2 4 5 5 6 7 6 5 6 6 5 5 6 6 3 2 2 1 0\r\n2 4 5 5 7 6 7 10 10 10 7 3 3 5 5\r\n0 0 1 3 4 4 4 4 3 4 5 7 8 8 9 9 6 4 4 2 0 0 0 0Output:.##########....\r\n.##########....\r\n....######.....\r\n......####.....\r\n.......####..##\r\n.......########\r\n#####..########\r\n###############\r\n..#########..##\r\n....######.....",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SCANNER",
  "scraped_at": "2025-08-17 00:34:17"
}