{
  "problem_code": "problems",
  "title": "Translations",
  "tags": [],
  "text": "Bob Roberts is in charge of performing translations of documents between various languages. To aid\r\nhim in this endeavor his bosses have provided him with translation files. These files come in twos — one\r\ncontaining sample phrases in one of the languages and the other containing their translations into the\r\nother language. However, some over-zealous underling, attempting to curry favor with the higher-ups\r\nwith his initiative, decided to alphabetically sort the contents of all of the files, losing the connections\r\nbetween the phrases and their translations. Fortunately, the lists are comprehensive enough that the\r\noriginal translations can be reconstructed from these sorted lists. Bob has found this is most usually\r\nthe case when the phrases all consist of two words. For example, given the following two lists:Language 1 PhrasesLanguage 2 Phrasesarlo zymbus seatflub plevebus stoppleve dourmhot seatpleve zymschool busBob is able to determine that arlo means hot, zym means seat, ub means school, pleve means bus, and\r\ndourm means stop. After doing several of these reconstructions by hand, Bob has decided to automate\r\nthe process. And if Bob can do it, then so can you.InputInput will consist of multiple input sets. Each input set starts with a positive integer n, n ≤ 250, indicating the number of two-word phrases in each language. This is followed by 2n lines, each containing\r\none two-word phrase: the first n lines are an alphabetical list of phrases in the first language, and the\r\nremaining n lines are an alphabetical list of their translations into the second language. Only upper and\r\nlower case alphabetic characters are used in the words. No input set will involve more than 25 distinct\r\nwords. No word appears as the first word in more than 10 phrases for any given language; likewise, no\r\nword appears as the last word in more than 10 phrases. A line containing a single 0 follows the last\r\nproblem instance, indicating end of input.OutputFor each input set, output lines of the formword1/word2where word1 is a word in the first language and word2 is the translation of word1 into the second\r\nlanguage, and a slash separates the two. The output lines should be sorted according to the first\r\nlanguage words, and every first language word should occur exactly once. There should be no white\r\nspace in the output, apart from a single blank line separating the outputs from different input sets.\r\nImitate the format of the sample output, below. There is guaranteed to be a unique correct translation\r\ncorresponding to each input instance.ExampleInput:4\r\narlo zym\r\nflub pleve\r\npleve dourm\r\npleve zym\r\nbus seat\r\nbus stop\r\nhot seat\r\nschool bus\r\n2\r\niv otas\r\notas re\r\nec t\r\neg ec\r\n0Output:arlo/hot\r\ndourm/stop\r\nflub/school\r\npleve/bus\r\nzym/seat\r\n\r\niv/eg\r\notas/ec\r\nre/t",
  "sample_input": "word1/word2",
  "sample_output": "Input:4\r\narlo zym\r\nflub pleve\r\npleve dourm\r\npleve zym\r\nbus seat\r\nbus stop\r\nhot seat\r\nschool bus\r\n2\r\niv otas\r\notas re\r\nec t\r\neg ec\r\n0Output:arlo/hot\r\ndourm/stop\r\nflub/school\r\npleve/bus\r\nzym/seat\r\n\r\niv/eg\r\notas/ec\r\nre/t",
  "link": "https://www.spoj.com/problems/TRANSL",
  "scraped_at": "2025-08-17 00:34:12"
}