{
  "problem_code": "problems",
  "title": "I Conduit",
  "tags": [],
  "text": "Irv Kenneth Diggit works for a company that excavates trenches, digs holes and generally tears up\r\npeople’s yards. Irv’s job is to make sure that no underground pipe or cable is underneath where\r\nexcavation is planned. He has several different maps, one for each utility company, showing where their conduits lie, and he needs to draw one large, consolidated map combining them all. One approach\r\nwould be to simply draw each of the smaller maps one at a time onto the large map. However, this\r\noften wastes time, not to mention ink for the pen-plotter in the office, since in many cases portions\r\nof the conduits overlap with each other (albeit at different depths underground). What Irv wants is a\r\nway to determine the minimum number of line segments to draw given all the line segments from the\r\nseparate maps.InputInput will consist of multiple input sets. Each set will start with a single line containing a positive\r\ninteger n indicating the total number of line segments from all the smaller maps. Each of the next n\r\nlines will contain a description of one segment in the formatx1y1x2y2where (x1,y1) are the coordinates of one endpoint and (x2,y2) are the coordinates of the other. Coordinate\r\nvalues are floating point values in the range 0 ...1001 specified to at most two decimal places. The\r\nmaximum number of line segments will be 10000 and all segments will have non-zero length. Following\r\nthe last input set there will be a line containing a 0 indicating end of input; it should not be processed.OutputFor each input set, output on a single line the minimum number of line segments that need to be drawn\r\non the larger, consolidated map.ExampleInput:3\r\n1.0 10.0 3.0 14.0\r\n0.0 0.0 20.0 20.0\r\n10.0 28.0 2.0 12.0\r\n2\r\n0.0 0.0 1.0 1.0\r\n1.0 1.0 2.15 2.15\r\n2\r\n0.0 0.0 1.0 1.0\r\n1.0 1.0 2.15 2.16\r\n0Output:2\r\n1\r\n2",
  "sample_input": "Input:3\r\n1.0 10.0 3.0 14.0\r\n0.0 0.0 20.0 20.0\r\n10.0 28.0 2.0 12.0\r\n2\r\n0.0 0.0 1.0 1.0\r\n1.0 1.0 2.15 2.15\r\n2\r\n0.0 0.0 1.0 1.0\r\n1.0 1.0 2.15 2.16\r\n0Output:2\r\n1\r\n2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CONDUIT",
  "scraped_at": "2025-08-17 00:34:24"
}