{
  "problem_code": "problems",
  "title": "Team Rankings",
  "tags": [],
  "text": "It’s preseason and the local newspaper wants to publish a preseason ranking of the teams in the local\r\namateur basketball league. The teams are the Ants, the Buckets, the Cats, the Dribblers, and the\r\nElephants. When Scoop McGee, sports editor of the paper, gets the rankings from the selected local\r\nexperts down at the hardware store, he’s dismayed to find that there doesn’t appear to be total agreement\r\nand so he’s wondering what ranking to publish that would most accurately reflect the rankings he got\r\nfrom the experts. He’s found that finding the median ranking from among all possible rankings is one\r\nway to go.The median ranking is computed as follows: Given any two rankings, for instance ACDBE and\r\nABCDE, the distance between the two rankings is defined as the total number of pairs of teams\r\nthat are given different relative orderings. In our example, the pair B, C is given a different ordering\r\nby the two rankings. (The first ranking has C above B while the second ranking has the opposite.)\r\nThe only other pair that the two rankings disagree on is B, D; thus, the distance between these two\r\nrankings is 2. The median ranking of a set of rankings is that ranking whose sum of distances to all the\r\ngiven rankings is minimal. (Note we could have more than one median ranking.) The median ranking\r\nmay or may not be one of the given rankings.Suppose there are 4 voters that have given the rankings: ABDCE, BACDE, ABCED and ACBDE.\r\nConsider two candidate median rankings ABCDE and CDEAB. The sum of distances from the ranking\r\nABCDE to the four voted rankings is 1 + 1 + 1 + 1 = 4. We’ll call this sum the value of the ranking\r\nABCDE. The value of the ranking CDEAB is 7 + 7+ 7 + 5 = 26.\r\nIt turns out that ABCDE is in fact the median ranking with a value of 4.InputThere will be multiple input sets. Input for each set is a positive integer n on a line by itself, followed\r\nby n lines (n no more than 100), each containing a permutation of the letters A, B, C, D and E,\r\nleft-justified with no spaces. The final input set is followed by a line containing a 0, indicating end of\r\ninput.OutputOutput for each input set should be one line of the form:rankingis the median ranking with valuevalue.Of course ranking should be replaced by the correct ranking and value with the correct value. If there\r\nis more than one median ranking, you should output the one which comes first alphabetically.ExampleInput:4\r\nABDCE\r\nBACDE\r\nABCED\r\nACBDE\r\n0Output:ABCDE is the median ranking with value 4.",
  "sample_input": "Input:4\r\nABDCE\r\nBACDE\r\nABCED\r\nACBDE\r\n0Output:ABCDE is the median ranking with value 4.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TRANK",
  "scraped_at": "2025-08-17 00:34:09"
}