{
  "problem_code": "problems",
  "title": "The lazy programmer",
  "tags": [],
  "text": "A new web-design studio, called SMART (Simply Masters of ART), employs two people. The first one is a web-designer and an executive director at the same time. The second one is a programmer. The director is so a nimble guy that the studio has already gotNcontracts for web site development. Each contract has a deadlinedi.It is known that the programmer is lazy. Usually he does not work as fast as he could. Therefore, under normal conditions the programmer needsbiof time to perform the contract numberi. Fortunately, the guy is very greedy for money. If the director pays himxidollars extra, he needs only(bi- ai*xi)of time to do his job. But this extra payment does not influence other contracts. This means that each contract should be paid separately to be done faster. The programmer is so greedy that he can do his job almost instantly if the extra payment is(bi/ai)dollars for the contract numberi.The director has a difficult problem to solve. He needs to organize programmer’s job and, may be, assign extra payments for some of the contracts so that all contracts are performed in time. Obviously he wishes to minimize the sum of extra payments. Help the director!InputFirst line of the input contains an integert(1≤t≤45), equal to the number of testcases. Then descriptions ofttestcases follow.First line of description contains the number of contractsN(1≤N≤100000, integer). Each of the nextNlines describes one contract and contains integer numbersai,bi,di(1≤ai,bi≤10000;1≤di≤1000000000) separated by spaces.At least90%of testcases will have1≤N≤10000.OutputFor each testcase in the input your program should output one line with a single real number S. Here S is the minimum sum of money which the director needs to pay extra so that the programmer could perform all contracts in time. The number must have two digits after the decimal point.ExampleInput:1\r\n2\r\n20 50 100\r\n10 100 50Output:5.00",
  "sample_input": "Input:1\r\n2\r\n20 50 100\r\n10 100 50Output:5.00",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LAZYPROG",
  "scraped_at": "2025-08-17 00:34:21"
}