{
  "problem_code": "problems",
  "title": "Equatorial Bonfire",
  "tags": [],
  "text": "Some great ideas are never implemented. This was the case with the\r\nequatorial bonfire planned for the millenial celebration. Maybe the plan\r\nwill be rediscovered for the next turn of millenia. Before it is\r\ncompletely forgotten we will tell you about it:\r\nThe idea was to put tarred logs and gun powder contiguously along the\r\nequator and then ignite bonfires at various points of this gun powder belt\r\nat various times. The fire would spread in both directions along the\r\nequator and in the end, the whole equator would burn.One concern of the architects of this celebration was what would be the\r\nlast place to catch fire and when would it happen?InputThe input file consists of at most 10 blocks, each specifying a separate proposal\r\nfor the equatorial bonfire. The first line of each block specifies the\r\nspeed of fire's advance in the degrees of longitude per hour. The next line\r\ncontains the number of bonfiresN ≤ 5000along the equator. Each of the nextNlines contains two numbers specifying the time and the location of\r\na bonfire.The time is given in hours from 12:00am GMT (all times are positive),\r\nthe location is given in the degrees of longitude (greater than -180\r\nand less than or equal to 180). All numbers exceptNare given with\r\nprecision of at most 2 decimal places. Every block is followed by an empty\r\nline. The last block is followed by an empty line and then a line\r\ncontaining-1.OutputFor every block in the input file, output a single line containing the\r\ntime and coordinate of the last place to catch fire. The time and the\r\ncoordinate should be in the same units and from the same range as input, but\r\nwith precision of 3 decimal places. If there are multiple solutions,\r\noutput the one which is the closest if you travel from the zero meridian\r\neast (i.e. in the positive direction).ExampleInput:2\r\n2\r\n1 90\r\n1 -90\r\n\r\n10.0\r\n3\r\n1 40\r\n2 45\r\n6 -80\r\n\r\n-1Output:46.000 0.000\r\n15.500 -175.000Note that in the second case, the fire at 45 degrees actually starts 1.5 hours after 12:00am.\r\nThis of course does does not prevent anybody from igniting it again 2 hours after 12:00am.",
  "sample_input": "Input:2\r\n2\r\n1 90\r\n1 -90\r\n\r\n10.0\r\n3\r\n1 40\r\n2 45\r\n6 -80\r\n\r\n-1Output:46.000 0.000\r\n15.500 -175.000",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BONFIRE",
  "scraped_at": "2025-08-17 00:34:18"
}