{
  "problem_code": "problems",
  "title": "DEL Command",
  "tags": [],
  "text": "It is required to find out whether it is possible to delete given files\r\nfrom MS-DOS directory\r\nexecuting the DEL command of MS-DOS operation system only once.\r\nThere are no nested subdirectories.A noteDEL command has the following format:DELwildcardThe actual wildcard as well as a full file name can be made up either of\r\na name containing 1 up to 8\r\ncharacters or of a name and extension, containing up to 3 characters.\r\nThe point character '.' separates the extension from the file name.\r\nThe extension can be empty and this is equivalent to a\r\nname without any extension (in this case a wildcard ends with a point).\r\nIn a wildcard the characters\r\n'?' and '*' can be used. A question mark substitutes exactly one character\r\nof the full file name\r\nexcluding a point, an asterisk any sequence of characters\r\n(containing no points) even empty one.\r\nAn asterisk can appear only at the last position of the name and the extension.MS-DOS system can permit maybe other wildcards but they can not be used\r\nin this task. File names\r\nand extensions consist only of Latin capitals and digits.InputThe first line of the input is an integer M, then a blank line followed by M datasets. There is a blank line between datasets.Input data for each dataset contains a list of full file names without empty lines\r\nand spaces. Each\r\nname is written in a separate line of input data file and preceded with\r\na control sign: '-' for delete\r\nor '+' for keep. Full file names are not repeated. The list comprises\r\nat least one file, and at least one\r\nfile is marked to be deleted. There are no more than 1000 files.OutputFor each dataset, write to the first line of output the required DEL command\r\n(only one\r\nproposal) orIMPOSSIBLEif there is no solution.\r\nA space should separate \"DEL\" from wildcard.Print a blank line between datasets.ExampleInput:1\r\n\r\n-BP.EXE\r\n-BPC.EXE\r\n+TURBO.EXEOutput:DEL ?P*.*",
  "sample_input": "Input:1\r\n\r\n-BP.EXE\r\n-BPC.EXE\r\n+TURBO.EXEOutput:DEL ?P*.*",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DELCOMM",
  "scraped_at": "2025-08-17 00:34:09"
}