{
  "problem_code": "problems",
  "title": "Awari 2",
  "tags": [],
  "text": "Awari is a one-player game from the Antilles, which is played with boxes and stones instead of cards. A particular variant of Awari is played withNboxes numbered from1toN, each containing at the beginning of the game zero or more stones. The rules of this game are very simple, because there is only one type of valid move, consisting of choosing a box numberedicontaining exactlyistones, and then taking those stones from the box in order to use them to add a single stone to every box numbered1throughi-1; the remaining stone is then kept by the player. These moves are applied in succession as long as there exists a boxicontaining exactlyistones. When this is no longer true, the game ends. The player wins if at this stage every box is empty, and looses otherwise.In the following figure, on the left hand side there is a possible initial state of a game withN = 5boxes (the circles) containingP1= 0,P2= 1,P3= 3,P4= 0andP5= 2stones (the black dots). If box number3, containingP3= 3stones, was chosen to make the next move, then the resulting configuration would be the one shown on the right hand side of the figure. Additionally, the player would now have one stone in his power.Given the initial state of the boxes, you should determine if it is possible to win the game, that is, if there is a sequence of valid moves after which all the boxes are left empty.InputEach test case is described using two lines. The first line contains an integerN, indicating the number of boxes (1 ≤ N≤ 500). The second line containsNinteger numbersPi, representing the number of stones in the boxes at the beginning of the game, from box1to boxNin that order (0≤P_i≤500fori = 1, ..., N). In every test case there is at least one non-empty box, that is there existsifrom1toNsuch thatPi≠ 0. The end of the input is signalled by a line containing the number-1.OutputFor each test case, you should print a single line containing a single character. This character should be the uppercase letter'S'if it is possible to win the game; otherwise, it should be the uppercase letter'N'.Awari is played with N boxes numbered from 1 to N, eachcontaining at the beginning of the game zero or more stones.The rules of this game are very simple, because there is onlyone type of valid move, consisting of choosing a box numbered icontaining exactly i stones, and then taking those stones fromthe box in order to use them to add a single stone to every boxnumbered 1 through i-1; the remaining stone is then kept by theplayer. These moves are applied in succession as long as thereexists a box i containing exactly i stones. When this is nolonger true, the game ends. The player wins if at this stageevery box is empty, and looses otherwise.In the following figure, on the left hand side there is apossible initial state of a game with N = 5 boxes (the circles)containing P_1 = 0, P_2 = 1, P_3 = 3, P4 = 0 and P_5 = 2 stones(the black dots). If box number 3, containing P_3 = 3 stones,was chosen to make the next move, then the resultingconfiguration would be the one shown on the right hand side ofthe figure. Additionally, the player would now have one stonein his power.[IMAGE GOES HERE]Given the initial state of the boxes, you should determine ifit is possible to win the game, that is, if there is a sequenceof valid moves after which all the boxes are left empty.ExampleInput:5\r\n0 1 3 0 2\r\n4\r\n1 1 3 0\r\n3\r\n1 2 3\r\n-1Output:N\r\nS\r\nN",
  "sample_input": "Input:5\r\n0 1 3 0 2\r\n4\r\n1 1 3 0\r\n3\r\n1 2 3\r\n-1Output:N\r\nS\r\nN",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2012A",
  "scraped_at": "2025-08-17 00:34:10"
}