{
  "problem_code": "problems",
  "title": "High Mountains",
  "tags": [],
  "text": "To go on holidays, Horacio and Hernan have sacrificed their participation in an important programming contest. While you are in this contest, they are close to the Andes driving alongHighway 40, in Argentina, enjoying a pleasant view of the mountains in the horizon. Right now the sky over the highway is a clear, uniform blue, while the visible part of the mountains is a profile presenting rich and attractive textures. This worries Horacio and Hernan, because they fear that the pictures they are taking will be very expensive to print correctly. For this reason, in the next stop they will take out their laptops and write a program to estimate the area of the mountain profile that has to be printed in each picture. Can you finish this program before them?Horacio and Hernan will be modeling the mountain profile in the following way. Each mountain is represented by an isosceles triangle whose base rests on theXaxis of theXYplane. Two equal-length sides connect the endpoints of the base to the opposite vertex of the triangle, which is the tip of the corresponding mountain. To describe the position and shape of the triangle, we use the coordinates along theXaxis of the base's endpoints, along with the height of the mountain.The figure below is the model of a mountain profile formed by4mountains that are overlapping with one another. The area of the mountain profile that you have to calculate is marked with stripes. The lowest mountain of the figure is described by the valuesI = 4(the left endpoint of the mountain base),D = 5(the right endpoint of the mountain base)  andH = 1(the height of the mountain).In this problem, you are given the representation of the mountain profile, and you have to find the area of the union of all the corresponding triangles, in such a way that the overlapping parts are counted only once.InputEach test case is described using several lines. The first line contains a single integer numberN, indicating the number of mountains (1 ≤ N ≤ 1000). Each of theNfollowing lines describes a mountain using three integer numbersI,DandH, representing respectively theXcoordinate of the left endpoint of the base, the same for the right endpoint of the base, and the height of the mountain (1 ≤ I, D, H ≤ 105withI < D). In each test case there are no two mountains that are exactly the same (that is, with equal values for the three parametersI,DandH). The end of the input is signalled by a line containing the number-1.OutputFor each test case, you should print a single line containing a rational number, representing the area of the corresponding mountain profile. Round the result to the closest rational with two decimal digits. In case of ties, round up. Note that you should always use exactly two digits after the decimal dot, even if this means ending with a zero.ExampleInput:4\r\n4 5 1\r\n2 4 2\r\n3 5 3\r\n3 7 2\r\n1\r\n1 2 1\r\n2\r\n10 20 20\r\n20 40 10\r\n2\r\n15 25 20\r\n20 40 10\r\n7\r\n99998 99999 25000\r\n99998 100000 50000\r\n99996 100000 100000\r\n1 3 100000\r\n2 5 100000\r\n1 5 60000\r\n1 99999 100000\r\n5\r\n2 3 10\r\n4 5 6\r\n6 8 11\r\n12 14 3\r\n1 13 2\r\n-1Output:6.90\r\n0.50\r\n200.00\r\n190.00\r\n5000331093.88\r\n28.91",
  "sample_input": "Input:4\r\n4 5 1\r\n2 4 2\r\n3 5 3\r\n3 7 2\r\n1\r\n1 2 1\r\n2\r\n10 20 20\r\n20 40 10\r\n2\r\n15 25 20\r\n20 40 10\r\n7\r\n99998 99999 25000\r\n99998 100000 50000\r\n99996 100000 100000\r\n1 3 100000\r\n2 5 100000\r\n1 5 60000\r\n1 99999 100000\r\n5\r\n2 3 10\r\n4 5 6\r\n6 8 11\r\n12 14 3\r\n1 13 2\r\n-1Output:6.90\r\n0.50\r\n200.00\r\n190.00\r\n5000331093.88\r\n28.91",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2012H",
  "scraped_at": "2025-08-17 00:34:22"
}