{
  "problem_code": "problems",
  "title": "Johnny plays with connect 4",
  "tags": [],
  "text": "\"Connect Four is a two-player game in which the players first choose a color and then take turns dropping colored discs from the top into a seven-column, six-row grid. The pieces fall straight down, occupying the next available space within the column. The objective of the game is to connect four of one's own discs of the same color next to each other vertically, horizontally, or diagonally before his opponent.\" – Wikipedia.Johnny plays with the connect-four board, Johnny has N discs and each disc has a number on it. Johnny drops these discs in the board columns. as Johnny was nervous he closed the top of the board and rotated it with different angles, when he rotate the board 90 degree, all pieces slide over their rows till they hit the board boundary or touch another piece. You will be given the board configuration and those rotation angles. And you should write a program that calculates the new discs’ positions.Input FormatInput will start withTnumber of test cases. Followed byTtest cases each test case starts with board dimensionsRandCwhereR(1 <R< 100) is number of rows andC(1 <C< 100) is number of columns, and number of discsN(0 ≤N≤R×C). ThenNlines follow, each contains two integers:Pspecifying the column number (0 ≤P<C) andQspecifying the disc number (0 ≤Q≤ 9). Then you will be given number of rotationsLfollowed byLpositive integers representing the rotation angles, all angles will be anti-clockwise in the main directions (90, 180, and 270) only.Output FormatFor each test case, output the result using the following format:k(the test case number starting at 1) followed by a period (on a line by itself), then the final configuration of the board. Each row on a line by itself, and each cell is either a \".\" (without quotes) if the cell is an empty or a number representing a piece.SampleInput4\r\n2 3\r\n2\r\n0 5\r\n2 9\r\n0\r\n2 3\r\n2\r\n0 5\r\n2 9\r\n1 90\r\n2 3\r\n2\r\n0 5\r\n2 9\r\n1 180\r\n2 3\r\n2\r\n0 5\r\n2 9\r\n2 90 90Output1.\r\n...\r\n5.9\r\n2.\r\n..\r\n.9\r\n.5\r\n3.\r\n...\r\n9.5\r\n4.\r\n...\r\n.95",
  "sample_input": "Input4\r\n2 3\r\n2\r\n0 5\r\n2 9\r\n0\r\n2 3\r\n2\r\n0 5\r\n2 9\r\n1 90\r\n2 3\r\n2\r\n0 5\r\n2 9\r\n1 180\r\n2 3\r\n2\r\n0 5\r\n2 9\r\n2 90 90Output1.\r\n...\r\n5.9\r\n2.\r\n..\r\n.9\r\n.5\r\n3.\r\n...\r\n9.5\r\n4.\r\n...\r\n.95",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LCPC12B",
  "scraped_at": "2025-08-17 00:34:24"
}