{
  "problem_code": "problems",
  "title": "Johnny Studies Genetics",
  "tags": [],
  "text": "DescriptionWhile Johnny was studying a biology course he found a chapter about genetics and he started reading about it. Genetics is the study of genes, and studies what genes are and how they work. Genes are how living organisms inherit features from their ancestors; for example, children usually look like their parents because they have inherited their parents' genes. Genetics tries to identify which features are inherited, and explain how these features are passed from generation to generation. Genes are made from a long molecule called DNA, which is copied and inherited across generations. DNA is made of simple units that line up in a particular order within this large molecule. The order of these units carries genetic information, similar to how the order of letters on a page carries information. A chromosome is an organized structure of DNA. It is a single piece of coiled DNA containing many genes, regulatory elements and other nucleotide sequences. Chromosomes also contain DNA-bound proteins, which serve to package the DNA and control its functions.Johnny decided to run an experiment to simulate the behavior of inheritance of a chromosomeCthat can be modeled as an array of integers each elementC[i]of the array represents a gene of that chromosome. The value of each gene will be between 0 and 1,000,000,006. Since Johnny does not like programming he requested your help to run a simulation for a very large number of generations to check the values of the chromosome afterGgenerations. On each generationTthe value of each gene is the summation of some genes from the generationT-1 mod 1,000,000,007. For example if the chromosome of length 3, has values of genes 4, 7, and 12 initially and the 1stgene in new generation calculated as sum of 1stgene and 2ndgene in previous generation and 2ndgene in new generation calculated as sum of 2ndgene and 3rdgene in previous generation and 3rdgene in new generation calculated as sum of 3rdgene and 1stgene in previous generation. So after 1stgeneration chromosome will be 11, 19, and 16 and after 2ndgeneration chromosome will be 30, 35, and 27 and so on till generationG.Input FormatInput will start withTnumber of test cases. The first line of each test case will contain two integersG, Nwhere 0 <=G< 1018representing number of generations and 1 <=N<= 100 representing length of the chromosome. Followed by a line containingNintegersn[i]separated by space where 0 <=i< N and 0 <=n[i]< 1,000,000,007 representing the value of each gene in the given chromosome. Followed byNlines, each lineistart with integerM[i]representing the number of genes from the previous generation that is going to be added together to get the value of the new geneiat the new generation, followed byM[i]numbersx[j]where 0 <=j<M[i]and 0 <=x[j]<Nrepresenting the indices of genes to be added. The value of the gene at the new generation isOutput FormatFor each test case, output the result using the following format:k.n[0] n[1] …. n[N-1]Wherekis the test case number (starting at 1), a single period, a single space, andn[i]is the value ofithgene afterGgenerations.Sample InputSampleInput1\r\n2 3\r\n4 7 12\r\n2 0 1\r\n2 1 2\r\n2 2 0Output1. 30 35 27",
  "sample_input": "Input1\r\n2 3\r\n4 7 12\r\n2 0 1\r\n2 1 2\r\n2 2 0Output1. 30 35 27",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LCPC12G",
  "scraped_at": "2025-08-17 00:34:16"
}