{
  "problem_code": "problems",
  "title": "Collision Issue",
  "tags": [],
  "text": "When Ronny finished his routines, received a call from the Center of Extraordinary Investigations Defining Excluded Creatures (or CEIDEC by its acronym).CEIDEC found a planet going through the orbit of the Earth at a great velocity, the planet was named Rainbowland by its fancy colors. We don’t know if this planet contains living creatures, what CEIDEC knows is that the collision is almost imminent. However, that’s why the CEIDEC calls you: to create a program that, given three points in the space and assuming that the space only has two dimensions, compute if the three given points makes a perfect triangle, an isosceles triangle or an scalene triangle.In addition, CEIDEC would like to know the angle formed by these three points. Computing this would make the calculations for collision easier to perform. Obviously, CEIDEC will give you a useful formula to discover the angle ? on the triangle knowing the length of sides A, B and C. You must manipulate the following formula in order to get the angle formed by these three points:sqrt( (A2) + (B2) - [ {8 * A3* B3}^(1/3) * sin3(ø) * cot3(ø) * sec2(ø) ] ) = cThat formula will find the angle between the vertex a and b. You must find if a triangle is equilateral, isosceles or scalene and, in addition, you must find the name of the interior angular triangle, knowing that.The sum of all interior angles must be equal to 180°A triangle will be equiangular if all the angles are the same.A triangle will be right triangle if one and only one angle is equal to 90°A triangle will be obtuse if one angle is greater than 90°A triangle will be acute if all the angles are less than 90°Two floating points numbers will be considered equal if their absolute difference is lower than 10-2when rounded, for instance 3.14159265 is rounded to 3.14.InputThe first line contains an integer T, which specifies the number of test cases. Then, will follow the descriptions of T test cases.Each case will contain 3 lines, each of these three lines will contain two numbers, denoting the coordinates (x, y) of every vertex in the triangle. The input must be read from standard input.OutputFor each input case you must print the string \"Scenario #i:\" where i is the test case you are analyzing (starting at 1) followed by the name by side of the triangle and (only for large cases) the name by interior angle of the triangle separated by a single space. The output must be written to standard output.SampleInput4\r\n0 0\r\n0 3\r\n3 0\r\n0 0\r\n0 4\r\n3.464 2\r\n1 1\r\n5 5\r\n4 0\r\n1252 1322\r\n1904 1950\r\n1700 1700OutputScenario #1: Isosceles Right Triangle\r\nScenario #2: Equilateral Equiangular\r\nScenario #3: Scalene Acute\r\nScenario #4: Scalene ObtuseConstraints1 ≤ T ≤ 100-1,000,000 ≤ X ≤ 1,000,000-1,000,000 ≤ Y ≤ 1,000,000",
  "sample_input": "Input4\r\n0 0\r\n0 3\r\n3 0\r\n0 0\r\n0 4\r\n3.464 2\r\n1 1\r\n5 5\r\n4 0\r\n1252 1322\r\n1904 1950\r\n1700 1700OutputScenario #1: Isosceles Right Triangle\r\nScenario #2: Equilateral Equiangular\r\nScenario #3: Scalene Acute\r\nScenario #4: Scalene Obtuse",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CDC12_C",
  "scraped_at": "2025-08-17 00:34:34"
}