{
  "problem_code": "problems",
  "title": "External Falling Objects",
  "tags": [],
  "text": "After Ronny finished the race challenge, he decided to go home. When he arrives, he notice\r\nthat his family is not there, instead, there is a note that says: ”We are at the basement”.\r\nRonny read this and decided to go to the basement. This one is located at some point of the\r\nbackyard, but due to the collision and fusion of the planets, there are objects of the external\r\nplanet falling from the sky, therefore, streets and gardens are full of these objects.\r\nThese objects have different sizes and shapes, but always with the colors of the rainbow. Beside\r\nthis, Ronny’s family will close the basement door after K minutes, to avoid a possible invasion\r\nof the new life forms that are arriving to the Earth. Ronny need to get to the basement before\r\nthese K minutes. You must know that every object has a number, this number represents the\r\ntime that Ronny will take to avoid it. Ronny can move to any of the adjacent position but\r\nnever diagonal. Every step that Ronny make will take 1 second.InputThe first line contains an integer T, which specifies the number of test cases. Then, will follow the descriptions of T test cases.For each test case, there will be a line with 3 integers, H, W and K. H and W are the dimensions of the garden, and K is the time in seconds that Ronny’s family will wait until they lock the door. Then H lines will follow, with W characters each; you may know that:The character ’.’ denotes a free space on the garden.One digit character denotes an object. An object with the number X on it represents that Ronny will take X seconds to avoid it.The character ’R’ indicates the initial position of Ronny in the garden.The character ’D’ indicates the door of the basement where is located Ronny’s family.OutputFor each input case you must print a line with \"Scenario #i: \" where i is the number of the test case that you are evaluating (starting at 1), followed by the minimum time that Ronny will take to reach his family. If it’s impossible to Ronny to reach his family in less than K units of time, then you should print \"Ronny will be destroyed\". (Quotes for clarity)SampleInput:2\r\n2 2 2\r\nR9\r\n1D\r\n3 3 10\r\nR..\r\n42.\r\nD1.Output:Scenario #1: Ronny will be destroyed\r\nScenario #2: 6Constraints1 ≤ T ≤ 1001 ≤ H ≤ 1,0001 ≤ W ≤ 1,0001 ≤ K ≤ 8,000,000",
  "sample_input": "Input:2\r\n2 2 2\r\nR9\r\n1D\r\n3 3 10\r\nR..\r\n42.\r\nD1.Output:Scenario #1: Ronny will be destroyed\r\nScenario #2: 6",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CDC12_E",
  "scraped_at": "2025-08-17 00:34:37"
}