{
  "problem_code": "problems",
  "title": "Drastic Race",
  "tags": [],
  "text": "Rainbowland and planet Earth made a giant and a fancy collision! Now Ronny ran out of the CEIDEC worried and running to search his family, however, when he was running to his car, a\r\nRainbowlandian explode the car, teddy bears flew out of it and Ronny was the first to discover officially that we’re not alone on this universe.Angry about his car explosion, Ronny shouted to the Rainbowlandian all sort of swearings, then, in the blink of an eye, several Rainbowlandians appeared with some strange vehicles describing circles around Ronny and challenging him to do a race to some point of the empty highway. What the Rainbowlandians don’t know is that Ronny got some special compound that gives him super reflexes and he can, with that, overtake the Rainbowlandians by increasing his speed to the limit. However, this compound is very limited so Ronny must to use it wisely. He wants to reach his destination as soon as possible and faster than any other Rainbowlandian chasing him, otherwise, the Rainbowlandian will blow him up as they did with the car.Can you help him to determine whether he can win the race?You should take the following aspects into account:Ronny can use the compound if and only if he is able to.Ronny can restore the compound if and only if he stays still without moving.Ronny can only win if his time is less than the fastest Rainbowland, so, in case of tie, Ronny lose.InputThe first line contains an integer T, which specifies the number of test cases. Then, will follow the descriptions of T test cases.Each case will have 6 integers P, M, V, S, K, D, which denote, respectively, the time that will take to the fastest Rainbowlandian to get to the finish line, the meters up to the finish line, the normal velocity of Ronny, the boost that Ronny acquires when using the compound, the time that he can use the ability and the amount of compound he restores by second. (Have in account that he will not restore the compound more than what is given at the beginning.)OutputFor each case you must print the string \"Scenario #i: \" where i is the test case you’re analyzing (starting at 1) followed by the string \"Ronny wins in time R\" if and only if Ronny is able to win the race, R is the units of time that Ronny takes to win the race, otherwise print \"Ronny will be annihilated\". (Quotes for clarity.)SampleInput2\r\n10 500 40 40 5 1\r\n7 1000 40 40 5 1OutputScenario #1: Ronny wins in time 8\r\nScenario #2: Ronny will be annihilatedConstraints1 ≤ T ≤ 201 ≤ P ≤ 10,0001 ≤ M ≤ 10,0001 ≤ V ≤ M1 ≤ S ≤ M1 ≤ K ≤ 1001 ≤ D ≤ K",
  "sample_input": "Input2\r\n10 500 40 40 5 1\r\n7 1000 40 40 5 1OutputScenario #1: Ronny wins in time 8\r\nScenario #2: Ronny will be annihilated",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CDC12_D",
  "scraped_at": "2025-08-17 00:34:35"
}