{
  "problem_code": "problems",
  "title": "Forbidden Machine",
  "tags": [],
  "text": "Finally Ronny could make it to the safe place, he left his family there and decided to go to this new planet and talk to their King. Ronny know that he can’t do this by himself, so he called every army of the Earth to have a backup in case that things turn out bad.They made it to the new planet, and realize that it was like only rainbows and teddy bears, and just at the entrance there was a sign that said: ”Welcome to Rainbowland”. Ronny and his army went through this planet directly to their castle. At the entrance, a guard wearing a hat colored with rainbow colors, stopped Ronny. He said that Ronny could pass if and only if he could solve a puzzle: The Forbidden Machine Puzzle.This puzzle consists on a machine that takes strings, and then says if the strings are correct. A string is considered correct if it follows the rules of the machine. This rules consists on a sequence of state transitions. Each transition tells the machine that if it was in a state X, it can go to a state Y with a character Z on the string. The machine starts reading from the first position of the string, and each transition move the string one position to the left, so the next position to read it’s the second one. It is important to add that the machine always start on an initial state and a string follows the rules of the machine if and only if this can made it to a final state of the machine, and the string has been read completely. Ronny has a hard time understanding this machine, so he would like you to simulate it, in order to have the correct answer for the guard.Please note that a single state-character combination can lead to several different states.InputThe first line contains an integer T, which specifies the number of test cases. Then, will follow the descriptions of T test cases.Each test case will contain a line with 4 integers, N, M, F and Q. N is the number of states of the machine, M is the number of transitions, F is the number of final states of the machine, and Q it’s the initial state. Then F lines will follow with a single integer E on it, representing that the state E it’s a final state. Then M lines will follow, with 2 integers I and J and a character C; this represents that there exists a transition that goes from state I to state J reading the character C. Then will be a line with an integer S, that indicate the number of strings to process, and S lines will follow, each one with a string A that has to be evaluated by Ronny.OutputFor each input case you must \"Scenario #i:\" where i is the number of the test case that you are evaluating (Starting by 1). Then S lines, with the string and the answer of the machine for that string, if the string is correct, you should output \"Accepted\", and if it’s not, you should output \"Rejected\" (Quotes for clarity).SampleInput2\r\n4 8 1 0\r\n0\r\n0 1 a\r\n1 0 a\r\n1 2 b\r\n2 1 b\r\n0 3 b\r\n3 0 b\r\n3 2 a\r\n2 3 a\r\n3\r\nababbaa\r\nabababab\r\naaaabbbb\r\n6 8 2 0\r\n2\r\n5\r\n0 0 a\r\n0 1 a\r\n1 1 b\r\n1 2 c\r\n1 3 c\r\n3 4 d\r\n4 4 d\r\n4 5 d\r\n5\r\naaabcccc\r\naabbbbcdc\r\nabbcdddcc\r\nacdddddd\r\nabcOutputScenario #1:\r\nababbaa Rejected\r\nabababab Accepted\r\naaaabbbb Accepted\r\nScenario #2:\r\naaabcccc Rejected\r\naabbbbcdc Rejected\r\nabbcdddcc Rejected\r\nacdddddd Accepted\r\nabc AcceptedConstraints1 ≤ T ≤ 1001 ≤ N ≤ 1001 ≤ F, Q, I, J, E ≤ N1 ≤ S ≤ 1001 ≤ |A| ≤ 1000",
  "sample_input": "Input2\r\n4 8 1 0\r\n0\r\n0 1 a\r\n1 0 a\r\n1 2 b\r\n2 1 b\r\n0 3 b\r\n3 0 b\r\n3 2 a\r\n2 3 a\r\n3\r\nababbaa\r\nabababab\r\naaaabbbb\r\n6 8 2 0\r\n2\r\n5\r\n0 0 a\r\n0 1 a\r\n1 1 b\r\n1 2 c\r\n1 3 c\r\n3 4 d\r\n4 4 d\r\n4 5 d\r\n5\r\naaabcccc\r\naabbbbcdc\r\nabbcdddcc\r\nacdddddd\r\nabcOutputScenario #1:\r\nababbaa Rejected\r\nabababab Accepted\r\naaaabbbb Accepted\r\nScenario #2:\r\naaabcccc Rejected\r\naabbbbcdc Rejected\r\nabbcdddcc Rejected\r\nacdddddd Accepted\r\nabc Accepted",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CDC12_F",
  "scraped_at": "2025-08-17 00:34:38"
}