{
  "problem_code": "problems",
  "title": "Blade Master",
  "tags": [],
  "text": "Loda and Maelk are legendary ChefCraft players. They have played so many games that this number doesn't fit in   a standard 32-bit integer type. Today Loda and Maelk are going to sort the things out and find out who is the   greatest ChefCraft player ever. So the great fight is coming. There are a lot of different heroes you may   choose to play ChefCraft. Obviously every hero has his pros and cons. Loda perfectly plays Blade Master. His main skill is to make mirror images of himself to spoof the enemy.As every other popular game ChefCraft is played on a rectangular grid which consists ofNrows andMcolumns. Rows of the grid are numbered by integers from1toN. So the upper row of the   grid has number1and the lower row has numberN. The same holds for columns. They are numbered   by integers from1toMsuch that the most left column has number1while the most right   column has numberM.At the beginning of the game the only Blade Master's image stands on some starting cell(Sx, Sy)where1 ≤ Sx ≤ Nand1 ≤ Sy ≤ M. Then Loda makesTmoves. Maelk knows how the   distribution of images on the grid changes after each Loda's move. This happens according to the following   rules.1.If there is an image standing on the cell(i, j)then the new images appear by the next   rules:LetF(i, j)be the total number of images in the \"cross\" of the cell(i, j). The \"cross\" of   the cell(i, j)is union of all cells in thei-th row of the grid and in thej-th column   of the grid. SoN + M − 1cells belongs to the \"cross\".LetX = F(i, j) mod 6, that isXis the remainder of the division ofF(i, j)by6.For every possible value ofXwe have following values:D1,D2,P1andP2.D1andD2may be equal to one of the4values['U', 'R', 'D', 'L']and mean   some two directions. Here'U'meansup,'R'meansright,'D'meansdownand'L'meansleft.P1andP2are integer numbers.New mirror images will appear at every cell in the directionD1with the periodP1starting   from cell(i, j)and in the directionD2with the periodP2also starting from the cell(i, j). Of course, no images will appear out of the grid. For example, ifD1 = 'U'andP1 =   2then images appear at the cells(i − 2, j), (i − 4, j), (i − 6, j), and so   on.Loda always use the same values forD1andD2. Namely,D1 = 'U', D2 = 'D'forX = 0,D1 = 'L', D2 = 'R'forX = 1,D1 = 'U', D2 = 'R'forX = 2,D1 = 'R', D2 = 'D'forX = 3,D1 = 'D', D2 = 'L'forX = 4,D1 = 'L', D2 = 'U'forX = 5.But valuesP1andP2may vary for different games. But once chosen they will be the same for   all moves.2.Appearing of new mirror images happens immediately.3.Whenever there is more than one image at the cell they start one on one fights. In each fight two   images participate and both die. So if the number of images in the cell was even than all images will   disappear in the end, otherwise exactly one image will remain at this cell.Now Maelk wants to choose his hero in order to win the fight. The most important thing he needs to know for   this is how the number of images changes during Loda's moves. So he asks you for help. Denote byC(t)the number of images on the grid after thet-th Loda's move fortfrom1toT. For   convenience we denoteC(0) = 1with meaning that0-th move is the putting of the only Blade   Master's image at the starting cell. Maelk wants you to calculate the sumC(0) + C(1) + ... + C(T).   Since Maelk doesn't know what to expect from Loda he would like to know the answer for several values ofT. As you remember the total number of games played by Maelk and Loda at ChefCraft doesn't fit in a   standard 32-bit integer type. Of course, the same can hold for the number of moves in their final fight. Since   Maelk plays ChefCraft the whole life he is not strong in math and can't calculate such large sums. So let's   help him to win the final fight and become the only ChefCraft master ever.InputThe first line of the input contains three space separated integersN,MandQ. HereNandMare sizes of the grid described above andQis the number of Maelk's queries. The   second line contains two space separated integersSxandSy, row index and column index of the   starting position of the first image. Each of the following six lines contains two space separated integers,   the valuesP1andP2for the correspondingX, that is,i-th line among these six   lines contains valuesP1andP2forX = i − 1. Each of the followingQlines contains a single integerT, the number of Loda's moves for the corresponding Maelk's query.OutputFor every Maelk's query output on a separate line the numbers of images Maelk will see during Loda's move.ConstrainsNandMare positiveN•M≤341≤Sx≤N1≤Sy≤M1≤P1,P2≤max{N, M}1≤Q≤1001≤T≤1016ExampleInput:3 3 3\r\n1 1\r\n1 1\r\n1 1\r\n1 1\r\n1 1\r\n1 1\r\n1 1\r\n1\r\n2\r\n3Output:4\r\n12\r\n17ExplanationThe initial grid looks as follows:100000000Here '1' represents a cell with an image and '0' represents a free cell.After the first move grid is111000000After the second move grid is101111111Finally, after the third move we have011101010So after the first move Maelk will see3images, after the second move –8images and   after the third move –5images. Hence the answers forT = 1, 2, 3are1 + 3 = 4,1 + 3 + 8 = 12and1 + 3 + 8 + 5 = 17respectively.",
  "sample_input": "Input:3 3 3\r\n1 1\r\n1 1\r\n1 1\r\n1 1\r\n1 1\r\n1 1\r\n1 1\r\n1\r\n2\r\n3Output:4\r\n12\r\n17",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BMASTER",
  "scraped_at": "2025-08-17 00:34:14"
}