{
  "problem_code": "problems",
  "title": "Halt The War",
  "tags": [],
  "text": "The war was terrible, thousands of humans and rainbow people lying down on the streets.\r\nRonny didn’t know what to do, so he decided to go and search for the Rainbowland Castle\r\nand talk to the King. The rainbowlandians stared at Ronny with caution, waiting him to do\r\nsomething bad just to get him and rainbow-kill him. Finally, Ronny made it to the King’s room\r\nand talked to him about stopping this horrible war. The King accepted Ronny’s proposal, but\r\nonly with one condition, Ronny needed to prove once again what human beings were capable\r\nof. The King said that if Ronny answered the Q queries that he had for him about an order\r\nline of rainbow people numbered from 1 to N , he and his nation would go away. These rainbow\r\npeople had a letter with a number on it (Initially this number it’s 0).There are two types of queries, modification queries and answer queries. The modification\r\nqueries consists on, given an interval from A to B inclusive ([A,B]), Ronny needed to update\r\nthose rainbow people’s letter, adding one to the number on it; so, by instance, if the interval is\r\n[1,2], then Ronny needed to add one to the first and second rainbowlandian on the line. The\r\nanswer queries consists on, given an interval from A to B inclusive, Ronny should say the sum\r\nof every rainbow people’s letter.If Ronny can do this, the humans are saved! So he need your help, because he is not really that\r\ngood in maths and fast sums.InputThe first line contains an integer T, which specifies the number of test cases. Then will follow\r\nthe descriptions of T test cases.For each test case you will get an integer N and an integer Q, that represents the number of\r\nrainbowlandian in the line and the number of queries the King asks for. Then, Q lines will\r\nfollow, each containing a string and 2 integers, the type of query, that can be \"modification\"\r\nor \"answer\" (Quotes for clarity), the first and the last rainbowlandian that Ronny must have<\r\nin mind in order to answer the query.OutputFor each input case you must print the string \"Scenario #i:\" where i is the number of the\r\ntest case (Starting by 1), followed by Q lines with the answer of each query. If the query was\r\na modification query, then you should output \"OK\" (Quotes for clarity), otherwise, output the\r\nsum of the number from A to B inclusive.SampleInput:2\r\n4 4\r\nanswer 1 4\r\nmodification 1 2\r\nmodification 2 3\r\nanswer 2 2\r\n8 6\r\nmodification 2 4\r\nmodification 4 8\r\nmodification 4 5\r\nanswer 8 8\r\nmodification 5 7\r\nanswer 4 8Output:Scenario #1:\r\n0\r\nOK\r\nOK\r\n2\r\nScenario #2:\r\nOK\r\nOK\r\nOK\r\n1\r\nOK\r\n11Constraints1 ≤ T ≤ 1001 ≤ N ≤ 100,0001 ≤ Q ≤ 100,000",
  "sample_input": "Input:2\r\n4 4\r\nanswer 1 4\r\nmodification 1 2\r\nmodification 2 3\r\nanswer 2 2\r\n8 6\r\nmodification 2 4\r\nmodification 4 8\r\nmodification 4 5\r\nanswer 8 8\r\nmodification 5 7\r\nanswer 4 8Output:Scenario #1:\r\n0\r\nOK\r\nOK\r\n2\r\nScenario #2:\r\nOK\r\nOK\r\nOK\r\n1\r\nOK\r\n11",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CDC12_H",
  "scraped_at": "2025-08-17 00:34:10"
}