{
  "problem_code": "problems",
  "title": "Basic Grapes Instinct",
  "tags": [],
  "text": "Dickie is cropping grapes for Christmas! He’s very excited about the traditional grape eating race on December 31th, so he picked every possible raceme of grape in his farm and collect them in a big bucket. Nevertheless, he’s having a serious problems ordering the racemes because there are so many of them!In order to organize in a efficient way the humongous amount of grape racemes, he decided to build a stemplot out of them. A stemplot goes as follows:The input values for a stemplot are a sequence of numbers and a stem unit.Data is classified based on the stem value, i.e., if a number in the sequence is 403 and the stem unit is 100, then this number is classified in the category 4.For each category, a list of leaf values are render in a single line, sorted in increasing order.Stem values and leaves are separated by a | (pipe character). All | should be vertically aligned.Stem values are sorted in increasing order, omitting empty stems.Given the sequence s = { 44 46 47 49 63 64 66 68 68 72 72 75 76 81 84 88 106 }, the stemplot generated with a stem unit of 10 is rendered as follow:4 | 4 6 7 9\r\n       6 | 3 4 6 8 8\r\n       7 | 2 2 5 6\r\n       8 | 1 4 8\r\n      10 | 6Dickie is having big trouble rendering these stemplots of grape racemes, can you do the job for him and save the traditional grape race of December 31th?InputThe first line contains an integer T, which specifies the number of test cases. Then, will follow the descriptions of T test cases.The first line of each case will contain 2 integers N and U, indicating the size of the sequence and the stem unit. Next N lines will contain a single element of the sequence si.OutputFor each case you should print the string \"Scenario #i:\" where i is the test case you are evaluating (starting from 1), a new line, and then the corresponding stemplot following the rules stated above. Print a blank line after each stemplot.SampleInput2\r\n17 10\r\n44\r\n46\r\n47\r\n49\r\n63\r\n64\r\n66\r\n68\r\n68\r\n72\r\n72\r\n75\r\n76\r\n81\r\n84\r\n88\r\n106\r\n5 23\r\n1\r\n9\r\n127\r\n23\r\n73OutputScenario #1:\r\n 4 | 4 6 7 9\r\n 6 | 3 4 6 8 8\r\n 7 | 2 2 5 6\r\n 8 | 1 4 8\r\n10 | 6\r\n\r\nScenario #2:\r\n0 | 1 9\r\n1 | 0\r\n3 | 4\r\n5 | 12Subtask 1 - 30%1 ≤ T ≤ 1001 ≤ N ≤ 1001 ≤ U ≤ 1001 ≤ si ≤ 1,000Subtask 2 - 70%1 ≤ T ≤ 1001 ≤ N ≤ 10,0001 ≤ U ≤ 1,0001 ≤ si ≤ 1,000",
  "sample_input": "4 | 4 6 7 9\r\n       6 | 3 4 6 8 8\r\n       7 | 2 2 5 6\r\n       8 | 1 4 8\r\n      10 | 6",
  "sample_output": "Input2\r\n17 10\r\n44\r\n46\r\n47\r\n49\r\n63\r\n64\r\n66\r\n68\r\n68\r\n72\r\n72\r\n75\r\n76\r\n81\r\n84\r\n88\r\n106\r\n5 23\r\n1\r\n9\r\n127\r\n23\r\n73OutputScenario #1:\r\n 4 | 4 6 7 9\r\n 6 | 3 4 6 8 8\r\n 7 | 2 2 5 6\r\n 8 | 1 4 8\r\n10 | 6\r\n\r\nScenario #2:\r\n0 | 1 9\r\n1 | 0\r\n3 | 4\r\n5 | 12",
  "link": "https://www.spoj.com/problems/VPL0_B",
  "scraped_at": "2025-08-17 00:34:08"
}