{
  "problem_code": "problems",
  "title": "Entmoot",
  "tags": [],
  "text": "'Hoo, ho! Good morning, Merry and Pippin!' he boomed, when he saw them. 'You sleep long. I have been many a hundred strides already today. Now we will have a drink, and go to Entmoot.''Where is Entmoot?' Pippin ventured to ask.'Hoo, eh? Entmoot?' said Treebeard, turning round. 'It is not a place, it is a gathering of Ents - which does not often happen nowadays. But I have managed to make a fair number promise to come.'Indeed, Entmoot cannot be thought of as any particular place, since where it occurs changes from time to time. The choice of the location however, follows a basic principle: Although the Ents (walking and talking Trees - \"shepherds of Fangorn Forest\") are by and large not hasty, when it comes to gathering for Entmoot, they would like to choose a location that ensures all the Ents can reach as soon as possible.Note however, that the speed they can travel varies from Ent to Ent. Also, although Fangorn Forest has dense overgrowth, with regard to the Ents, the forest poses no obstacles.You are given the locations of N Ents who have agreed to join in for Entmoot, as well as their speeds. You need to find out where Entmoot will occur. Formally, given the (xi, yi) along with speed sifor each Ent, find the point (X, Y) such that the maximum time taken by any of the Ents to reach (X, Y) is minimized. Output the earliest time when all the Ents can meet.InputThe first line contains T, the number of test cases.The first line of each test case contains N, the number of Ents.The next N lines contain three space-separated integers each. The ith of these lines contains : xi, yi, si.OutputOutput one line per test case, containing the earliest time when the Ents can meet. Relative and absolute error of 10-4are acceptable.Constraints:1 ≤ T ≤ 102 ≤ N ≤ 50-1,000,000 ≤ xi, yi≤ 1,000,0001 ≤ si≤ 1,000,000SampleInput4\r\n3\r\n0 3 3\r\n4 0 4\r\n-3 -4 5\r\n3\r\n0 10 2\r\n0 20 2\r\n0 40 2\r\n3\r\n0 100 15\r\n0 -100 15\r\n8 0 7\r\n3\r\n0 0 1\r\n10000 0 1\r\n5000 8661 1Output1.000000\r\n7.500000\r\n6.666667\r\n5773.751357Notes/Explanation of SampleIn the first test case, all the ents can meet at origin in 1 unit of time.In the second test case, the first and the third ent reach (25, 0) after 7.5 units of time, whereas the second ent reaches there after 2.5 units of time and waits for the remaining ents to arrive.In the third test case, all the ents can meet at origin in 100/15 units of time.",
  "sample_input": "Input4\r\n3\r\n0 3 3\r\n4 0 4\r\n-3 -4 5\r\n3\r\n0 10 2\r\n0 20 2\r\n0 40 2\r\n3\r\n0 100 15\r\n0 -100 15\r\n8 0 7\r\n3\r\n0 0 1\r\n10000 0 1\r\n5000 8661 1Output1.000000\r\n7.500000\r\n6.666667\r\n5773.751357",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/AMR12C",
  "scraped_at": "2025-08-17 00:34:11"
}