{
  "problem_code": "problems",
  "title": "Help Bob",
  "tags": [],
  "text": "Bob loves Pizza but is always out of money. One day he reads in the newspapers that his favorite pizza restaurant,\r\nAlfredo's Pizza Restaurant, is running a competition: they will donate a big pizza to the first person who will tell\r\nthem the lowest price per area that can be achieved by buying any of the pizzas at most once. \"That task is easy!\",\r\nthinks Bob, \"For each pizza I just calculate the average price and the lowest quotient will be the answer.\".Unfortunately the problem is a bit more complicated: with some pizzas Alberto gives out discount coupons for getting\r\nanother pizza cheaper and even worse, those coupons can be combined. The pizzas have to be bought one after the other,\r\nand it is not possible to use a coupon to get a discount retrospectively for a pizza which has already been bought.\r\nCan you help Bob to become the first to solve this task and to get a pizza for free?InputThe input file contains several test cases. Each test case starts with a numberm, the number of pizzas\r\nAlfredo offers. Input is terminated bym=0. Otherwise,1 ≤ m ≤ 15. Then followmlines describing the pizzas. Each of those following lines describes pizzai(1 ≤ i ≤ m)\r\nand starts with 3 integer numberspi,aiandnispecifying\r\nthe price of the pizza, its area and the number of discount coupons you get when buying it,1 ≤ pi≤ 10000,1 ≤ ai≤ 10000and0 ≤ ni< m.\r\nThen follownipairs of integer numbersxi,jandyi,jspecifying\r\nthe indexxi,j(1 ≤ xi,j≤ m, xi,j≠ i) of the pizza you get a\r\ndiscount coupon for and the discount in percentage termsyi,j(1 ≤ yi,j≤ 50)\r\nyou get when buying pizzaxi,j.\r\nYou may assume that for eachithe valuesxi,jare pairwise distinct.OutputFor each test case print one line containing the lowest price per area that can be achieved by buying any of the pizzas\r\nat most once. Round this number to 4 places after the decimal point. Note that you can combine an arbitrary number of\r\ndiscount coupons: for a pizza with price 10 and two discount coupons for that pizza with a 50 and a 20 on it, you would\r\nonly have to pay 10 × 0.8 × 0.5 = 4 monetary units.ExampleInput:1\r\n80 30 0\r\n2\r\n200 100 1 2 50\r\n200 100 0\r\n5\r\n100 100 2 3 50 2 50\r\n100 100 1 4 50\r\n100 100 1 2 40\r\n600 600 1 5 10\r\n1000 10 1 1 50\r\n0Output:2.6667\r\n1.5000\r\n0.5333",
  "sample_input": "Input:1\r\n80 30 0\r\n2\r\n200 100 1 2 50\r\n200 100 0\r\n5\r\n100 100 2 3 50 2 50\r\n100 100 1 4 50\r\n100 100 1 2 40\r\n600 600 1 5 10\r\n1000 10 1 1 50\r\n0Output:2.6667\r\n1.5000\r\n0.5333",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HELPBOB",
  "scraped_at": "2025-08-17 00:34:26"
}