{
  "problem_code": "problems",
  "title": "Transportation",
  "tags": [],
  "text": "Blue Mary, the queen of Protoss, is planning a war against Zerg. Before the war she plans to make her base as safe as possible. Now there areN(1<=N<= 60) nexuses available in the region controlled by Protoss, numbered 1, 2 ...N. (Those who don't know what nexus is, please visitBlizzard Entertainment.) All the mineral and vespene gas stored in nexusican be transported directly to nexusSi.(iandSiwon't be the same.) Blue Mary's base is nexus 1, So all the mineral and vespene gas can be transported to base 1 directly or indirectly.Blue Mary defines the safety of nexusi,R(i), as the following:Ciandkare numeral constants which will be given in the input file.Suppose for a fixedi, set T={P1, P2, P3... Pw}, thenxis a member of T if and only if Sxisi. Any two Pjs must be different.Now Blue Mary wants to modify at mostM(0<=M<=N)Sis, so that the safety of her baseR(1)is maximized. To be a terran captive, also a great programmer, you must help her to solve this problem. Price is your life. Be careful! Blue Mary tells you thatS1can't be modified. Don't ask your queen about the reason please.InputTen test cases(given one after another, you have to process all!). For each test case:The first line containsN,Mand a real numberk(0.3<=k<1). The second line containsNspace separated integersSi. The third line containsNpositive real numbersCi.There is a single blank line between consecutive test cases.OutputFor each test case:A single line - the maximized safety of nexus 1, rounded to two decimal places.ExampleInput:4 1 0.5\r\n2 3 1 3\r\n10.0 10.0 10.0 10.0\r\n[and 9 test cases more]Output:30.00\r\n[and 9 test cases more]HintBefore modifying, the safety of the 4 bases are 22.8571, 21.4286,25.7143,10, respectively.After modifyingS2to 1, the safety of the 4 bases are 30, 25, 15, 10, respectively.",
  "sample_input": "Input:4 1 0.5\r\n2 3 1 3\r\n10.0 10.0 10.0 10.0\r\n[and 9 test cases more]Output:30.00\r\n[and 9 test cases more]",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TRANSP1",
  "scraped_at": "2025-08-17 00:34:24"
}