{
  "problem_code": "problems",
  "title": "Party of Cloaked Killers",
  "tags": [],
  "text": "N(1 ≤N≤ 100000) perfect killers (we number them 1, 2, 3, ...N) meet at Blue Mary's house. Every killer has a kind of skill - cloak. No one can see them when they are cloaked - except only a small group of people, which will be discussed later.We can group these killers intoM(M≥ 3) groups, called group number 1, group number 2, group number 3, etc. If killer A is in group numberxand killer B is in group number (X%M+1), A can see B even if B is cloaked. This prevent killers from doing some bad things without the risk of being punished.To keep their identity secret, every killer keep cloaked during the party. After the party, Blue Mary asked everyone a question, \"Which killers can you see in the party?\" Although some killers forget some person they have ever seen during the party, Blue Mary collects extremely much information. Now she needs you help to determine the value ofM, because no killer is willing to share this value with her.InputTen test cases (given one after another, you have to process all!). For each test case:The first line contains two integersNandE(1 ≤E≤ 180000). E lines follow, each line contains two space-separated integers A and B - killer number A can see killer number B even if he is cloaked.OutputFor each test case, output one line:If the information given is contradictory, output one line \"-1 -1\". Otherwise output the largest and the smallest possible value ofM, separated by a single space.ExampleInput:6 5\r\n1 2\r\n2 3\r\n3 4\r\n4 1\r\n3 5\r\n3 3\r\n1 2\r\n2 1\r\n2 3\r\n[and 8 test cases more]Output:4 4\r\n-1 -1\r\n[and 8 test cases more]Warning: large input/output data, be careful with certain languages",
  "sample_input": "Input:6 5\r\n1 2\r\n2 3\r\n3 4\r\n4 1\r\n3 5\r\n3 3\r\n1 2\r\n2 1\r\n2 3\r\n[and 8 test cases more]Output:4 4\r\n-1 -1\r\n[and 8 test cases more]",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PARTY2",
  "scraped_at": "2025-08-17 00:34:16"
}