{
  "problem_code": "problems",
  "title": "Eclipse",
  "tags": [],
  "text": "Every so often we hear on the news that there is going to be either a solar or lunar eclipse. Eclipses\r\nhave a long history dating back well into the BC’s. Astronomers study total solar eclipses very closely\r\nas they provide the rare opportunity to observe the corona.An eclipse occurs when two celestial bodies and a star are (nearly) linearly aligned and the shadow\r\ncast by the one body intersects the other body, creating darkness on the latter body.We are interested in determining when a solar eclipse will next occur. In Figure 1 you can see two\r\nlabelled regions. The umbra is the area of total darkness — a body in this region will experience a total\r\nsolar eclipse. The penumbra is the area of partial darkness — a body in this region will experience a\r\npartial solar eclipse.You will be given the size and location of a star and two celestial bodies. Your task is to determine if\r\nthe first celestial body creates a solar eclipse on the second celestial body. If it does then you are to\r\ndetermine whether it is a total or partial eclipse and whether the entire body is in eclipse. If part of\r\nthe body is experiencing total eclipse while the entire body is experiencing at least a partial eclipse,\r\nwe are only interested in the part that is in total eclipse.Consider a scaled model of our solar system with the sun at the origin (0, 0, 0) with radius 700, the\r\nmoon at position (49900, 1000, 149700) with radius 2 and Earth at position (50000, 1000, 150000) with\r\nradius 7. In Figure 1, the sun would be the star on the left and the moon would be the smaller body\r\non the right. Part of Earth would then fall in the black umbra region and hence partly experience a\r\ntotal solar eclipse.For any body:1 ≤ r ≤ 1060 ≤ x, y, z ≤ 109It is guaranteed that any two bodies will be at least 1\r\nunit apart, and that moving any one of the bodies by 1\r\nunit (in any direction) will not change the answer.InputA test case is described by three lines, each describing the size and location of a single body. The\r\nfirst line contains four space-separated integers xs, ys, zs and rs , describing the center (xs, ys, zs) and\r\nradius rs of the star. The following two lines define the two celestial bodies in the same manner.Test cases follow directly after one another with a −1 representing the end of the test cases.OutputEach test case has a single line of output describing the type of eclipse for that case. If the second\r\ncelestial body listed in the test case is experiencing an eclipse, then one of the following lines must be\r\noutput:Entire total solar eclipsePart total solar eclipseEntire partial solar eclipsePart partial solar eclipseIf there is no solar eclipse, the line “No solar eclipse” must be output.ExampleInput:0 0 0 700\r\n49900 1000 149700 2\r\n50000 1000 150000 7\r\n0 0 0 10\r\n50 0 100 40\r\n60 0 200 1\r\n-1Output:Part total solar eclipse\r\nEntire total solar eclipse",
  "sample_input": "Input:0 0 0 700\r\n49900 1000 149700 2\r\n50000 1000 150000 7\r\n0 0 0 10\r\n50 0 100 40\r\n60 0 200 1\r\n-1Output:Part total solar eclipse\r\nEntire total solar eclipse",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ECLIPSE",
  "scraped_at": "2025-08-17 00:34:21"
}