{
  "problem_code": "problems",
  "title": "Subdividing a Land",
  "tags": [],
  "text": "Indigo Real-estate Company is now planning to develop a new housing complex. The entire complex is a square,\r\nall of whose edges are equallyameters. The complex containsnsubdivided blocks, each of which is ab-meter\r\nsquare. Here bothaandbare positive integers.However the project is facing a big problem. In this country, a percentage limit applies to the subdivision of a\r\nland, under the pretext of environmental protection. When developing a complex, the total area of the subdivided\r\nblocks must not exceed 50% of the area of the complex; in other words, more than or equal to 50% of the newly\r\ndeveloped housing complex must be kept for green space. As a business, a green space exceeding 50% of the\r\ntotal area is adead space. The primary concern of the project is to minimize it.Of course purchasing and developing a land costs in proportion to its area, so the company also wants to minimize\r\nthe land area to develop as the secondary concern. You, a member of the project, were assigned this task, but can\r\nno longer stand struggling against the problem with your pencil and paper. So you decided to write a program to\r\nfind the pair of minimumaandbamong those which produce the minimum dead space for givenn.InputThe input consists of multiple test cases. Each test case comes in a line, which contains an integern. You may\r\nassume 1 ≤n≤ 10000.The end of input is indicated by a line containing a single zero. This line is not a part of the input and should not\r\nbe processed.OutputFor each test case, output the case number starting from 1 and the pair of minimumaandbas in the sample\r\noutput.You may assume bothaandbfit into 64-bit signed integers.ExampleInput:1\r\n2\r\n0Output:Case 1: 3 2\r\nCase 2: 2 1",
  "sample_input": "Input:1\r\n2\r\n0Output:Case 1: 3 2\r\nCase 2: 2 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LAND",
  "scraped_at": "2025-08-17 00:34:13"
}