{
  "problem_code": "problems",
  "title": "Revenge of Voronoi",
  "tags": [],
  "text": "A discrete Voronoi diagram is a derivation of a Voronoi diagram. It is represented as a set of pixels. Each of the\r\ngeneratrices lies on the center of some pixel. Each pixel belongs to the generatrix nearest from the center of the\r\npixel in the sense of Manhattan distance. The Manhattan distance d between two points (x1,y1) and (x2,y2) is\r\ngiven by the following formula:d= |x1-x2| + |y1-y2|Your task is to find a set of generatrices which generates a given discrete Voronoi diagram. In the given diagram,\r\neach generatrix is given a unique lowercase letter as its identifier, and each pixel is represented by the identifier\r\nof the generatrix the pixel belongs to. If a pixel has multiple generatrices at the same distance from its center, it\r\nbelongs to the generatrix with the most preceding identifier among them (i.e. the smallest character code).InputThe input consists of multiple test cases.Each test case begins with a line containing two integersW(1 ≤W≤ 32) andH(1 ≤H≤ 32), which denote the\r\nwidth and height of the discrete Voronoi diagram.The followingHlines, each of which consists ofWletters, give one discrete Voronoi diagram. Each letter\r\nrepresents one pixel.The end of input is indicated by a line with two zeros. This is not a part of any test cases.OutputFor each test case, print the case number and the coordinates of generatrices as shown in the sample output. Each\r\ngeneratrix line should consist of its identifier,x-coordinate, andy-coordinate. Generatrices should be printed in\r\nalphabetical order of the identifiers. Each coordinate is zero-based where (0, 0) indicates the center of the top-left\r\ncorner pixel of the diagram.You may assume that every test case has at least one solution. If there are multiple solutions, any one is acceptable.Print a blank line after every test case including the last one.ExampleInput:4 3\r\nooxx\r\nooxx\r\nooxx\r\n4 1\r\nnull\r\n4 4\r\naabb\r\naabb\r\nccdd\r\nccdd\r\n0 0Output:Case 1:\r\no 0 0\r\nx 2 0\r\n\r\nCase 2:\r\nl 2 0\r\nn 0 0\r\nu 1 0\r\n\r\nCase 3:\r\na 0 0\r\nb 2 0\r\nc 0 2\r\nd 2 2",
  "sample_input": "Input:4 3\r\nooxx\r\nooxx\r\nooxx\r\n4 1\r\nnull\r\n4 4\r\naabb\r\naabb\r\nccdd\r\nccdd\r\n0 0Output:Case 1:\r\no 0 0\r\nx 2 0\r\n\r\nCase 2:\r\nl 2 0\r\nn 0 0\r\nu 1 0\r\n\r\nCase 3:\r\na 0 0\r\nb 2 0\r\nc 0 2\r\nd 2 2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/VORONOI",
  "scraped_at": "2025-08-17 00:34:20"
}