{
  "problem_code": "problems",
  "title": "Slink",
  "tags": [],
  "text": "Slitherlink is a puzzle published by Nikoli, the Japanese company that\r\n   popularized Sudoku. Slitherlink puzzles are gaining momentum, and books of\r\n   Slitherlink puzzles have started showing up around the world. The puzzles\r\n   are simple to understand, but can be challenging to solve. The puzzle is\r\n   simply a rectangular grid of dots that forms a collection of cells, every\r\n   cell being either blank or containing an integer from zero to three. The\r\n   challenge is to connect the dots with line segments to form a cycle (a\r\n   connected path such that every vertex has precisely two incident edges), in\r\n   such a way that every cell with a value has exactly the number of incident\r\n   edges as the digit it contains. Cells with no value may have any number of\r\n   incident edges. A valid Slitherlink puzzle always contains sufficient\r\n   non-empty cells to guarantee a unique solution. Below is an example from the\r\n   Nikoli web site of a Slitherlink puzzle and its solution.It was shown by Takayuki Yato at the University of Tokyo that the general\r\n   Slitherlink problem is NP-complete. (If you are not familiar with this\r\n   concept, informally it means there is no \"efficient\" algorithm to solve the\r\n   problem.) With a slight modification and some simple heuristics, however,\r\n   programmatic solutions are possible. Our new puzzle, which we will term\r\n   Slink, differs from Slitherlink only in that the puzzle may not have empty\r\n   cells. That is, every cell must specify the number of incident edges. Below\r\n   is the Slitherlink puzzle above converted to Slink (the added numbers are\r\n   shown in gray). Note that the solution does not change, only the information\r\n   given in the puzzle itself.The heuristics for solving Slink arise from the nature of the puzzle\r\n   itself. For example, consider a cell containing a zero. There must be no\r\n   incident edges, therefore all edges incident to all zeros can be immediately\r\n   removed from consideration as part of the solution path. Consider a three\r\n   next to a zero. Because all the edges incident to the zero will be\r\n   eliminated, the common edge shared with the three is also eliminated. But\r\n   that leaves only three edges around the three, and therefore those three\r\n   edges must be part of the solution path. The following table specifies the\r\n   heuristic rules that must be properly applied to solve a Slink puzzle. The\r\n   \"x\" characters between vertices mark edges that are not part of the solution\r\n   path, while line segments between vertices mark edges that form part of the\r\n   solution. Grey elements are the pattern the rule is based on, black elements\r\n   indicate the additional edges that should be included or excluded if the\r\n   rule is matched. Note that the pictured examples are for demonstration\r\n   purposes only and donotillustrate every possible arrangement of the\r\n   stated rule!ExamplesRule SpecificationThe easiest and most obvious of all the rules. Cells containing a\r\n         zero have no incident edges, so all the edges around a zero should be\r\n         removed from consideration as part of the solution path.If a cell contains the valuenand onlynincident\r\n         edges remain (i.e. have not been eliminated), then thenremaining edges must be part of the solution path. Two examples of\r\n         this occurring are shown here.If a cell contains the valuenandnincident edges\r\n         have already been included in the path, the remaining edges can be\r\n         eliminated. Two examples of this occurring are shown here.If two 3's are adjacent to one another, the common edge between\r\n         the cells as well as the outer edges of both cells are part of the\r\n         solution path. One example of this arrangement occurring is shown\r\n         here.If two 3's occur diagonally adjacent, the opposing corners as\r\n         shown here must be part of the solution path. One example of such an\r\n         arrangement is shown here.If an edge enters a vertex for which only a single exit remains,\r\n         that exit must be part of the solution path. One such example is shown\r\n         here.If a vertex has two incident edges, the other edges can be\r\n         eliminated from consideration as part of the solution path. One such\r\n         example is shown here.If any vertex has three incident edges excluded, the fourth\r\n         incident edge can be excluded as well. One possible arrangement of\r\n         this occurring is shown here.A 3 for which two of the exits are blocked as shown, such as in a\r\n         corner of the puzzle, must include the two edges incident to the\r\n         blocked vertex.If the exits at one corner of a 2 are blocked, and one exit at an\r\n         adjacent vertex around the 2 is also blocked, then the unblocked exit\r\n         at that adjacent vertex must be part of the solution path. One example\r\n         of this arrangement is shown here.A 1 for which the exit paths at one of its incident vertices are\r\n         both blocked as shown, such as might occur in the corner of the\r\n         puzzle, must also eliminate the other two edges incident to that\r\n         vertex as shown.If the solution path enters the corner of a 3, and the exit that\r\n         goes away from the 3 at that same corner is blocked, then the two\r\n         edges around the three incident to the opposite corner must be part of\r\n         the solution path.If a 3 and 1 are diagonally adjacent, and the corner of the 3\r\n         furthest from the 1 has the exit segments blocked as shown, then the\r\n         edges incident to the far corner of the 1 becomes blocked. The\r\n         opposite is also true; if the far corner of the 1 had been blocked,\r\n         then the exit segments at the far corner of the 3 would become blocked\r\n         in the same manner.If the solution path enters the corner of 2 and the path leading\r\n         away from the 2 at the same corner is blocked, then if one of the\r\n         paths leading away from the 2 at the diagonally opposite corner is\r\n         also blocked, the other edge leading away from the 2 at that same\r\n         corner must be part of the solution path. One example of this\r\n         arrangement occurring is shown here.If the solution path enters the corner of a 1, and the exit that\r\n         goes away from the 1 at that same corner is blocked, then the two\r\n         edges around the three incident to the opposite corner must be\r\n         eliminated from the solution path.InputThe input for this problem is a set of Slink puzzles to be\r\n   solved. The first line of a Slink problem's input contains two integers,randc, separated by a space, the number of rows and the\r\n   number of columns in the puzzle. The nextrrows of the input containcintegers, space delimited, valued from 0 to 3, which specify the\r\n   content of the puzzle. The minimum dimension of a puzzle is 2 by 2 cells,\r\n   and the maximum dimension is 20 by 20 cells. It is guaranteed that a unique\r\n   solution to every input puzzle exists and can be determined with the above\r\n   rules if a rule is always applied when it can be applied. A line with values\r\n   of zero forrandcmarks the end of the input.OutputThe output for this problem is a graphical representation\r\n   of the Slink puzzle solution. The first data set is 1, the second data set\r\n   is 2, etc. On a line by itself display the data set number, followed by the\r\n   solution in exactly the format demonstrated below. Vertical edges are output\r\n   as the vertical bar '|' character, horizontal edges are output as dash '-'\r\n   characters, vertices where the path changes direction are output as plus\r\n   signs '+', and cell numbers are always displayed with a blank to the left\r\n   and to the right. Further, surround the entire output with a border made up\r\n   of hash marks '#' such that the number in the upper left cell of the puzzle\r\n   always occurs four positions to the right of the border and three position\r\n   below the border, and the number in the lower right cell always occurs four\r\n   positions to the left of the border and three positions above the\r\n   border.ExampleInput:8 8\r\n1 0 1 1 2 2 1 3\r\n3 3 3 3 2 3 3 2\r\n2 2 0 1 1 2 2 0\r\n2 3 1 1 0 1 2 2\r\n2 1 2 3 1 1 0 2\r\n1 2 2 2 2 3 2 1\r\n3 2 1 3 1 1 3 2\r\n1 0 0 2 3 2 3 2\r\n6 6\r\n0 0 1 1 0 0\r\n0 2 2 2 2 0\r\n1 2 0 0 2 1\r\n1 2 0 0 2 1\r\n0 2 2 2 2 0\r\n0 0 1 1 0 0\r\n2 2\r\n2 2\r\n2 2\r\n3 5\r\n3 3 3 2 3\r\n1 2 1 3 2\r\n3 3 2 2 2\r\n0 0Output:1\r\n#####################################\r\n#                                   #\r\n#                 +---------------+ #\r\n#   1   0   1   1 | 2   2   1   3 | #\r\n# +---+   +---+   |   +---+   +---+ #\r\n# | 3 | 3 | 3 | 3 | 2 | 3 | 3 | 2   #\r\n# |   +---+   +---+   |   +---+     #\r\n# | 2   2   0   1   1 | 2   2   0   #\r\n# +-------+           +-------+     #\r\n#   2   3 | 1   1   0   1   2 | 2   #\r\n# +-------+   +---+           +---+ #\r\n# | 2   1   2 | 3 | 1   1   0   2 | #\r\n# |       +---+   |   +---+       | #\r\n# | 1   2 | 2   2 | 2 | 3 | 2   1 | #\r\n# |   +---+   +---+   |   +---+   | #\r\n# | 3 | 2   1 | 3   1 | 1   3 | 2 | #\r\n# +---+       +---+   |   +---+   | #\r\n#   1   0   0   2 | 3 | 2 | 3   2 | #\r\n#                 +---+   +-------+ #\r\n#                                   #\r\n#####################################\r\n2\r\n#############################\r\n#                           #\r\n#                           #\r\n#   0   0   1   1   0   0   #\r\n#         +-------+         #\r\n#   0   2 | 2   2 | 2   0   #\r\n#     +---+       +---+     #\r\n#   1 | 2   0   0   2 | 1   #\r\n#     |               |     #\r\n#   1 | 2   0   0   2 | 1   #\r\n#     +---+       +---+     #\r\n#   0   2 | 2   2 | 2   0   #\r\n#         +-------+         #\r\n#   0   0   1   1   0   0   #\r\n#                           #\r\n#                           #\r\n#############################\r\n3\r\n#############\r\n#           #\r\n# +-------+ #\r\n# | 2   2 | #\r\n# |       | #\r\n# | 2   2 | #\r\n# +-------+ #\r\n#           #\r\n#############\r\n4\r\n#########################\r\n#                       #\r\n# +---+   +---+   +---+ #\r\n# | 3 | 3 | 3 | 2 | 3 | #\r\n# |   +---+   |   |   | #\r\n# | 1   2   1 | 3 | 2 | #\r\n# |   +---+   +---+   | #\r\n# | 3 | 3 | 2   2   2 | #\r\n# +---+   +-----------+ #\r\n#                       #\r\n#########################",
  "sample_input": "Input:8 8\r\n1 0 1 1 2 2 1 3\r\n3 3 3 3 2 3 3 2\r\n2 2 0 1 1 2 2 0\r\n2 3 1 1 0 1 2 2\r\n2 1 2 3 1 1 0 2\r\n1 2 2 2 2 3 2 1\r\n3 2 1 3 1 1 3 2\r\n1 0 0 2 3 2 3 2\r\n6 6\r\n0 0 1 1 0 0\r\n0 2 2 2 2 0\r\n1 2 0 0 2 1\r\n1 2 0 0 2 1\r\n0 2 2 2 2 0\r\n0 0 1 1 0 0\r\n2 2\r\n2 2\r\n2 2\r\n3 5\r\n3 3 3 2 3\r\n1 2 1 3 2\r\n3 3 2 2 2\r\n0 0Output:1\r\n#####################################\r\n#                                   #\r\n#                 +---------------+ #\r\n#   1   0   1   1 | 2   2   1   3 | #\r\n# +---+   +---+   |   +---+   +---+ #\r\n# | 3 | 3 | 3 | 3 | 2 | 3 | 3 | 2   #\r\n# |   +---+   +---+   |   +---+     #\r\n# | 2   2   0   1   1 | 2   2   0   #\r\n# +-------+           +-------+     #\r\n#   2   3 | 1   1   0   1   2 | 2   #\r\n# +-------+   +---+           +---+ #\r\n# | 2   1   2 | 3 | 1   1   0   2 | #\r\n# |       +---+   |   +---+       | #\r\n# | 1   2 | 2   2 | 2 | 3 | 2   1 | #\r\n# |   +---+   +---+   |   +---+   | #\r\n# | 3 | 2   1 | 3   1 | 1   3 | 2 | #\r\n# +---+       +---+   |   +---+   | #\r\n#   1   0   0   2 | 3 | 2 | 3   2 | #\r\n#                 +---+   +-------+ #\r\n#                                   #\r\n#####################################\r\n2\r\n#############################\r\n#                           #\r\n#                           #\r\n#   0   0   1   1   0   0   #\r\n#         +-------+         #\r\n#   0   2 | 2   2 | 2   0   #\r\n#     +---+       +---+     #\r\n#   1 | 2   0   0   2 | 1   #\r\n#     |               |     #\r\n#   1 | 2   0   0   2 | 1   #\r\n#     +---+       +---+     #\r\n#   0   2 | 2   2 | 2   0   #\r\n#         +-------+         #\r\n#   0   0   1   1   0   0   #\r\n#                           #\r\n#                           #\r\n#############################\r\n3\r\n#############\r\n#           #\r\n# +-------+ #\r\n# | 2   2 | #\r\n# |       | #\r\n# | 2   2 | #\r\n# +-------+ #\r\n#           #\r\n#############\r\n4\r\n#########################\r\n#                       #\r\n# +---+   +---+   +---+ #\r\n# | 3 | 3 | 3 | 2 | 3 | #\r\n# |   +---+   |   |   | #\r\n# | 1   2   1 | 3 | 2 | #\r\n# |   +---+   +---+   | #\r\n# | 3 | 3 | 2   2   2 | #\r\n# +---+   +-----------+ #\r\n#                       #\r\n#########################",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SLINK",
  "scraped_at": "2025-08-17 00:34:25"
}