{
  "problem_code": "problems",
  "title": "Svada",
  "tags": [],
  "text": "The local zoo has acquired a large open garden in which animals may freely move as in their natural\r\nhabitats and entertain visitors with their usual shenanigans.The most popular animals are monkeys. With their climbing and jumping and other skills, they delight\r\nold and young visitors alike.One species of monkey has specialized in climbing tall trees and picking off coconuts. Another species\r\nhas specialized in breaking them open.There are N monkeys of the first type (numbered 1 through N) and M monkeys of the second type\r\n(numbered 1 through M).Monkey k of the first type takes Ak seconds to find a good spot on the tree, after which it picks off its\r\nfirst coconut. After that the monkey produces a new coconut every Bk seconds.Monkey k of the second type takes Ck seconds to find a good tool for opening the coconuts, after\r\nwhich it opens its first coconut. After that the monkey opens another coconut every Dk seconds.Unfortunately, the second type of monkey is extremely aggressive so the two types may not be in the\r\ngarden at the same time. Therefore, zoo keepers will chase away the first type of monkeys as soon as\r\nthey have picked off all the coconuts. Similarly, if monkeys of the same type stay too long after opening\r\nall the coconuts, fights will ensue. Because of that, zoo keepers will send them away as soon as they\r\nhave opened all the coconuts.The zoo keepers first arrive immediately after all coconuts have been picked, and again immediately\r\nafter the monkeys open them all. The time needed for monkeys to enter or leave the garden is also\r\nnegligibly small.Tomislav especially likes the second type of monkey, but can never guess when to arrive in order to see\r\nthem. Help him calculate the time when the second type arrives if he knows the total time that\r\nmonkeys spent in the garden, but does not know the number of coconuts in the garden.InputThe first line contains the integer T (1 ≤ T ≤ 1 000 000 000), the total time that monkeys spent in the\r\ngarden, in seconds.The next line contains the integer N (1 ≤ N ≤ 100), the number of monkeys of the first type.Each of the following N lines contains two integers Ak and Bk (1 ≤ Ak, Bk ≤ 1 000 000 000), how fast\r\nmonkey k of the first type is.The next line contains the integer M (1 ≤ M ≤ 100), the number of monkeys of the second type.Each of the following M lines contains two integers Ck and Dk (1 ≤ Ck, Dk ≤ 1 000 000 000), how fast\r\nmonkey k of the second type is.OutputOutput the number of seconds between the arrival of the first type of monkeys and the arrival of the\r\nsecond type.ExampleInput:20\r\n2\r\n3 2\r\n1 3\r\n3\r\n3 1\r\n4 1\r\n5 1Output:13",
  "sample_input": "Input:20\r\n2\r\n3 2\r\n1 3\r\n3\r\n3 1\r\n4 1\r\n5 1Output:13",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SVADA",
  "scraped_at": "2025-08-17 00:34:24"
}