{
  "problem_code": "problems",
  "title": "Monster Trap",
  "tags": [],
  "text": "Once upon a time when people still believed in magic, there was a great wizard Aranyaka Gondlir.\r\nAfter twenty years of hard training in a deep forest, he had finally mastered ultimate magic, and\r\ndecided to leave the forest for his home.Arriving at his home village, Aranyaka was very surprised at the extraordinary desolation. A gloom\r\nhad settled over the village. Even the whisper of the wind could scare villagers. It was a mere\r\nshadow of what it had been.What had happened? Soon he recognized a sure sign of an evil monster that is immortal. Even\r\nthe great wizard could not kill it, and so he resolved to seal it with magic. Aranyaka could cast a\r\nspell to create a monster trap: once he had drawn a line on the ground with his magic rod, the line\r\nwould function as a barrier wall that any monster could not get over. Since he could only draw\r\nstraight lines, he had to draw several lines to complete a monster trap, i.e., magic barrier walls\r\nenclosing the monster. If there was a gap between barrier walls, the monster could easily run away\r\nthrough the gap.For instance, a complete monster trap without any gaps is built by the barrier walls in the left\r\nfigure, where “M” indicates the position of the monster. In contrast, the barrier walls in the right\r\nfigure have a loophole, even though it is almost complete.Your mission is to write a program to tell whether or not the wizard has successfully sealed the\r\nmonster.InputThe input consists of multiple data sets, each in the following format.The first line of a data set contains a positive integer n, which is the number of the line segments\r\ndrawn by the wizard. Each of the following n input lines contains four integers x, y, x', and\r\ny', which represent the x– and y–coordinates of two points (x, y) and (x', y') connected by a line\r\nsegment. You may assume that all line segments have non–zero lengths. You may also assume that\r\nn is less than or equal to 100 and that all coordinates are between −50 and 50, inclusive.For your convenience, the coordinate system is arranged so that the monster is always on the origin\r\n(0, 0). The wizard never draws lines crossing (0, 0).You may assume that any two line segments have at most one intersection point and that no three\r\nline segments share the same intersection point. You may also assume that the distance between\r\nany two intersection points is greater than 10−5.An input line containing a zero indicates the end of the input.OutputFor each data set, print “yes” or “no” in a line. If a monster trap is completed, print “yes”.\r\nOtherwise, i.e., if there is a loophole, print “no”.ExampleInput:8\r\n-7 9 6 9\r\n-5 5 6 5\r\n-10 -5 10 -5\r\n-6 9 -9 -6\r\n6 9 9 -6\r\n-1 -2 -3 10\r\n1 -2 3 10\r\n-2 -3 2 -3\r\n8\r\n-7 9 5 7\r\n-5 5 6 5\r\n-10 -5 10 -5\r\n-6 9 -9 -6\r\n6 9 9 -6\r\n-1 -2 -3 10\r\n1 -2 3 10\r\n-2 -3 2 -3\r\n0Output:yes\r\nno",
  "sample_input": "Input:8\r\n-7 9 6 9\r\n-5 5 6 5\r\n-10 -5 10 -5\r\n-6 9 -9 -6\r\n6 9 9 -6\r\n-1 -2 -3 10\r\n1 -2 3 10\r\n-2 -3 2 -3\r\n8\r\n-7 9 5 7\r\n-5 5 6 5\r\n-10 -5 10 -5\r\n-6 9 -9 -6\r\n6 9 9 -6\r\n-1 -2 -3 10\r\n1 -2 3 10\r\n-2 -3 2 -3\r\n0Output:yes\r\nno",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MONSTER",
  "scraped_at": "2025-08-17 00:34:28"
}