{
  "problem_code": "problems",
  "title": "Changing Maze",
  "tags": [],
  "text": "Luke Skywalker and his sister/love interest Leia are trying to get through a killer maze. And I\r\nmean killer! Every time step, the boundaries change. If our twins/lovebirds ever visit a square the\r\nsame time a boundary appears, they’re toast. There is no need to panic; the Force will guide them\r\nthrough the maze, and they will not die. However, the Force needs to know what advice to give\r\nand is therefore asking you for help.Luke and Leia begin in the northwest corner of a maze. They want to make it to the southeast\r\ncorner of the maze. At any given time step, Luke and Leia can move one square north, south, east,\r\nor west, or they can stay where they are. At every time step, the boundaries of the maze change:\r\nthere is a finite list of patterns; if Luke and Leia are still in the maze when the list of patterns\r\nis exhausted, the maze cycles through again from the beginning of the list. You need to compute\r\nwhether Luke and Leia can make it to the southeast corner of the maze, and, if so, the minimum\r\nnumber of time steps necessary for them to get there. Remember, the Force is counting on you! If\r\nyou give the Force bad advice, we’ll have to wait around for A Newer Hope and Force Knows how\r\nlong that could take!InputThe input consists of several test cases. Each case (but the last) will begin with a line containing\r\nthree decimal integers. The first is the number of rows in the maze; the second is the number of\r\ncolumns in the maze; the third is the number of patterns in the list. The first two numbers will\r\nbe inclusively between 1 and 20; the third will be inclusively between 1 and 10. The integers will\r\nbe separated by exactly one space and will be followed by one <EOL>. Immediately following this\r\nline will be a number of patterns, equal to the number specified on the first line. Each pattern will\r\nconsist of r lines each containing c characters, where r is the number of rows and c is the number\r\nof columns indicated on the first line. Each character will be either 0 (indicating no boundary) or\r\n1 (indicating a boundary). Each line will be terminated by <EOL>, and an extra <EOL> will follow\r\neach pattern. The northwest corner of the first pattern will always be zero, since Luke and Leia\r\nwill be starting from there. The last case will be three zeros, separated by exactly one space and\r\nfollowed by exactly one <EOL>. This case is not to be processed; it indicates the end of input.OutputThe output cases are to appear in the same order in which they appear in the input. Each output\r\ncase should be of the formCase c: Luke and Leia can escape in s steps.or of the formCase c: Luke and Leia cannot escape.c and s are decimal integers. c in the number of the\r\ncase being processed (starting with 1) and s is the minimum number of time steps Luke and Leia\r\nrequire to reach the southeast corner. Each line should be terminated by exactly one <EOL>.ExampleInput:5 5 1\r\n00000\r\n00000\r\n00000\r\n00000\r\n00000\r\n5 5 2\r\n00000\r\n00000\r\n00000\r\n00000\r\n00000\r\n01110\r\n01110\r\n11111\r\n01110\r\n01110\r\n0 0 0Output:Case 1: Luke and Leia can escape in 8 steps.\r\nCase 2: Luke and Leia cannot escape.",
  "sample_input": "Input:5 5 1\r\n00000\r\n00000\r\n00000\r\n00000\r\n00000\r\n5 5 2\r\n00000\r\n00000\r\n00000\r\n00000\r\n00000\r\n01110\r\n01110\r\n11111\r\n01110\r\n01110\r\n0 0 0Output:Case 1: Luke and Leia can escape in 8 steps.\r\nCase 2: Luke and Leia cannot escape.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CHMAZE",
  "scraped_at": "2025-08-17 00:34:11"
}