{
  "problem_code": "problems",
  "title": "Yoda Goes Palindromic !",
  "tags": [],
  "text": "According to a very famous web site, which in this case we will trust, defines a palindrome\r\nas ‘a word, phrase, verse, or sentence that reads the same backward or forward’. For\r\nexample, the phrase A man, a plan, a canal, Panama! is a palindrome. Actually, writing\r\ntexts consisting of only palindromes is part of a literary technique called constrained writing.Now imagine the wise Yoda, the master of all, whose proficiency putting words together\r\nin sentences is one of his well-known abilities. He is now interested in enriching his long-\r\nlasting, and maybe boring, inactivity periods by ‘composing’ palindromic sentences. That\r\nis, he has plans to use only palindromic sentences for his chats. For this matter, he needs\r\nto practice. The first task in his practice plan is to count all the palindromes that can be\r\narranged out of a collection of characters.Today, you will be Yoda’s assistant for this first task. Your only mission is to, given\r\na sequence of characters, determine how many palindromes can be obtained with some\r\nof the characters in the sequence; you will only take into account uppercase or lowercase\r\nletters. Put in other way, you need to determine how many permutations of a give sequence\r\nof characters are palindromes. Your solution will help definitively master Yoga.InputThe input consists of several test cases, one per line. For each test case, the input consist of a\r\nsequence of ASCII characters.OutputFor each test case you should print in a single line, and according to the order of the test cases,\r\nthe total number of palindromes generated by the input sequence of ASCII characters. For your\r\npurpose, you should only consider uppercase or lowercase characters appearing in the input; any\r\nother character should be ignored in the calculations. Uppercase and lowercase characters are not\r\nconsidered different; for example, A and a should not be considered different. In any case, the\r\ntotal number of palindromes will not exceed the number e43, where e is approximately 2.71828.\r\nRemember that the empty sequence is a palindrome itself.ExampleInput:A man, a plan, a canal, Panama!\r\narD,R!A\r\nB.a.C1/\r\n12[’;. =1Output:15120\r\n2\r\n0\r\n1",
  "sample_input": "Input:A man, a plan, a canal, Panama!\r\narD,R!A\r\nB.a.C1/\r\n12[’;. =1Output:15120\r\n2\r\n0\r\n1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/YODA",
  "scraped_at": "2025-08-17 00:34:30"
}