{
  "problem_code": "problems",
  "title": "All Discs Considered",
  "tags": [],
  "text": "Operating systems are large software artefacts composed of many packages, usually distributed on several media, e.g., discs.\r\nYou probably remember the time when your favourite operating system was delivered on 21 floppy discs, or, a few years later, on 6 CDs.\r\nNowadays, it will be shipped on several DVDs, each containing tens of thousands of packages.The installation of certain packages may require that other packages have been installed previously.\r\nTherefore, if the packages are distributed on the media in an unsuitable way, the installation of the complete system requires you to perform many media changes, provided that there is only one reading device available, e.g., one DVD-ROM drive.\r\nSince you have to start the installation somehow, there will of course be one or more packages that can be installed independently of all other packages.Given a distribution of packages on media and a list of dependences between packages, you have to calculate the minimal number of media changes required to install all packages.\r\nFor your convenience, you may assume that the operating system comes on exactly 2 DVDs.InputThe input contains several test cases.\r\nEvery test case starts with three integersN1, N2, D.\r\nYou may assume that1<=N1,N2<=50000and0<=D<=100000.\r\nThe first DVD containsN1packages, identified by the numbers1, 2, ..., N1.\r\nThe second DVD containsN2packages, identified by the numbersN1+1, N1+2, ..., N1+N2.\r\nThen followDdependence specifications, each consisting of two integersxi, yi.\r\nYou may assume that1<=xi,yi<=N1+N2for1<=i<=D.\r\nThe dependence specification means that the installation of packagexirequires the previous installation of packageyi.\r\nYou may assume that there are no circular dependences.\r\nThe last test case is followed by three zeros.OutputFor each test case output on a line the minimal number of DVD changes required to install all packages.\r\nBy convention, the DVD drive is empty before the installation and the initial insertion of a disc counts asonechange.\r\nLikewise, the final removal of a disc counts asonechange, leaving the DVD drive empty after the installation.ExampleInput:3 2 1\r\n1 2\r\n2 2 2\r\n1 3\r\n4 2\r\n2 1 1\r\n1 3\r\n0 0 0Output:3\r\n4\r\n3",
  "sample_input": "Input:3 2 1\r\n1 2\r\n2 2 2\r\n1 3\r\n4 2\r\n2 1 1\r\n1 3\r\n0 0 0Output:3\r\n4\r\n3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/ALL",
  "scraped_at": "2025-08-17 00:34:22"
}