{
  "problem_code": "problems",
  "title": "Fractan",
  "tags": [],
  "text": "To play the \"fraction game\" corresponding to a given listf1, f2... fkof fractions and starting integerN, you repeatedly multiply the integer you have at any stage (initiallyN) by the earliestfiin the list for which the answer is integral.\r\nWhenever there is no suchfi, the game stops.Formally, we define a sequence byS0= N, andSj+1= fiSj, if for1 ≤ i ≤ k, the numberfiSjis an integer but the numbersf1Sj... fi-1Sjare not.For example, if we have the list of eight fractionsf1= 170/39,f2= 19/13,f3= 13/17,f4= 69/95,f5= 19/23,f6= 1/19,f7= 13/7,f8= 1/3, and start withN = 21, we produce the (finite) sequence(21, 39, 170, 130, 190, 138, 114, 6, 2).\r\nIn general, the sequence may be infinite.Given a fraction list and a starting integer calculate a part of the defined sequence.\r\nActually, we are interested only in the powers of2that appear in the sequence.InputThe input contains several test cases.\r\nEvery test case starts with three integersm, N, k.\r\nYou may assume that1 ≤ m ≤ 40,1 ≤ N ≤ 1000, and1 ≤ k ≤ 100.\r\nThen followkfractionsf1... fk.\r\nFor each fraction, first its numerator is given, followed by its denominator.\r\nYou may assume that both are positive integers less than1000and their greatest common divisor is1.\r\nThe last test case is followed by a zero.OutputFor each test case output on a linemnumberse1... em, separated by one space character, such that2e1... 2ekare the firstmnumbers in the defined sequence that are powers of2.\r\nYou may assume that there are at leastmpowers of2among the first 7654321 elements of the sequence.ExampleInput:1 21 8 170 39 19 13 13 17 69 95 19 23 1 19 13 7 1 3\r\n20 2 14 17 91 78 85 19 51 23 38 29 33 77 29 95 23 77 19 1 17 11 13 13 11 15 2 1 7 55 1\r\n0Output:1 2 3 5 7 11 13 17 19 23 29 31 37 41 43 47 53 59 61 67",
  "sample_input": "Input:1 21 8 170 39 19 13 13 17 69 95 19 23 1 19 13 7 1 3\r\n20 2 14 17 91 78 85 19 51 23 38 29 33 77 29 95 23 77 19 1 17 11 13 13 11 15 2 1 7 55 1\r\n0Output:1 2 3 5 7 11 13 17 19 23 29 31 37 41 43 47 53 59 61 67",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/FRACTAN",
  "scraped_at": "2025-08-17 00:34:16"
}