{
  "problem_code": "problems",
  "title": "Binary Search Heap Construction",
  "tags": [],
  "text": "Read the statement of problem G for the definitions concerning trees.\r\nIn the following we define the basic terminology of heaps.\r\nAheapis a tree whose internal nodes have each assigned apriority(a number) such that the priority of each internal node is less than the priority of its parent.\r\nAs a consequence, the root has the greatest priority in the tree, which is one of the reasons why heaps can be used for the implementation of priority queues and for sorting.A binary tree in which each internal node has both a label and a priority, and which is both a binary search tree with respect to the labels and a heap with respect to the priorities, is called atreap.\r\nYour task is, given a set of label-priority-pairs, with unique labels and unique priorities, to construct a treap containing this data.InputThe input contains several test cases.\r\nEvery test case starts with an integern.\r\nYou may assume that1 ≤ n ≤ 50000.\r\nThen follownpairs of strings and numbersl1/ p1... ln/ pndenoting the label and priority of each node.\r\nThe strings are non-empty and composed of lower-case letters, and the numbers are non-negative integers.\r\nThe last test case is followed by a zero.OutputFor each test case output on a single line a treap that contains the specified nodes.\r\nA treap is printed as(<left sub-treap><label>/<priority><right sub-treap>).\r\nThe sub-treaps are printed recursively, and omitted if leaves.ExampleInput:7 a/7 b/6 c/5 d/4 e/3 f/2 g/1\r\n7 a/1 b/2 c/3 d/4 e/5 f/6 g/7\r\n7 a/3 b/6 c/4 d/7 e/2 f/5 g/1\r\n0Output:(a/7(b/6(c/5(d/4(e/3(f/2(g/1)))))))\r\n(((((((a/1)b/2)c/3)d/4)e/5)f/6)g/7)\r\n(((a/3)b/6(c/4))d/7((e/2)f/5(g/1)))",
  "sample_input": "Input:7 a/7 b/6 c/5 d/4 e/3 f/2 g/1\r\n7 a/1 b/2 c/3 d/4 e/5 f/6 g/7\r\n7 a/3 b/6 c/4 d/7 e/2 f/5 g/1\r\n0Output:(a/7(b/6(c/5(d/4(e/3(f/2(g/1)))))))\r\n(((((((a/1)b/2)c/3)d/4)e/5)f/6)g/7)\r\n(((a/3)b/6(c/4))d/7((e/2)f/5(g/1)))",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HEAPULM",
  "scraped_at": "2025-08-17 00:34:20"
}