{
  "problem_code": "problems",
  "title": "Genetic Code",
  "tags": [],
  "text": "The connections between mathematics and biology are complicated.\r\nMost of the time they do not run along nice-looking links that merrily join at first glance, but they are abstract and not always easily established.Lake Vostok - about 14000 square kilometers large, up to 650 meters deep, and covered by 3743 meters of ice - was recently discovered on the Antarctic continent.\r\nThe lake remained under conditions of high pressure and no sunlight for several millions of years.\r\nIt is believed that ordinary life has evolved to a more efficient form using a genetic code composed of only three bases (the current state of ignorance proclaims the four bases adenine, cytosine, guanine, and thymine).\r\nUntil reasonable names are found, the three bases will be abbreviated asN,O, andP.Moreover, the genome is single-stranded and directed, i.e., we may see it as a sequence over the alphabet{N, O, P}.\r\nUnless risking instability, it is necessary that the genome is a Thue-sequence, due to the Norwegian mathematician A. Thue (1863-1922).\r\nDefine a subsegment of a sequence to be a connected subsequence, and call two subsegments adjacent if one follows immediately after the other in the sequence.\r\nA Thue-sequence is a sequence where no adjacent subsegments are equal.\r\nFor example,NOPNOis andNOPNPNOis not a Thue-sequence, so that the first may be a genome whereas the second may not.To be able to simulate experiments with the new genomes, you are asked to generate genomes of certain lengths.InputThe input contains several test cases.\r\nEach test case consists of an integern.\r\nYou may assume that1 ≤ n ≤ 5000.\r\nThe last test case is followed by a zero.OutputFor each test case specified bynoutput on a single line any genome of lengthn.\r\nIf no genome of lengthnexists, output a blank line instead.Sample Input1\r\n2\r\n10\r\n20\r\n0Sample OutputN\r\nNO\r\nNONPNOPNPO\r\nNONPNOPNPONOPNONPNOP",
  "sample_input": "1\r\n2\r\n10\r\n20\r\n0",
  "sample_output": "N\r\nNO\r\nNONPNOPNPO\r\nNONPNOPNPONOPNONPNOP",
  "link": "https://www.spoj.com/problems/GENETIC",
  "scraped_at": "2025-08-17 00:34:20"
}