{
  "problem_code": "problems",
  "title": "Fixed Partition Contest Management",
  "tags": [],
  "text": "A technique used in early programming contest strategies involved partitioning the available intellectual capacity of a team into a number of members with each member having a fixed amount of intelligence, different members potentially having different amounts. The sum of the brightness of all members equals the total intellectual capacity of the team.Given a set of problems, it was the task of the team to assign the problems to different team members, so that they could be solved concurrently. This was made difficult due to the fact that the solution time of a problem might depend on the amount of intelligence available to it. Every problem has a minimum intelligence requirement, but if assigned to a brighter member its solution time might increase or decrease.In this task, you have to determine optimal assignments of problems to team members. Your program is given the intellectual capacities of the team members available for the solution of problems, and for each problem a description of how its solution time depends on the amount of intelligence available to it. Your program has to find the solution schedule of the problems that minimizes the average solution time for the problems. A solution schedule is an assignment of problems to team members and times, such that no two problems use the same member at the same time, and no problem is assigned to a team member with less brightness than its minimum requirement. The solution time of the problem is the difference between the time when the problem was submitted to be solved (which is the start of the contest at time zero for all problems in this task), and the time that the problem is solved.InputThe input data will contain multiple test cases. Each test case begins with a line containing a pair of integersmandn. The numbermspecifies the number of team members (1 ≤ m ≤ 3), andnspecifies the number of problems to be solved (1 ≤ n ≤ 10).The next line containsmpositive integers giving the intelligence amounts of themteam members. Following this arenlines, describing the time-brightness trade-offs for each of thenproblems. Each line starts with a positive integerk(k ≤ 10), followed bykpairs of positive integerss1, t1, s2, t2... sk, tkthat satisfysi< si+1for1 ≤ i < k. The minimum intelligence requirement of the problem iss1, i.e. it cannot be solved by a member with less intellectual capacity than this number. If the problem is solved by a team member with brightnesss, wheresi≤ s < si+1for somei, then its solution time will beti. Finally, if the problem is solved by a team member with intellectual capacityskor more, then its execution time will betk.A pair of zeroes will follow the input for the last test case.You may assume that each problem will be solved in exactly the time specified for the given brightness, regardless of the number of other problems being solved by other team members at the same time. No problem will have an intelligence requirement larger than that of the brightest team member.OutputFor each test case, first display the case number (starting with1and increasing sequentially). Then print the minimum average solution time for the set of problems with two digits to the right of the decimal point. Follow this by the description of a solution schedule that achieves this average solution time. Display one line for each problem, in the order they were given in the input, that identifies the problem number, the member used to solve it (numbered in the order given in the input), the time when the member started to solve the problem, and the time when the problem was solved. Follow the format shown in the sample output, and print a blank line after each test case.ExampleInput:2 4\r\n40 60\r\n1 35 4\r\n1 20 3\r\n1 40 10\r\n1 60 7\r\n3 5\r\n10 20 30\r\n2 10 50 12 30\r\n2 10 100 20 25\r\n1 25 19\r\n1 19 41\r\n2 10 18 30 42\r\n0 0Output:Case 1\r\nAverage solution time = 7.75\r\nProblem 1 is solved by member 2 from 0 to 4\r\nProblem 2 is solved by member 1 from 0 to 3\r\nProblem 3 is solved by member 1 from 3 to 13\r\nProblem 4 is solved by member 2 from 4 to 11\r\n\r\nCase 2\r\nAverage solution time = 35.40\r\nProblem 1 is solved by member 3 from 19 to 49\r\nProblem 2 is solved by member 2 from 0 to 25\r\nProblem 3 is solved by member 3 from 0 to 19\r\nProblem 4 is solved by member 2 from 25 to 66\r\nProblem 5 is solved by member 1 from 0 to 18",
  "sample_input": "Input:2 4\r\n40 60\r\n1 35 4\r\n1 20 3\r\n1 40 10\r\n1 60 7\r\n3 5\r\n10 20 30\r\n2 10 50 12 30\r\n2 10 100 20 25\r\n1 25 19\r\n1 19 41\r\n2 10 18 30 42\r\n0 0Output:Case 1\r\nAverage solution time = 7.75\r\nProblem 1 is solved by member 2 from 0 to 4\r\nProblem 2 is solved by member 1 from 0 to 3\r\nProblem 3 is solved by member 1 from 3 to 13\r\nProblem 4 is solved by member 2 from 4 to 11\r\n\r\nCase 2\r\nAverage solution time = 35.40\r\nProblem 1 is solved by member 3 from 19 to 49\r\nProblem 2 is solved by member 2 from 0 to 25\r\nProblem 3 is solved by member 3 from 0 to 19\r\nProblem 4 is solved by member 2 from 25 to 66\r\nProblem 5 is solved by member 1 from 0 to 18",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CONTEST",
  "scraped_at": "2025-08-17 00:34:11"
}