{
  "problem_code": "problems",
  "title": "The Bookcase",
  "tags": [],
  "text": "No wonder the old bookcase caved under the massive piles of books Tom\r\nhad stacked on it. He had better build a new one, this time large\r\nenough to hold all of his books. Tom finds it practical to have the\r\nbooks close at hand when he works at his desk. Therefore, he is\r\nimagining a compact solution with the bookcase standing on the back\r\nof the desk.  Obviously, this would put some restrictions on the size\r\nof the bookcase, it should preferably be as small as possible.  In\r\naddition, Tom would like the bookcase to have exactly three shelves for\r\naesthetical reasons.Wondering how small his bookcase could be, he models the problem as\r\nfollows. He measures the heighthiand thicknesstiof each bookiand he seeks a\r\npartition of the books in three non-empty setsS1,S2,S3such thatis minimized, i.e. the area of the bookcase as seen when standing in\r\nfront of it (the depth needed is obviously the largest width of all\r\nhis books, regardless of the partition).  Note that this formula does\r\nnot give the exact area of the bookcase, since the actual shelves\r\ncause a small additional height, and the sides cause a small\r\nadditional width.  For simplicity, we will ignore this small\r\ndiscrepancy.Thinking a moment on the problem, Tom realizes he will need a computer\r\nprogram to do the job.InputThe input begins with a positive number on a line of its own telling\r\nthe number of test cases (at most 20).  For each test case there is\r\none line containing a single positive integerN, 3 ≤N≤ 70 giving the number of books. ThenNlines\r\nfollow each containing two positive integershi,ti, satisfying 150 ≤hi≤ 300 and 5 ≤ti≤ 30, the height and\r\nthickness of bookirespectively, in millimeters.OutputFor each test case, output one line containing the minimum area\r\n(height times width) of a three-shelf bookcase capable of holding all\r\nthe books, expressed in square millimeters.ExampleInput:2\r\n4\r\n220 29\r\n195 20\r\n200 9\r\n180 30\r\n6\r\n256 20\r\n255 30\r\n254 15\r\n253 20\r\n252 15\r\n251 9Output:18000\r\n29796",
  "sample_input": "Input:2\r\n4\r\n220 29\r\n195 20\r\n200 9\r\n180 30\r\n6\r\n256 20\r\n255 30\r\n254 15\r\n253 20\r\n252 15\r\n251 9Output:18000\r\n29796",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/BOOKCASE",
  "scraped_at": "2025-08-17 00:34:28"
}