{
  "problem_code": "problems",
  "title": "The SetStack Computer",
  "tags": [],
  "text": "Background from Wikipedia:Set theory is a branch of mathematics created principally by the\r\nGerman mathematician Georg Cantor at the end of the 19th\r\ncentury. Initially controversial, set theory has come to play the role\r\nof a foundational theory in modern mathematics, in the sense of a\r\ntheory invoked to justify assumptions made in mathematics concerning\r\nthe existence of mathematical objects (such as numbers or functions)\r\nand their properties. Formal versions of set theory also have a\r\nfoundational role to play as specifying a theoretical ideal of\r\nmathematical rigor in proofs.Given this importance of sets, being the basis of mathematics, a set\r\nof eccentric theorist set off to construct a supercomputer operating on\r\nsets instead of numbers. The initial SetStack Alpha is under\r\nconstruction, and they need you to simulate it in order to verify the\r\noperation of the prototype.The computer operates on a single stack of sets, which is initially\r\nempty. After each operation, the cardinality of the topmost set on the\r\nstack is output. The cardinality of a setSis denoted\r\n|S| and is the number of elements inS.  The\r\ninstruction set of the SetStack Alpha isPUSH,DUP,UNION,INTERSECT, andADD}.PUSHwill push the empty set {} on the stack.DUPwill duplicate the topmost set (pop the stack, and then push that set on the stack twice).UNIONwill pop the stack twice and then push the union of the two sets on the stack.INTERSECTwill pop the stack twice and then push the intersection of the two sets on the stack.ADDwill pop the stack twice, add the first set to the second one, and then push the resulting set on the stack.For illustration purposes, assume that the topmost element of the stack isA= { {}, {{}} },and that the next one isB= { {}, {{{}}} }.For these sets, we have |A| = 2 and |B| = 2. Then:UNIONwould result in the set { {}, {{}}, {{{}}} }.  The\r\noutput is 3.INTERSECTwould result in the set { {} }.  The output is 1.ADDwould result in the set { {}, {{{}}}, {{},{{}}} }.\r\nThe output is 3.InputAn integer 0 ≤T≤ 5 on the first line gives the\r\ncardinality of the set of test cases. The first line of each test case\r\ncontains the number of operations 0 ≤N≤ 2000. Then\r\nfollowNlines each containing one of the five commands. It\r\nis guaranteed that the SetStack computer can execute all the commands\r\nin the sequence without ever popping an empty stack.OutputFor each operation specified in the input, there will be one line of\r\noutput consisting of a single integer. This integer is the cardinality\r\nof the topmost element of the stack after the corresponding command\r\nhas executed. After each test case there will be a line with***(three asterisks).ExampleInput:2\r\n9\r\nPUSH\r\nDUP\r\nADD\r\nPUSH\r\nADD\r\nDUP\r\nADD\r\nDUP\r\nUNION\r\n5\r\nPUSH\r\nPUSH\r\nADD\r\nPUSH\r\nINTERSECTOutput:0\r\n0\r\n1\r\n0\r\n1\r\n1\r\n2\r\n2\r\n2\r\n***\r\n0\r\n0\r\n1\r\n0\r\n0\r\n***",
  "sample_input": "Input:2\r\n9\r\nPUSH\r\nDUP\r\nADD\r\nPUSH\r\nADD\r\nDUP\r\nADD\r\nDUP\r\nUNION\r\n5\r\nPUSH\r\nPUSH\r\nADD\r\nPUSH\r\nINTERSECTOutput:0\r\n0\r\n1\r\n0\r\n1\r\n1\r\n2\r\n2\r\n2\r\n***\r\n0\r\n0\r\n1\r\n0\r\n0\r\n***",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SETSTACK",
  "scraped_at": "2025-08-17 00:34:16"
}