{
  "problem_code": "problems",
  "title": "Lineland Airport",
  "tags": [],
  "text": "Lineland is a strange country. As the name suggests, it's shape (as\r\nseen from above) is just a straight line, rather than some\r\ntwo-dimensional shape.  The landscape along this line is very\r\nmountainous, something which occasionally leads to some problems. One\r\nsuch problem now occurs: in this modern era the king wants to build an\r\nairport to stimulate the country's economy. Unfortunately, it's\r\nimpossible for airplanes to land on steep airstrips, so a horizontal\r\npiece of land is needed. To accommodate for the larger airplanes, this\r\nstrip needs to have length at leastL.Over the years, the inhabitants of Lineland have become very\r\nproficient in flattening pieces of land. Given a piece a land, they\r\ncan remove rock quickly. They don't want to add rock for that may lead\r\nto an unstable landing strip. To minimize the amount of effort,\r\nhowever, they want to remove the least amount of rock necessary to\r\nreach their goal: a flat piece of land of lengthL.  What is\r\nthis minimum amount?  Because of the low-dimensional nature of\r\nLineland, the amount of rock that needs to be removed is measured as\r\nthe total area of land above the place where the landing strip is\r\nplaced, rather than the volume (so in the Figure below, the amount of\r\nland removed is given by the lightly shaded area).InputOne line with a positive number: the number of test cases (at most 25). Then\r\nfor each test case:One line with an integerN, 2 ≤N≤ 500, the\r\nnumber of points, and an integerL, 1 ≤L≤\r\n\r\n10000, the necessary length to flatten.Nlines with two integersxiandyiwith 0 ≤xi,yi≤ 10000 describing the landscape of\r\nLineland. Thexiare in (strictly) ascending\r\norder. At positionxithe height of the landscape\r\nisxi. Between twoxithe\r\nlandscape has constant slope. (So the landscape is piecewise\r\nlinear). The difference betweenxNandx1is greater than or equal toL.OutputFor each test case, output one line with the minimum amount of rock\r\nwhich must be removed in order to build the airport.  The answer\r\nshould be given as a floating point number with an absolute error of\r\nat most 10-3.ExampleInput:4\r\n3 5\r\n0 2\r\n4 2\r\n14 0\r\n4 3\r\n0 2\r\n2 0\r\n4 0\r\n5 3\r\n3 10\r\n10 2\r\n30 2\r\n35 7\r\n2 777\r\n222 333\r\n4444 5555Output:0.9000\r\n0.3750\r\n0.0000\r\n373362.4867",
  "sample_input": "Input:4\r\n3 5\r\n0 2\r\n4 2\r\n14 0\r\n4 3\r\n0 2\r\n2 0\r\n4 0\r\n5 3\r\n3 10\r\n10 2\r\n30 2\r\n35 7\r\n2 777\r\n222 333\r\n4444 5555Output:0.9000\r\n0.3750\r\n0.0000\r\n373362.4867",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LINELAND",
  "scraped_at": "2025-08-17 00:34:33"
}