{
  "problem_code": "problems",
  "title": "Ticket to Ride",
  "tags": [],
  "text": "Ticket to Ride is a board game for up to 5 players.  The goal of the\r\ngame is to set up train lines (and to thwart the opponents' attempts\r\nat setting up their train lines).  At the beginning of play, each\r\nplayer is assigned four train lines.  A player may choose to discard\r\nas many of these four assignments as she likes.  Each assignment has a\r\nscore, corresponding to its difficulty (so, typically, a train line\r\nbetween e.g. Stockholm and Tokyo would be worth more than a train\r\nline between e.g. Stockholm and Utrecht).  At the end of the game,\r\neach player gets points for the assignments that they have\r\nsuccessfully completed, and penalty points for the assignments that\r\nthey have failed to complete.An assignment consists of a pair of cities that are to be connected by\r\na series of shorter railway routes.  A route can be claimed (for a\r\ncertain cost associated with the route), but things are complicated by\r\nthe fact that there is only a limited number of routes, and once a player\r\nclaims a route, none of the other players can claim it.  A player has\r\nsuccessfully set up a train line between two cities if there is a path\r\nbetween the two cities using only routes that have been claimed by\r\nthis player.  For simplicity, we will ignore all additional aspects of\r\nthe game (including the actual process of claiming routes and\r\nadditional ways to score points).For instance, if your assignment is to connect Stockholm and Amsterdam\r\nin the Figure above, you would probably want to claim the routes\r\nbetween Stockholm and Copenhagen, and between Copenhagen and\r\nAmsterdam.  But if another player manages to claim the route between\r\nCopenhagen and Stockholm before you, your train line would have to use\r\nsome other routes, e.g. by going to Copenhagen via Oslo.In this problem, we will consider the rather bold strategy of trying\r\nto complete all four assignments (typically, this will be quite\r\nhard).  As a preliminary assessment of the difficulty of achieving\r\nthis, we would like to calculate the minimum cost of setting up all\r\nfour lines assuming that none of the other players interfere with our\r\nplans.  Your job is to write a program to determine this minimum cost.InputThe input consists of several (at most 20) games to be analyzed.  Each\r\ngame starts with two integers 1 ≤n≤ 30, 0 ≤m≤ 1000, giving the number of cities and railway routes\r\nin the map, respectively.  Then follownlines, giving the\r\nnames of thencities.  City names are at most 20 characters\r\nlong and consist solely of lower case letters\r\n('a'-'z').After this followmlines, each containing the names of two\r\ndifferent cities and an integer 1 ≤c≤ 10000,\r\nindicating that there is a railway route with costcbetween\r\nthe two cities.  Note that there may be several railway routes between\r\nthe same pair of cities.  You may assume that it is always possible to\r\nset up a train line from any city to any other city.Finally, there will be four lines, each containing the names of two\r\ncities, giving the four train line assignments.The input is terminated by a case wheren=m= 0.\r\nThis case should not be processed.OutputFor each game, output a single line containing a single integer, the\r\nminimum possible cost to set up all four train lines.ExampleInput:10 15\r\nstockholm\r\namsterdam\r\nlondon\r\nberlin\r\ncopenhagen\r\noslo\r\nhelsinki\r\ndublin\r\nreykjavik\r\nbrussels\r\noslo stockholm 415\r\nstockholm helsinki 396\r\noslo london 1153\r\noslo copenhagen 485\r\nstockholm copenhagen 522\r\ncopenhagen berlin 354\r\ncopenhagen amsterdam 622\r\nhelsinki berlin 1107\r\nlondon amsterdam 356\r\nberlin amsterdam 575\r\nlondon dublin 463\r\nreykjavik dublin 1498\r\nreykjavik oslo 1748\r\nlondon brussels 318\r\nbrussels amsterdam 173\r\nstockholm amsterdam\r\noslo london\r\nreykjavik dublin\r\nbrussels helsinki\r\n2 1\r\nfirst\r\nsecond\r\nfirst second 10\r\nfirst first\r\nfirst first\r\nsecond first\r\nfirst first\r\n0 0Output:3907\r\n10",
  "sample_input": "Input:10 15\r\nstockholm\r\namsterdam\r\nlondon\r\nberlin\r\ncopenhagen\r\noslo\r\nhelsinki\r\ndublin\r\nreykjavik\r\nbrussels\r\noslo stockholm 415\r\nstockholm helsinki 396\r\noslo london 1153\r\noslo copenhagen 485\r\nstockholm copenhagen 522\r\ncopenhagen berlin 354\r\ncopenhagen amsterdam 622\r\nhelsinki berlin 1107\r\nlondon amsterdam 356\r\nberlin amsterdam 575\r\nlondon dublin 463\r\nreykjavik dublin 1498\r\nreykjavik oslo 1748\r\nlondon brussels 318\r\nbrussels amsterdam 173\r\nstockholm amsterdam\r\noslo london\r\nreykjavik dublin\r\nbrussels helsinki\r\n2 1\r\nfirst\r\nsecond\r\nfirst second 10\r\nfirst first\r\nfirst first\r\nsecond first\r\nfirst first\r\n0 0Output:3907\r\n10",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TICKET",
  "scraped_at": "2025-08-17 00:34:26"
}