{
  "problem_code": "problems",
  "title": "Printer Queue",
  "tags": [],
  "text": "The only printer in the computer science students' union is\r\nexperiencing an extremely heavy workload. Sometimes there are\r\na hundred jobs in the printer queue and you may have to wait\r\nfor hours to get a single page of output.Because some jobs are more important than others, the Hacker General\r\nhas invented and implemented a simple priority system for the print\r\njob queue.  Now, each job is assigned a priority between 1 and 9 (with 9 being\r\nthe highest priority, and 1 being the lowest), and the printer\r\noperates as follows.The first jobJin queue is taken from the queue.If there is some job in the queue with a higher priority than jobJ, then moveJto the end of the queue without printing it.Otherwise, print jobJ(and do not put it back in the queue).In this way, all those important muffin recipes that the Hacker\r\nGeneral is printing get printed very quickly.  Of course, those\r\nannoying term papers that others are printing may have to wait for\r\nquite some time to get printed, but that's life.Your problem with the new policy is that it has become quite tricky to\r\ndetermine when your print job will actually be completed.  You decide\r\nto write a program to figure this out.  The program will be given the\r\ncurrent queue (as a list of priorities) as well as the position of\r\nyour job in the queue, and must then calculate how long it will take\r\nuntil your job is printed, assuming that no additional jobs will be\r\nadded to the queue.  To simplify matters, we assume that printing a\r\njob always takes exactly one minute, and that adding and removing jobs\r\nfrom the queue is instantaneous.InputOne line with a positive integer: the number of test cases (at most 100). Then\r\nfor each test case:One line with two integersnandm, wherenis the number of jobs in the queue (1 ≤n≤ 100) andmis the position of your job (0 ≤ m ≤ n-1).  The\r\nfirst position in the queue is number 0, the second is number 1, and\r\nso on.One line withnintegers in the range 1 to 9, giving the priorities\r\nof the jobs in the queue.  The first integer gives the priority of the\r\nfirst job, the second integer the priority of the second job, and so\r\non.OutputFor each test case, print one line with a single integer; the number\r\nof minutes until your job is completely printed, assuming that no\r\nadditional print jobs will arrive.ExampleInput:3\r\n1 0\r\n5\r\n4 2\r\n1 2 3 4\r\n6 0\r\n1 1 9 1 1 1Output:1\r\n2\r\n5",
  "sample_input": "Input:3\r\n1 0\r\n5\r\n4 2\r\n1 2 3 4\r\n6 0\r\n1 1 9 1 1 1Output:1\r\n2\r\n5",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PQUEUE",
  "scraped_at": "2025-08-17 00:34:30"
}