{
  "problem_code": "problems",
  "title": "Prime Path",
  "tags": [],
  "text": "The ministers of the cabinet were quite upset by the \r\nmessage from the Chief of Security stating that they\r\nwould all have to change the four-digit room numbers \r\non their offices.— It is a matter of security to change such things\r\n    every now and then, to keep the enemy in the dark.— But look, I have chosen my number 1033 for good\r\n    reasons. I am the Prime minister, you know!— I know, so therefore your new number 8179 is also\r\n    a prime. You will just have to paste four new\r\n    digits over the four old ones on your office door.— No, it's not that simple. Suppose that I change the\r\n    first digit to an 8, then the number will read 8033\r\n    which is not a prime!— I see, being the prime minister you cannot stand\r\n    having a non-prime number on your door even for a\r\n    few seconds.— Correct! So I must invent a scheme for going from\r\n    1033 to 8179 by a path of prime numbers where\r\n    only one digit is changed from one prime to the\r\n    next prime.Now, the minister of finance, who had been eavesdropping,\r\nintervened.— No unnecessary expenditure, please! I happen to\r\n    know that the price of a digit is one pound.— Hmm, in that case I need a computer program to \r\n    minimize the cost. You don't know some very cheap\r\n    software gurus, do you?— In fact, I do. You see, there is this programming\r\n    contest going on...Help the prime minister to find the cheapest prime path\r\nbetween any two given four-digit primes! The first digit\r\nmust be nonzero, of course. Here is a solution in the \r\ncase above.1033\r\n    1733     \r\n    3733     \r\n    3739     \r\n    3779\r\n    8779\r\n    8179The cost of this solution is 6 pounds.  Note that the digit 1\r\nwhich got pasted over in step 2 can not be reused in the last step\r\n– a new 1 must be purchased.InputOne line with a positive number: the number of test cases (at most\r\n100). Then for each test case, one line with two numbers separated by\r\na blank.  Both numbers are four-digit primes (without leading zeros).OutputOne line for each case, either with a number stating the minimal cost\r\nor containing the wordImpossible.ExampleInput:3\r\n1033 8179\r\n1373 8017\r\n1033 1033Output:6\r\n7\r\n0",
  "sample_input": "1033\r\n    1733     \r\n    3733     \r\n    3739     \r\n    3779\r\n    8779\r\n    8179",
  "sample_output": "Input:3\r\n1033 8179\r\n1373 8017\r\n1033 1033Output:6\r\n7\r\n0",
  "link": "https://www.spoj.com/problems/PPATH",
  "scraped_at": "2025-08-17 00:34:31"
}