{
  "problem_code": "problems",
  "title": "Free tour II",
  "tags": [],
  "text": "After the success of 2nd anniversary (take a look at problemFTOURfor more details), this 3rd year, Travel Agent SPOJ goes on with another discount tour.The tour will be held onICPCisland, a miraculous one on the Pacific Ocean. We listNplaces (indexed from 1 toN) where the visitors can have a trip. Each road connecting them has aninterest value, and this value can benegative(if there is nothing interesting to view there). Simply, theseNplaces along with the roads connecting them form atree structure. We will choosetwo placesas the departure and destination of the tour.Since September is the festival season of local inhabitants, some places are extremely crowded (we call themcrowded places). Therefore, the organizer of the excursion hopes the tour will visitat mostKcrowded places(too tiring to visit many of them) and of course, thetotal number of interesting valueshould be maximum.Briefly, you are given a map ofNplaces, an integerK, andMid numbers ofcrowded place. Please help us to find the optimal tour. Note that we can visit each place onlyonce(or our customers easily feel bored), also the departure and destination placesdon't need to be different.InputThere is exactly one case. First one line, containing 3 integersN K M, with 1 <=N<= 200000, 0 <=K<=M, 0 <=M<=N.NextMlines, each line includes an id number of acrowded place.The last (N- 1) lines describe (N- 1) two-way roads connectedNplaces, forma b i, witha, bis the id of 2 places, andiis itsinterest value(-10000 <=i<= 10000).OutputOnly one number, the maximum total interest value we can obtain.ExampleInput:8 2 3\r\n3\r\n5\r\n7\r\n1 3 1\r\n2 3 10\r\n3 4 -2\r\n4 5 -1\r\n5 7 6\r\n5 6 5\r\n4 8 3Output:12ExplanationWe choose 2 and 6 as the departure and destination place, so the tour will be 2 → 3 → 4 → 5 → 6, total interest value = 10 + (-2) + (-1) + 5 = 12* Added some unofficial cases",
  "sample_input": "Input:8 2 3\r\n3\r\n5\r\n7\r\n1 3 1\r\n2 3 10\r\n3 4 -2\r\n4 5 -1\r\n5 7 6\r\n5 6 5\r\n4 8 3Output:12",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/FTOUR2",
  "scraped_at": "2025-08-17 00:34:12"
}