{
  "problem_code": "problems",
  "title": "Sudoku",
  "tags": [],
  "text": "Oh no! Bill just realized that the sudoku puzzle he had spent the last\r\nten minutes trying to solve essentially was last week's puzzle, only\r\nrotated counterclockwise. How cheap! Couldn't the magazine afford to\r\nmake a new one every week? Of course, he had no way of knowing about\r\nthis before he started to solve it, as the holes to fill with digits\r\nwere other than last week.  Nevertheless, realizing that this week's\r\npuzzle was a simple derivative of last week's certainly took the fun\r\nout of solving the rest of it.The sudoku board consists of 9×9 cells. These can be grouped\r\ninto 3×3regionsof 3×3 cells each. Some of the\r\ncells are filled with a digit 1 through 9 while the rest of them are\r\nleft empty.  The aim of the game is to fill each empty cell with a\r\ndigit 1...9 so that every row, every column and every region\r\ncontains each of the numbers 1...9 exactly once. A proper sudoku\r\npuzzle always has exactly one solution.Help Bill avoid unpleasant surprises by creating a program that checks\r\nwhether an unsolved sudoku puzzle is in fact derived from an earlier\r\npuzzle by simple operations.The allowed operations are:Rotating the entire puzzle clockwise or counterclockwise.Swapping two columns within a 3×9 column segment.Swapping two rows within a 9×3 row segment.Swapping entire row or column segments.Applying a permutationfof the digits 1...9 to every\r\ncell (i.e. replacexbyf(x)in every cell).An operation is considered being performed on the sudoku solution\r\n(rather than on the unsolved puzzle) and always guarantees that if the\r\nboard before the transformation was a solution to a sudoku puzzle, it\r\nstill is afterwards.InputThe input starts with the number of test cases 0 ≤N≤\r\n50 on a single line.Then for every test case follow nine lines describing last week's\r\npuzzle solution, from top to bottom.  Each line corresponds to a row\r\nin the puzzle and consists of nine digits (1...9), describing\r\nthe contents of the cell from left to right.Last week's solution is followed by nine lines describing this week's\r\nunsolved puzzle. Here, also, every line corresponds to a puzzle row\r\nand every digit (0...9) describes the contents of a cell. 0\r\nindicates that the cell is empty. The rows are presented ordered from\r\ntop to bottom, and within each row, the cells are ordered from left to\r\nright.After every test case except the last one follows a blank line. Every\r\nunsolved puzzle is guaranteed to be uniquely solvable and last week's\r\nsolution is always a proper sudoku solution.\r\n/p>OutputFor every test case, outputYesif the sudoku puzzle can be\r\nderived from the given solved puzzle using the allowed operations, orNoif this is not possible.ExampleInput:2\r\n963174258\r\n178325649\r\n254689731\r\n821437596\r\n496852317\r\n735961824\r\n589713462\r\n317246985\r\n642598173\r\n060104050\r\n200000001\r\n008305600\r\n800407006\r\n006000300\r\n700901004\r\n500000002\r\n040508070\r\n007206900\r\n\r\n534678912\r\n672195348\r\n198342567\r\n859761423\r\n426853791\r\n713924856\r\n961537284\r\n287419635\r\n345286179\r\n010900605\r\n025060070\r\n870000902\r\n702050043\r\n000204000\r\n490010508\r\n107000056\r\n040080210\r\n208001090Output:Yes\r\nNo",
  "sample_input": "Input:2\r\n963174258\r\n178325649\r\n254689731\r\n821437596\r\n496852317\r\n735961824\r\n589713462\r\n317246985\r\n642598173\r\n060104050\r\n200000001\r\n008305600\r\n800407006\r\n006000300\r\n700901004\r\n500000002\r\n040508070\r\n007206900\r\n\r\n534678912\r\n672195348\r\n198342567\r\n859761423\r\n426853791\r\n713924856\r\n961537284\r\n287419635\r\n345286179\r\n010900605\r\n025060070\r\n870000902\r\n702050043\r\n000204000\r\n490010508\r\n107000056\r\n040080210\r\n208001090Output:Yes\r\nNo",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SUDOKU2",
  "scraped_at": "2025-08-17 00:34:14"
}