{
  "problem_code": "problems",
  "title": "Leonardo Notebook",
  "tags": [],
  "text": "— I just bought Leonardo's secret notebook!Rare object collector Stan Ucker was really agitated but\r\nhis friend, special investigator Sarah Keptic was unimpressed.— How do you know it is genuine?— Oh, it must be, at that price. And it is written in the\r\n  da Vinci code.Sarah browsed a few of the pages. It was obvious\r\nto her that the code was a substitution cipher, where each\r\nletter of the alphabet had been substituted by another letter.— Leonardo would have written the plain-text and left it to his\r\n    assistant to encrypt, she said. And he must have supplied the\r\n    substitution alphabet to be used. If we are lucky, we can find\r\n    it on the back cover!She turned up the last page and, lo and behold, there was a single\r\nline of all 26 letters of the alphabet:QWERTYUIOPASDFGHJKLZXCVBNM— This may be Leonardo's instructions meaning that each A in the\r\n  plain-text was to be replaced by Q, each B with W, etcetera. Let us see...To their disappointment, they soon saw that this could not be the\r\nsubstitution that was used in the book. Suddenly, Stan brightened.— Maybe Leonardo really wrote the substitution alphabet on the\r\nlast page, and by mistake his assistant coded that line as he had\r\ncoded the rest of the book. So the line we have here is the result\r\nof applying some permutation TWICE to the ordinary alphabet!Sarah took out her laptop computer and coded fiercely for a few\r\nminutes. Then she turned to Stan with a sympathetic expression.— No, that couldn't be it. I am afraid that you have been duped\r\n  again, my friend. In all probability, the book is a fake.Write a program that takes a permutation of the English alphabet as\r\ninput and decides if it may be the result of performing some\r\npermutation twice.InputThe input begins with a positive number on a line of its own telling\r\nthe number of test cases (at most 500).  Then for each test case there\r\nis one line containing a permutation of the 26 capital letters of the\r\nEnglish alphabet.OutputFor each test case, output one line containingYesif the\r\ngiven permutation can result from applying some permutation twice on\r\nthe original alphabet string ABC...XYZ, otherwise outputNo.ExampleInput:2\r\nQWERTYUIOPASDFGHJKLZXCVBNM\r\nABCDEFGHIJKLMNOPQRSTUVWXYZOutput:No\r\nYes",
  "sample_input": "Input:2\r\nQWERTYUIOPASDFGHJKLZXCVBNM\r\nABCDEFGHIJKLMNOPQRSTUVWXYZOutput:No\r\nYes",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LEONARDO",
  "scraped_at": "2025-08-17 00:34:34"
}