{
  "problem_code": "problems",
  "title": "Making A Budget",
  "tags": [],
  "text": "A company uses temporary employees (“temps”) to handle its varying workloads. By doing so, it avoids having\r\nto pay for benefits normally provided to its permanent employees. However, the company must pay an\r\nemployment agency a fixed fee for each temp they hire, as well as paying the temp a fixed amount of\r\nseverance pay when they are terminated – in addition, of course, to the monthly salary each temp receives.\r\nThe company has a good understanding of when it needs temporary workers, and how many such workers it\r\nwill require each month. Depending on the fee paid to the employment agency, the temporary worker’s\r\nsalary, and the severance pay, it may make sense to retain an unneeded worker for one or more months if\r\nit’s known that they will be needed again in the future.Let’s consider an example. Suppose we know that in March the company will need 10 temps, in April they’ll\r\nneed 9, and in May they’ll need 11. Suppose a temp earns $500 per month, that the employment agency\r\nreceives $400 for each temp hired, and $600 is paid as severance to each temp that is terminated. If the\r\ncompany employs just the minimum number of temps required, then their payments will be as follows (we\r\nignore the cost of terminating all employees at the end of the last month):The total cost to the company is $20,400. But suppose they did not terminate the unneeded temp at the\r\nend of March, but just let that person remain employed. They would then save $400 in employment agency\r\nfees (since they’d need to hire just one additional temp for May), $600 in severance pay, and only have to\r\npay the temp worker $500, for an overall savings of $500.In this problem you are given, as input, the number of months for which the company is to plan its temp\r\nworker budget, the cost of hiring and firing a temp worker, the temp worker’s monthly salary, and the\r\nrequired minimum number of workers needed each month. You are to determine the minimum cost to the\r\ncompany to have at least the required minimum number of workers on hand each month. Assume there are\r\nno temporary workers on hand before the first month, and that the cost of terminating the workers at the\r\nend of the last month is not to be included in the cost. You may assume that the planning interval will be no\r\nlonger than 24 months, and the hiring cost, severance pay, and monthly salary for each temp worker is\r\ngreater than zero.InputThere will be multiple cases to consider. The input for each case begins with an integer N, the number of\r\nmonths for which planning is required (never larger than 24). This is followed by three integers giving the\r\ncost of hiring a worker, the worker’s monthly salary, and the severance pay for a terminated worker. Finally\r\nthere will appear N integers giving the required minimum number of workers needed in each month. The last\r\ncase will be followed by a zero.OutputFor each input case, display the case number (1, 2, …) and the minimum cost to the company. Use the format\r\nshown in the examples below.ExampleInput:3 400 500 600 10 9 11\r\n8 400 600 600 11 9 10 14 9 9 13 15\r\n0Output:Case 1, cost = $19900\r\nCase 2, cost = $66600",
  "sample_input": "Input:3 400 500 600 10 9 11\r\n8 400 600 600 11 9 10 14 9 9 13 15\r\n0Output:Case 1, cost = $19900\r\nCase 2, cost = $66600",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MKBUDGET",
  "scraped_at": "2025-08-17 00:34:28"
}