{
  "problem_code": "problems",
  "title": "Making Labels",
  "tags": [],
  "text": "Trees comes in many varieties other than the popular binary tree. In general, a tree is a connected acyclic\r\ngraph. That is, it consists of some number of vertices N (which we’ll assume is at least one in this problem),\r\nand N – 1 edges, each of which connects a pair of vertices.A “labeled tree” is a tree in which each vertex has been given a “label.” For simplicity, let us assume these\r\nlabels are the integers 1 through N. In how many different ways may a tree with N vertices be labeled? By\r\n“different” we mean that no rearrangement of two trees with the same number of vertices with different\r\nlabeling will be identical. (Note that although we commonly associate data with each vertex, and identify\r\none vertex as the root of the tree, that’s not significant in this problem.)Let’s consider some examples. The figure below shows all possible arrangements of trees with N = 1, 2, 3,\r\n4, or 5 vertices. The number shown below each tree is the number of different ways in which the vertices\r\nin each tree can be labeled.Clearly a tree with only one vertex can be labeled in only one way – by assigning the label “1” to the single\r\nvertex. A tree with two vertices can also be labeled in only one way. For example, although the two trees\r\nshown on the left below appear to be different, the first can be easily transformed into the second.\r\n(Imagine the edges are strings, so the vertices can be easily repositioned without losing their connectivity.)There are, however, three possible ways to label the vertices in a 3-vertex tree, as shown on the right\r\nabove. No matter how you rearrange the labeled vertices in any of the three trees, you cannot produce any\r\nof the other labeled trees.In a similar manner, the various arrangements of four vertices in a tree yield a total of 16 possible labelings\r\n– 12 for the four vertices “in a row,” and 4 for the other configuration. There are three possible\r\narrangements of the vertices in a tree with N = 5, with a total of 125 possibleInputThere will be multiple cases to consider. The input for each case is an integer N specifying the number of\r\nvertices in a tree, which will always be between 1 and 10. The last case will be followed by a zero.OutputFor each input case, display the case number (1, 2, …), the input value of N, and the number of different\r\nways in which a tree with N vertices may be labeled. Use the format shown in the examples below.ExampleInput:2\r\n3\r\n4\r\n5\r\n0Output:Case 1, N = 2, # of different labelings = 1\r\nCase 2, N = 3, # of different labelings = 3\r\nCase 3, N = 4, # of different labelings = 16\r\nCase 4, N = 5, # of different labelings = 125",
  "sample_input": "Input:2\r\n3\r\n4\r\n5\r\n0Output:Case 1, N = 2, # of different labelings = 1\r\nCase 2, N = 3, # of different labelings = 3\r\nCase 3, N = 4, # of different labelings = 16\r\nCase 4, N = 5, # of different labelings = 125",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MKLABELS",
  "scraped_at": "2025-08-17 00:34:26"
}