{
  "problem_code": "problems",
  "title": "Burrows Wheeler Precompression",
  "tags": [],
  "text": "TheBurrows-Wheeler transform(BWT, also calledblock-sorting compression), is an algorithm used in data compression techniques such as bzip2. It was invented by Michael Burrows and David Wheeler.When a character string is transformed by the BWT, none of its characters change value. The transformation permutes the order of the characters. If the original string had several substrings that occurred often, then the transformed string will have several places where a single character is repeated multiple times in a row. This is useful for compression, since it tends to be easy to compress a string that has runs of repeated characters by techniques such as move-to-front transform and run-length encoding.For example, the string:SIX.MIXED.PIXIES.SIFT.SIXTY.PIXIE.DUST.BOXEScould be transformed into this string, which is easier to compress because it has many repeated characters:TEXYDST.E.IXIXIXXSSMPPS.B..E.S.EUSFXDIIOIIITNow the Burrows-Wheeler algorithm works as follows:Given an input stringS, eg: \"abcba\".Find all rotations ofS.eg: \"abcba\", \"bcbaa\", \"cbaab\", \"baabc\", \"aabcb\"Now sort the strings hence produced.eg: \"aabcb\", \"abcba\", \"baabc\", \"bcbaa\", \"cbaab\"Arrange the strings in a len(S) x len(S) grid.aabcb\r\nabcba\r\nbaabc\r\nbcbaa\r\ncbaabOutput the row number (1-based indexing) containing the original input string. Also output the strings formed by characters in the last column.eg: 2 bacabNow given the output of Burrows-Wheeler, can you recover the orginal string?Input Format:The input file consists of multiple testcases.The first line of each testcase contains one integer,R, indicating the row number containing the original input string in the sorted matrix.The second line of each testcase contains one string,Col, which is the last column of the grid. (1 <= len(Col) <= 1000)Colcontains only lowercase characters. 1 <=R<= len(Col).Input terminates with a line containing R=0 which must not be processed.Output Format:Print the original input string to the burrow wheeler's algorithm.Testdata:30 testcasesSample Input:2\r\nbacab\r\n3\r\nrwlb\r\n11\r\nbaaabaaaabbbaba\r\n0Sample Output:abcba\r\nrbwl\r\nbaaabbbbaaaaaab",
  "sample_input": "SIX.MIXED.PIXIES.SIFT.SIXTY.PIXIE.DUST.BOXES",
  "sample_output": "TEXYDST.E.IXIXIXXSSMPPS.B..E.S.EUSFXDIIOIIIT",
  "link": "https://www.spoj.com/problems/BWHEELER",
  "scraped_at": "2025-08-17 00:34:12"
}