{
  "problem_code": "problems",
  "title": "Set Cover",
  "tags": [],
  "text": "In the set cover problem there is a collectionC =\r\n{S1... Sm}of subsets of the universe [n] ={0 ... n-1},\r\nand one must\r\nfind a minimum-sized subcollection ofCthat still covers\r\n[n] (it may be the case thatSiandSjcontain the exact same\r\nelements for somei≠j).  Apath of length ris a graph onr+1verticesv0... vrwherevihas an undirected edge\r\ntovi+1fori = 0 ... r-1(these are the only edges).\r\nA set cover instanceIis\r\nsaid to bepath-realizableif there exists a mapping fromIto a\r\npath of lengthmwhere theSiare mapped to edges in the path\r\nand eachiin [n] is mapped to a pair of (not-necessarily distinct)\r\nverticessi,tion the path such that the edges lying betweensiandticorrespond exactly to the sets ofCthat\r\ncontaini.  Two setsSi,Sjmust be mapped to different edges on\r\nthe path ifi≠j.  You will be given a set cover instance that is\r\nguaranteed to be path-realizable and should output the size of a\r\nminimum-sized subcollection ofCstill covering [n].InputThe first line of the input is \"N M\" (1≤ N, M ≤ 300),\r\nwhereNis the size of the universe andMis the number of setsSiin the collection of subsets of{0 ... N - 1}.  What follows\r\nareMgroups of lines.  Theith group starts with one line\r\ncontaining |Si|, the size of theith subset.  If |Si| =0, the\r\ncurrent group of lines ends.  Otherwise the next line is a\r\nspace-separated list of the elements contained inSi.OutputIf [n] cannot be covered by a subcollection ofCthen\r\nyou should output-1, followed by a newline.  Otherwise, your output\r\nshould consist of two lines.  The first line is the size\r\nof a minimum-sized set cover.  The second line is a space-separated\r\nlist of the 0-based indices of the sets in an optimal set cover.ExampleInput:3 4\r\n0\r\n2\r\n2 1\r\n2\r\n1 0\r\n0Output:2\r\n1 2",
  "sample_input": "Input:3 4\r\n0\r\n2\r\n2 1\r\n2\r\n1 0\r\n0Output:2\r\n1 2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SETCOV",
  "scraped_at": "2025-08-17 00:34:18"
}