{
  "problem_code": "problems",
  "title": "Circles",
  "tags": [],
  "text": "Little Gary plays the following video game. Circles pop up on the screen and disappear from it. When the screen flashes, Gary can draw a straight line on the screen and win as many points as there are circles intersected by the line. As a born-to-be-winner, Gary wants to maximize his score. Please, help him, and write a program that will determine the maximum number of points he can win each time the screen flashes.InputThe first line of the input containsM(1≤M≤1000), the number of events during the game. The nextMlines contain descriptions of the events, one per line. They can be in one of the following three formats:1xyrrepresenting a circle of radiusrpopping up with the position of its center at (x,y) in the plane.2irepresenting a circleidisappearing, where circleiis theith circle that popped up since the beginning of the game.3representing the screen flashing.x,y, andrare real numbers with at most two decimals,-106<x,y,r<106,r> 0.Notes:A line intersects a circle if it has at least two common points with it.At any time, no two circles on the screen have a common point.At any time, there is no line that \"touches\" more than two circles (a line touches a circle if they have exactly one common point).At any time, there are no more than 100 circles on the screen.Eachidetermines a circle that is on the screen at the moment of removal.No circle is removed twice.OutputEach time the screen flashes, write an integer to a separate line, which is the maximum number of circles Gary can intersect.ExampleInput:9\r\n1 3.00 0.00 1.00\r\n1 -2.00 0.00 1.00\r\n3\r\n1 2.00 3.00 1.50\r\n3\r\n1 2.00 -4.00 1.00\r\n3\r\n2 3\r\n3Output:2\r\n2\r\n3\r\n2",
  "sample_input": "Input:9\r\n1 3.00 0.00 1.00\r\n1 -2.00 0.00 1.00\r\n3\r\n1 2.00 3.00 1.50\r\n3\r\n1 2.00 -4.00 1.00\r\n3\r\n2 3\r\n3Output:2\r\n2\r\n3\r\n2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CIRCLES",
  "scraped_at": "2025-08-17 00:34:12"
}