{
  "problem_code": "problems",
  "title": "Ski Valley",
  "tags": [],
  "text": "The Society of Sport of New Hampshire has decided to build a new attraction in White Mountains. For the first time, the world will see a ski-valley, a ski path that goes downhill then uphill. They believe that skiers can gain enough speed from going down in the first part in order to climb up the second part. To maximize the joy of visitors, they want to find the longest such path.To simplify calculations, they approximate the mountain terrain with a matrix of square fields and obtain the height of each field from the New Hampshire Geographical Institute. A ski-valley is a sequence of neighboring fields, such that height of fields only decreases along the sequence until some point, and then it only increases until its end. No field appears more than once in a ski-valley. Two fields are neighbors if they share a common edge. The length of a ski-valley is the number of fields in its sequence.More technically, the terrain is anMxNmatrix of fields, where(i, j)denotes a field in theith row andjth column, andh(i, j)denotes its height. A ski-valley is a sequence(x1, y1), (x2, y2), ..., (xl, yl), such that:for anyi(1≤i≤l-1), eitherxi= xi+1and |yi- yi+1| =1, oryi= yi+1and |xi- xi+1| =1(neighbors rule)ifi≠j(1≤i, j≤l), then eitherxi≠xjoryi≠yj(no repeating rule), andThere exists ak(1≤k≤l), such thath(x1, y1)>h(x2, y2)> ... >h(x_k-1, y_k-1)>h(xk, yk)<h(x_k+1, y_k+1)< ... <h(xl, yl)(down-up rule).The length of such ski-valley isl.They hire you, a reputable programmer, to write a program that will find a ski-valley of maximum length. If there are multiple ski-valleys with the same (maximum) length, you can choose any of them.Note: Yes, they were not cautious and also allowed a ski-valley to bo only downhill or only uphill, but your job is only to adhere to the specification they gave you!InputThe first line of the input containsMandN(1 ≤ M, N ≤ 60), respectively, separated by a space character. Each of the nextMlines containNnumbers, such that thejth number in theith line representsh(i, j)(-106≤ h(i, j) ≤ 106).  No two fields in the terrain are of the same height.  Numbers on a line are separated by a space character.OutputIn the first line of the output, write a single numberlmax, which is the maximum length of a ski-valley. In the nextlmaxlines write a description of any ski-valley of that length. In each of the lines, write two integers separated by a space character, such that numbersxiandyiin theith line represent(xi, yi), theith field in the ski-valley.ExampleInput:3 4\r\n2 6 7 16\r\n1 4 3 20\r\n9 8 17 12Output:9\r\n3 1\r\n3 2\r\n2 2\r\n2 1\r\n1 1\r\n1 2\r\n1 3\r\n1 4\r\n2 4",
  "sample_input": "Input:3 4\r\n2 6 7 16\r\n1 4 3 20\r\n9 8 17 12Output:9\r\n3 1\r\n3 2\r\n2 2\r\n2 1\r\n1 1\r\n1 2\r\n1 3\r\n1 4\r\n2 4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SKIVALL",
  "scraped_at": "2025-08-17 00:34:19"
}