{
  "problem_code": "problems",
  "title": "Please help You",
  "tags": [],
  "text": "BackgroundPoor You-Know-Who was out of business for quite some time,\r\nbeing neither dead, nor alive. He would like to get rich so that\r\nhe can run for the post of Minister of Magic. From there he could\r\nunfold at least some of his evil plots even if he lost most of\r\nhis magical powers. You are fed up with all this Harry Potter\r\nbusiness and decide to help You-Know-Who make some\r\ndough. You-Know-Who inherited lots of magic powder that increases\r\none's sense of smell for a short period of time if inhaled. He\r\nwill sell it and you'll help him maximize the profit.ProblemYou-Know-Who hasCclients. Clientiwill\r\nbuya[i]−b[i]*ppowder if the unit price\r\nisp. That is, if You-Know-Who shows a certificate\r\nissued by the Minister saying that the asked price is the correct\r\nprice. Getting one such certificate involves paying a bribeB. To maximize the profit he may buy several such\r\ncertificates and use for each client the one that maximizes his\r\nprofit. You must tell You-Know-Who what certificates he should\r\nget. With some luck, Harry Potter is out!InputThe first line contains the number of test cases, which shall\r\nbe less than 20. The test cases follow. (Possible empty lines\r\nbetween test cases should be ignored.)The first line of each test case input contains two\r\nnon-negative integers: the bribeBand the number of\r\nclientsC. The nextClines describe each\r\nclient by two positive integersa[i]andb[i](on linei). You are guaranteed that all numbers in the\r\ninput are at most 2000.OutputFor each test case the output is a single\r\nnumber, the maximum profit of You-Know-Who, and it should be\r\nwritten on a line by itself. The answer should have either an\r\nabsolute or a relative error less than 1e-6.ExampleInput:2\r\n10 2\r\n10 1\r\n20 3\r\n100 1\r\n5 1Output:46.25\r\n0First test case: If YKW would have only the first client then\r\nhe should choose to get a certificate for the price 5. This way\r\nhe will sell 5 grams of powder for a profit of 5×5-10 = 15.\r\nAnalogously, for the second client the optimal price would be\r\n3.(3), which would make the client buy 10 grams of magic\r\npowder. Choosing the optimal price for each client means that two\r\nbribes must be payed, which leads to a profit of\r\n5×5+10×3.(3)-2×10 = 38.(3). Nevertheless, YKW can win more money by\r\ngetting only one certificate for the price 3.75.  This way the\r\nprofit is 6.25×3.75+8.75×3.75-10 = 46.25.The second test case shows that sometimes it's better to\r\nnot sell magic powder to some clients.",
  "sample_input": "Input:2\r\n10 2\r\n10 1\r\n20 3\r\n100 1\r\n5 1Output:46.25\r\n0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/YKH",
  "scraped_at": "2025-08-17 00:34:24"
}