{
  "problem_code": "problems",
  "title": "Strange Billboard",
  "tags": [],
  "text": "The marketing and public-relations department of the Czech Technical University has designed\r\na new reconfigurable mechanical Flip-Flop Bill-Board (FFBB). The billboard is a regular two-\r\ndimensional grid of R × C square tiles made of plastic. Each plastic tile is white on one side and\r\nblack on the other. The idea of the billboard is that you can create various pictures by flipping\r\nindividual tiles over. Such billboards will hang above all entrances to the university and will be\r\nused to display simple pictures and advertise upcoming academic events.\r\nTo change pictures, each billboard is equipped with a \"reconfiguration device\". The device is\r\njust an ordinary long wooden stick that is used to tap the tiles. If you tap a tile, it flips over to\r\nthe other side, i.e., it changes from white to black or vice versa. Do you agree this idea is very\r\nclever?Unfortunately, the billboard makers did not realize one thing. The tiles are very close to each\r\nother and their sides touch. Whenever a tile is tapped, it takes all neighboring tiles with it and\r\nall of them flip over together. Therefore, if you want to change the color of a tile, all neighboring\r\ntiles change their color too. Neighboring tiles are those that touch each other with the whole\r\nside. All inner tiles have 4 neighbors, which means 5 tiles are flipped over when tapped. Border\r\ntiles have less neighbors, of course.For example, if you have the billboard configuration shown in the left picture above and tap the\r\ntile marked with the cross, you will get the picture on the right. As you can see, the billboard\r\nreconfiguration is not so easy under these conditions. Your task is to find the fastest way to\r\n\"clear\" the billboard, i.e., to flip all tiles to their white side.InputThe input consists of several billboard descriptions. Each description begins with a line containing \r\ntwo integer numbers R and C (1 <= R,C <= 16) specifying the billboard size. Then there\r\nare R lines, each containing C characters. The characters can be either an uppercase letter \"X\"\r\n(black) or a dot \".\" (white). There is one empty line after each map. The input is terminated\r\nby two zeros in place of the board size.OutputFor each billboard, print one line containing the sentence \"You have to tap T tiles.\", where\r\nT is the minimal possible number of taps needed to make all squares white. If the situation\r\ncannot be solved, output the string \"Damaged billboard.\"instead.ExampleInput:5 5\r\nXX.XX\r\nX.X.X\r\n.XXX.\r\nX.X.X\r\nXX.XX\r\n\r\n5 5\r\n.XX.X\r\n.....\r\n..XXX\r\n..X.X\r\n..X..\r\n\r\n1 5\r\n...XX\r\n\r\n5 5\r\n...X.\r\n...XX\r\n.XX..\r\n..X..\r\n.....\r\n\r\n8 9\r\n..XXXXX..\r\n.X.....X.\r\nX..X.X..X\r\nX.......X\r\nX.X...X.X\r\nX..XXX..X\r\n.X.....X.\r\n..XXXXX..\r\n\r\n0 0Output:You have to tap 5 tiles.\r\nDamaged billboard.\r\nYou have to tap 1 tiles.\r\nYou have to tap 2 tiles.\r\nYou have to tap 25 tiles.",
  "sample_input": "Input:5 5\r\nXX.XX\r\nX.X.X\r\n.XXX.\r\nX.X.X\r\nXX.XX\r\n\r\n5 5\r\n.XX.X\r\n.....\r\n..XXX\r\n..X.X\r\n..X..\r\n\r\n1 5\r\n...XX\r\n\r\n5 5\r\n...X.\r\n...XX\r\n.XX..\r\n..X..\r\n.....\r\n\r\n8 9\r\n..XXXXX..\r\n.X.....X.\r\nX..X.X..X\r\nX.......X\r\nX.X...X.X\r\nX..XXX..X\r\n.X.....X.\r\n..XXXXX..\r\n\r\n0 0Output:You have to tap 5 tiles.\r\nDamaged billboard.\r\nYou have to tap 1 tiles.\r\nYou have to tap 2 tiles.\r\nYou have to tap 25 tiles.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CERC07B",
  "scraped_at": "2025-08-17 00:34:32"
}