{
  "problem_code": "problems",
  "title": "Cell Phone",
  "tags": [],
  "text": "Nowadays, everyone has a cellphone, or even two or three. You probably know where their\r\nname comes from. Do you. Cellphones can be moved (they are \"mobile\") and they use wireless\r\nconnection to static stations called BTS (Base Transceiver Station). Each BTS covers an area\r\naround it and that area is called a cell.The Czech Technical University runs an experimental private GSM network with a BTS right on\r\ntop of the building you are in just now. Since the placement of base stations is very important\r\nfor the network coverage, your task is to create a program that will find the optimal position\r\nfor a BTS. The program will be given coordinates of \"points of interest\". The goal is to find\r\na position that will cover the maximal number of these points. It is supposed that a BTS can\r\ncover all points that are no further than some given distance R. Therefore, the cell has a circular\r\nshape.The picture above shows eight points of interest (little circles) and one of the possible optimal\r\nBTS positions (small triangle). For the given distance R, it is not possible to cover more than\r\nfour points. Notice that the BTS does not need to be placed in an existing point of interest.InputThe input consists of several scenarios. Each scenario begins with a line containing two integer\r\nnumbers N and R. N is the number of points of interest,1 ≤ N ≤ 2 000. R is the maximal\r\ndistance the BTS is able to cover, 0 ≤ R < 10 000. Then there are N lines, each containing two\r\ninteger numbers Xi, Yigiving coordinates of the i-th point, |Xi|, |Yi| < 10 000. All points are\r\ndistinct, i.e., no two of them will have the same coordinates.The scenario is followed by one empty line and then the next scenario begins. The last one is\r\nfollowed by a line containing two zeros.A point lying at the circle boundary (exactly in the distance R) is considered covered. To avoid\r\nfloating-point inaccuracies, the input points will be selected in such a way that for any possible\r\nsubset of points S that can be covered by a circle with the radius R +0.001, there will always\r\nexist a circle with the radius R that also covers them.OutputFor each scenario, print one line containing the sentence \"It is possible to cover M points.\",\r\nwhere M is the maximal number of points of interest that may be covered by a single BTS.ExampleInput:8 2\r\n1 2\r\n5 3\r\n5 4\r\n1 4\r\n8 2\r\n4 5\r\n7 5\r\n3 3\r\n\r\n2 100\r\n0 100\r\n0 -100\r\n\r\n0 0Output:It is possible to cover 4 points.\r\nIt is possible to cover 2 points.The first sample input scenario corresponds to the picture, providing that the X axis aims right\r\nand Y axis down.",
  "sample_input": "Input:8 2\r\n1 2\r\n5 3\r\n5 4\r\n1 4\r\n8 2\r\n4 5\r\n7 5\r\n3 3\r\n\r\n2 100\r\n0 100\r\n0 -100\r\n\r\n0 0Output:It is possible to cover 4 points.\r\nIt is possible to cover 2 points.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CERC07C",
  "scraped_at": "2025-08-17 00:34:13"
}