{
  "problem_code": "problems",
  "title": "Key Task",
  "tags": [],
  "text": "The Czech Technical University is rather old - you already know that it celebrates 300 years\r\nof its existence in 2007. Some of the university buildings are old as well. And the navigation\r\nin old buildings can sometimes be a little bit tricky, because of strange long corridors that fork\r\nand join at absolutely unexpected places.The result is that some first-graders have often difficulties finding the right way to their classes.\r\nTherefore, the Student Union has developed a computer game to help the students to practice\r\ntheir orientation skills. The goal of the game is to find the way out of a labyrinth. Your task is\r\nto write a verification software that solves this game.The labyrinth is a 2-dimensional grid of squares, each square is either free or filled with a wall.\r\nSome of the free squares may contain doors or keys. There are four different types of keys and\r\ndoors: blue, yellow, red, and green. Each key can open only doors of the same color.\r\nYou can move between adjacent free squares vertically or horizontally, diagonal movement is\r\nnot allowed. You may not go across walls and you cannot leave the labyrinth area. If a square\r\ncontains a door, you may go there only if you have stepped on a square with an appropriate key\r\nbefore.InputThe input consists of several maps. Each map begins with a line containing two integer numbers\r\nR and C (1 ≤ R, C ≤ 100) specifying the map size. Then there are R lines each containing C\r\ncharacters. Each character is one of the following:Hash mark '#' Wall.Dot '.' Free square.Asterisk '*' Your position.Uppercase letter 'B','Y','R','G' Blue, yellow, red or green door.Uppercase letter 'X' Exit.Note that it is allowed to have:more than one exit,no exit at all,more doors and/or keys of the same color, andkeys without corresponding doors and vice versa.You may assume that the marker of your position (\"*\") will appear exactly once in every map.\r\nThere is one blank line after each map. The input is terminated by two zeros in place of the\r\nmap size.OutputFor each map, print one line containing the sentence \"Escape possible in S steps.\", where\r\nS is the smallest possible number of step to reach any of the exits. If no exit can be reached,\r\noutput the string \"The poor student is trapped!\" instead.One step is defined as a movement between two adjacent cells. Grabbing a key or unlocking\r\na door does not count as a step.ExampleInput:1 10\r\n*........X\r\n\r\n1 3\r\n*#X\r\n\r\n3 20\r\n####################\r\n#XY.gBr.*.Rb.G.GG.y#\r\n####################\r\n\r\n0 0Output:Escape possible in 9 steps.\r\nThe poor student is trapped!\r\nEscape possible in 45 steps.",
  "sample_input": "Input:1 10\r\n*........X\r\n\r\n1 3\r\n*#X\r\n\r\n3 20\r\n####################\r\n#XY.gBr.*.Rb.G.GG.y#\r\n####################\r\n\r\n0 0Output:Escape possible in 9 steps.\r\nThe poor student is trapped!\r\nEscape possible in 45 steps.",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CERC07K",
  "scraped_at": "2025-08-17 00:34:16"
}