{
  "problem_code": "problems",
  "title": "Weird Numbers",
  "tags": [],
  "text": "Binary numbers form the principal basis of computer science. Most of you have heard of other\r\nsystems, such as ternary, octal, or hexadecimal. You probably know how to use these systems\r\nand how to convert numbers between them. But did you know that the system base (radix)\r\ncould also be negative. One assistant professor at the Czech Technical University has recently\r\nmet negabinary numbers and other systems with a negative base. Will you help him to convert\r\nnumbers to and from these systems.A number N written in the system with a positive base R will always appear as a string of\r\ndigits between 0 and R - 1, inclusive. A digit at the position P (positions are counted from\r\nright to left and starting with zero) represents a value of RP. This means the value of the\r\ndigit is multiplied by RPand values of all positions are summed together.\r\nFor example, if we use the octal system (radix R = 8), a number written as 17024 has the following value:1·84+ 7·83+ 0·82+ 2·81+ 4·80= 1·4096 + 7·512 + 2·8 + 4·1 = 7700With a negative radix -R, the principle remains the same: each digit will have a value of (-R)P.\r\nFor example, a negaoctal (radix R = -8) number 17024 counts as:1·(-8)4+ 7·(-8)3+ 0·(-8)2+ 2·(-8)1+ 4·(-8)0= 1·4096 - 7·512 - 2·8 + 4·1 = 500One big advantage of systems with a negative base is that we do not need a minus sign to express\r\nnegative numbers. A couple of examples for the negabinary system (R = -2):decimalnegabinarydecimalnegabinarydecimalnegabinary-10-9-8-7-6-5-41010101110001001111011111100-3-2-101231101101101110111456789101001011101011011110001100111110You may notice that the negabinary representation of any integer number is unique, if no \"leading\r\nzeros\" are allowed. The only number that can start with the digit \"0\", is the zero itself.InputThe input will contain several conversions, each of them specified on one line. A conversion\r\nfrom the decimal system to some negative-base system will start with a lowercase word \"to\"\r\nfollowed by a minus sign (with no space before it), the requested base (radix) R, one space, and\r\na decimal number N.A conversion to the decimal system will start with a lowercase word \"from\", followed by a minus\r\nsign, radix R, one space, and a number written in the system with a base of -R.The input will be terminated by a line containing a lowercase word \"end\". All numbers will\r\nsatisfy the following conditions: 2 ≤ R ≤ 10, -1 000 000 ≤ N ≤ 1 000 000 (decimal).OutputFor each conversion, print one number on a separate line. If the input used a decimal format,\r\noutput the same number written in the system with a base -R. If the input contained such\r\na number, output its decimal value.Both input and output numbers must not contain any leading zeros. The minus sign \"-\"may\r\nonly be present with negative numbers written in the decimal system. Any non-negative number\r\nor a number written in a negative-base system must not start with it.ExampleInput:to-2 10\r\nfrom-2 1010\r\nto-10 10\r\nto-10 -10\r\nfrom-10 10\r\nendOutput:11110\r\n-10\r\n190\r\n10\r\n-10",
  "sample_input": "Input:to-2 10\r\nfrom-2 1010\r\nto-10 10\r\nto-10 -10\r\nfrom-10 10\r\nendOutput:11110\r\n-10\r\n190\r\n10\r\n-10",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CERC07N",
  "scraped_at": "2025-08-17 00:34:20"
}