{
  "problem_code": "problems",
  "title": "Number Labyrinth",
  "tags": [],
  "text": "Fred is a robotic mouse built by a group of students of artificial intelligence. Fred can move around in the labyrinth shown in the picture below. Whenever Fred comes to a place marked by a number, he has to choose one of the possible directions. Behavior of the mouse should look chaotic and complex enough so that it will impress students' supervisor.+--------4\r\n|        |\r\n|  8--9  |\r\n|  |  |  |\r\n2--7--0  |\r\n|  |     |\r\n1  6-----+Numbered places in the labyrinth are called nodes. Fred has one integer X stored in its memory and can perform some calculations. In each node (except node 1) he chooses a direction according to X, decreases X by 1 and goes to the chosen node. The direction is chosen according to this rules:Node 2: Compute X mod 3.\r\n        If the result is 0, go to 7\r\n                         1, go to 1\r\n                         2, go to 4.\r\n\r\nNode 4: Let Y be X written backwards (in decimal system).\r\n        If Y>X then go to 6 otherwise go to 2.\r\n\r\nNode 6: Compute the number of digits of X (in decimal system).\r\n        If the result is even then go to 4 otherwise go to 7.\r\n\r\nNode 7: Compute (X*X) mod 7.\r\n        If the result is 0 go to 2\r\n                         1 go to 6\r\n                         2 go to 8\r\n                         4 go to 0.\r\n\r\nNode 8: Compute X mod 5.\r\n        If the result is 2 or 3 then go to 7 otherwise go to 9.\r\n\r\nNode 9: If you have come from 8 then go to 0.\r\n        If you have come from 0 then go to 8.\r\n\r\nNode 0: Let Y be the third least significant digit of X in decimal system\r\n        (if X<100 then Y=0). If Y<=7 then go to 7 otherwise go to 9.At the beginning of each experiment, the experimenter puts the mouse in the node 0 and initializes value X by voice. After that, the mouse starts to move. The mouse displays current value of X on its digital display. The experiment finishes when the mouse enters the node 1, the result of the experiment is the number displayed. If the value of X decreases to zero, the experiment fails and its result is -1.InputThe input contains several initial values of X (less than two-million) as they were told by the experimenter.OutputFor each value of X in the input write to a separate line of the output the result of the corresponding experiment (see example output).ExampleInput:thirteen\r\nfourteen\r\none-thousand\r\none-million-three-hundred-and-twenty-five-thousand-nine-hundred-and-seventy-nineOutput:-1\r\n9\r\n789\r\n1325784Note: New test cases were added. Thanks toRobert GerbiczandStephen Merriman's discussion in the forum.",
  "sample_input": "+--------4\r\n|        |\r\n|  8--9  |\r\n|  |  |  |\r\n2--7--0  |\r\n|  |     |\r\n1  6-----+",
  "sample_output": "Node 2: Compute X mod 3.\r\n        If the result is 0, go to 7\r\n                         1, go to 1\r\n                         2, go to 4.\r\n\r\nNode 4: Let Y be X written backwards (in decimal system).\r\n        If Y>X then go to 6 otherwise go to 2.\r\n\r\nNode 6: Compute the number of digits of X (in decimal system).\r\n        If the result is even then go to 4 otherwise go to 7.\r\n\r\nNode 7: Compute (X*X) mod 7.\r\n        If the result is 0 go to 2\r\n                         1 go to 6\r\n                         2 go to 8\r\n                         4 go to 0.\r\n\r\nNode 8: Compute X mod 5.\r\n        If the result is 2 or 3 then go to 7 otherwise go to 9.\r\n\r\nNode 9: If you have come from 8 then go to 0.\r\n        If you have come from 0 then go to 8.\r\n\r\nNode 0: Let Y be the third least significant digit of X in decimal system\r\n        (if X<100 then Y=0). If Y<=7 then go to 7 otherwise go to 9.",
  "link": "https://www.spoj.com/problems/LABYR2",
  "scraped_at": "2025-08-17 00:34:17"
}