{
  "problem_code": "problems",
  "title": "Mountain Cave",
  "tags": [],
  "text": "Charlie is picking some precious stones in a cave, this cave is known worldwide by the stones in it, however, this cave is very delicate and the minimum movement causes an instant collapse, Charlie knows the times that the tunnels will be free (as the instant collapses can free some tunnels) or covered by a pile of stones.In his backpack, Charlie has some magical hammers that he carries for emergency, in some expeditions he won't have these hammers, but in others he will. The hammer causes an instant opening of any pile of stones blocking his way.It is also known that Charlie travels some distancedin a timetfrom roomito roomj, and the tunnel connecting them will be free from timexto timey. Charlie can return whenever he wants, so, traveling from roomjto roomiwill be symmetric.Charlie doesn't have infinite hammers, so, when he use one, the hammer will break, making it useless.In addition, if Charlie knows that the tunnel will open in a time X, he can choose to stay until the path opens or use a magical hammer to go through the tunnel.Given that information, your task is to find the minimum time with the minimum distance that Charlie can go from the entrance (0) to the center of the cave (V-1)InputThe first line of the test data will start with an integer T representing the T test cases, then, T cases will follow.Each of the cases starts with three integers, V E and M, denoting, respectively, the number of the rooms on the cave, the numbers of tunnels in the cave and the number of hammers Charlie will carry, the next E lines will contain six integers, denoting, respectively, the origin roomi, the destiny roomj, opening timex, collapse timey, distancez, and timet.OutputYou must output the string \"Scenario #i: \" where i is the number of test case you're analyzing, followed by the minimum time and the minimum distance associated to it, if Charlie isn't able to arrive to the V-1 room, output -1.ExampleInput:4\r\n6 6 2\r\n0 1 1 18 3 3\r\n0 2 1 12 4 4\r\n0 4 1 3 5 5\r\n2 3 1 8 2 2\r\n3 4 1 5 3 3\r\n4 5 5 20 1 1\r\n6 6 1\r\n0 1 1 18 3 3\r\n0 2 1 12 4 4\r\n0 4 1 3 5 5\r\n2 3 1 8 2 2\r\n3 4 1 5 3 3\r\n4 5 5 20 1 1\r\n6 6 0\r\n0 1 1 18 3 3\r\n0 2 1 12 4 4\r\n0 4 1 3 5 5\r\n2 3 1 8 2 2\r\n3 4 8 25 3 3\r\n4 5 5 20 1 1\r\n3 3 0\r\n0 1 0 5 4 4\r\n1 2 0 5 2 2\r\n0 2 0 5 6 6Output:Scenario #1: 6 6\r\nScenario #2: 7 6\r\nScenario #3: 12 10\r\nScenario #4: -1Constraints1 ≤ T ≤ 10Small input: (20%)2 ≤ V ≤ 101 ≤ E ≤ 30M = 0Medium input: (30%)2 ≤ V ≤ 1001 ≤ E ≤ 1,000M = 0Large input: (50%)2 ≤ V ≤ 1001 ≤ E ≤ 1,0000 ≤ M ≤ 50It is guaranteed that the distance of the tunnels won't never exceed 10.1 ≤ opening and collapse times ≤ 100,000Clarifications: You start with time 0. It will be always true that the time x will be lesser or equal than time y. While passing through a tunnel from room i to room j, if the tunnel collapses while you're inside, you can use a hammer to break through, otherwise that path is impossible to take.",
  "sample_input": "Input:4\r\n6 6 2\r\n0 1 1 18 3 3\r\n0 2 1 12 4 4\r\n0 4 1 3 5 5\r\n2 3 1 8 2 2\r\n3 4 1 5 3 3\r\n4 5 5 20 1 1\r\n6 6 1\r\n0 1 1 18 3 3\r\n0 2 1 12 4 4\r\n0 4 1 3 5 5\r\n2 3 1 8 2 2\r\n3 4 1 5 3 3\r\n4 5 5 20 1 1\r\n6 6 0\r\n0 1 1 18 3 3\r\n0 2 1 12 4 4\r\n0 4 1 3 5 5\r\n2 3 1 8 2 2\r\n3 4 8 25 3 3\r\n4 5 5 20 1 1\r\n3 3 0\r\n0 1 0 5 4 4\r\n1 2 0 5 2 2\r\n0 2 0 5 6 6Output:Scenario #1: 6 6\r\nScenario #2: 7 6\r\nScenario #3: 12 10\r\nScenario #4: -1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RPLM",
  "scraped_at": "2025-08-17 00:34:28"
}