{
  "problem_code": "problems",
  "title": "Count weighted paths",
  "tags": [],
  "text": "John likes to take a walk from his house to university. He needs to arrive his university in at mostTseconds after leaving his home. We can represent the situation as aNvertices graph. Vertex 0 of the graph will be John's home and vertex 1 John's university. There can be bidirectional roads connecting pairs of vertices, each road will take John some seconds to cross.John likes variety. We consider a valid path to be a sequence of vertices that starts with vertex 0 (John's house) and finishes with vertex 1 (The University) and there exists a road connecting each pair of consecutive vertices in the sequences (Note that a vertex may appear multiple times in the path). The total time John needs to traverse a path is equal to the sum of the times needed to cross each individual road in it. Please count the total number of different paths that need at mostTminutes to be traversed in total. Two paths are different if there is at least one moment at which they visit different vertices.GivenT,Nand the roads between the vertices, ¿How many different paths that need at mostTseconds exist? Print the result modulo 1000000007 (109+7).InputThe first line consists of a integerTOTAL, the total number of test cases (1 <=N<= 10).Each of the following test cases begins with a single line that contains two integers :NandT. (2 <=N<= 5), (1 <=T<= 1000000000 (109)).TheNfollowing lines are indexed fromi=0 toN-1. Thei-thline will represent the roads that connect vertexiwith other vertices. The line will consist ofNcharacter indexed fromj=0 toN-1.Thej-th character of thei-th line represents the road connecting vertexiwith vertexj. If the character is '-', this means no road connects verticesiandj. Otherwise, the character will be a digit equal to 1,2 or 3, determining the number of minutes it takes John to move between verticesiandj.For every pair (i,j), the road character betweeniandjwill be the same as the one betweenjandi.For eachi, there will never be a road connecting vertexiwith itself.Vertex 0 represents John's house and Vertex 1 John's university.OutputFor each test case, show in a single line: \"Case #i: R\", where R is the total number of valid paths between vertices 0 and 1 that need at mostTseconds.ExampleInput:32 9-33-5 4--123--12311---22---33---3 100-212-313-Output:Case #1: 2Case #2: 4Case #3: 924247768NotesThere are two paths in the first case that need 9 minutes or less:0 → 1 (3 minutes)0 → 1 → 0 → 1 (9 minutes)The second case contains 4 paths that need at most 4 minutes to be traversed:0 → 2 → 1 (2 minutes)0 → 3 → 1 (4 minutes)0 → 2 → 0 → 2 → 1 (4 minutes)0 → 2 → 1 → 2 → 1 (4 minutes)0 → 4 → 1 is a path that needs 6 minutes.",
  "sample_input": "Input:32 9-33-5 4--123--12311---22---33---3 100-212-313-Output:Case #1: 2Case #2: 4Case #3: 924247768",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CNTPATHS",
  "scraped_at": "2025-08-17 00:34:19"
}