{
  "problem_code": "problems",
  "title": "grace marks",
  "tags": [],
  "text": "In earlier days, grading in BITS used to be absolute, instead of relative grading scheme. Once Professor Mathur decided to conduct a surprise quiz, and many students were caught unaware of it. Their scores of the students came out to be much worse than the previous years scores.Professor Mathur really believed that true test of talent comes in difficult situations and continued such horrifying sequences of tests. But finally poor placements of his students turned the heat up for the professor and he decided to revise everyone's marks.Now being a qualified mathematician, professor Mathur applied a simple strategy to this. He decided to award some constant grace marks to each and every student. He took every students last year marks and then added up the absolute difference with the revised current year marks. And he decided to choose the grace marks with the least sum of absolute difference. I.e. sum(abs (a[i] - (b[i]+grace))) should be minimum. Also, professor Mathur had a knack of choosing the grace value from his set of favourite numbers.Now that our students are happily placed in 'Microsoft', 'Adobe' for the good, credit finally goes to Professor Mathur.Now, decide for each input, what grace marks were given by Mathur. (If there are many such grace marks, choose the lowest one).InputFirst line, t for number of test cases. Next 5*t line for each test case.First line of every testcase: integer n.Second line: n integers showing previous years marks of every student.Third line: n integers showing present years marks of every student.Fourth line: integer m.Fifth line: m integers showing the possible values for grace marks.OutputOutput the expected grace marks.ExampleInput:159 10 7 3 104 1 4 1 360 1 2 3 4 5Output:5Constraintsnumber of testcases, t < 20maximum number of students: n < 100001 <= m, marks[i] <= 50000",
  "sample_input": "Input:159 10 7 3 104 1 4 1 360 1 2 3 4 5Output:5",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MTHUR",
  "scraped_at": "2025-08-17 00:34:25"
}