{
  "problem_code": "problems",
  "title": "Linear Garden",
  "tags": [],
  "text": "Ramesses II has just returned victorious from battle. To commemorate his\r\nvictory, he has decided to build a majestic garden. The garden will contain\r\na long line of plants that will run all the way from his palace at Luxor to\r\nthe temple of Karnak. It will consist only of lotus plants and papyrus\r\nplants, since they symbolize Upper and Lower Egypt respectively.The garden must contain exactly N plants. Also, it must be balanced: in any\r\ncontiguous section of the garden, the numbers of lotus and papyrus plants\r\nmust not differ by more than 2.A garden can be represented as a string of letters ‘L’ (lotus) and ‘P’\r\n(papyrus). For example, for N = 5 there are 14 possible balanced gardens. In\r\nalphabetical order, these are: LLPLP, LLPPL, LPLLP, LPLPL, LPLPP, LPPLL,\r\nLPPLP, PLLPL, PLLPP, PLPLL, PLPLP, PLPPL, PPLLP, and PPLPL.The possible balanced gardens of a certain length can be ordered\r\nalphabetically, and then numbered starting from 1. For example, for N=5,\r\ngarden number 12 is the garden PLPPL.TaskWrite a program that, given the number of plants N and a string that\r\nrepresents a balanced garden, calculates the number assigned to this garden\r\nmodulo some given integer M. Note that for solving the task, the value of M\r\nhas no importance other than simplifying computations.Constraints1 ≤ N ≤ 1,000,0007 ≤ M ≤ 10,000,000Input Format:Line 1: N, the number of plants in the gardenLine 2: MLine 3: A string of N characters ‘L’ (lotus) or ‘P’ (papyrus) that represents a balanced garden.Output Format:Line 1: Your program must write to the standard output a single line\r\n        containing one integer between 0 and M-1 (inclusive), the\r\n        number assigned to the garden described in the input, modulo\r\n        M.Example:Input:5\r\n7\r\nPLPPLOutput:5Explanation:The actual number assigned to PLPPL is 12. So, the output is 12 modulo 7,\r\nwhich is 5.",
  "sample_input": "Input:5\r\n7\r\nPLPPLOutput:5",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/LINEGAR",
  "scraped_at": "2025-08-17 00:34:14"
}