{
  "problem_code": "problems",
  "title": "Spiderman vs Sandman",
  "tags": [],
  "text": "There is a faceoff between Spiderman and Sandman.There are two glass buildings each of height H. Each building has H equal sized windows on the outside covering entire space from bottom to top. Some windows are open and Spiderman cannot land on these window.In one step, Spiderman can:Rise up to just above window of the same building he is on.Slide down to just below window of the same building he is on.Use his web to jump to Kth window above from current height on the other building.Sandman on the other rises steadily a rate of 1 per step.For the purpose of this problem, assume Spiderman and Sandman take turns i.e. Spiderman takes one step, then Sandman takes one step.Your goal is to assist Spiderman to always remain above or at same height as Sandman at the end of Sandman's turn. Spiderman gets the first turn and both start at height 0 (i.e. Sandman is on the ground and Spiderman is on the window of lowermost floor of left building. It is guaranteed that window of lowermost floor of left building is not open.Note: If Spiderman gets to area with height ≥ H assume he has got out.You are Spiderman's best friend, your duty is to guide Spiderman to escape from Sandman if possible in shortest number of steps to get out.InputFirst line contains integer T.T test cases follow. Each test case contains 3 lines.First line of input contains two space separated integers H and KNext two lines contain description of two buildings.2nd line represents the left building - a string of length H. The ithcharacter represents the state of window between (i-1) and i heights: character '-' represents closed window (safe to land on), character 'X' represents open window.Similarly 3rd line represents the right building.OutputFor every test case output single integer x where x is the number of steps taken to get out of building. Output \"NO\" if Spiderman cannot escape the area and has to fight in the enclosure.Constraints1 ≤ T ≤ 101 ≤ H, K ≤ 105ExampleInput:2\r\n7 3\r\n---X--X\r\n-X--XX-\r\n6 2\r\n--X-X-\r\nX--XX-Output:4\r\nNOExplanationIn first case Spiderman jumps to right building, goes one height down, jumps to left building and jumps to right building (he got to the top).In second case, no matter how he moves, Spiderman cannot escape above the buildings.",
  "sample_input": "Input:2\r\n7 3\r\n---X--X\r\n-X--XX-\r\n6 2\r\n--X-X-\r\nX--XX-Output:4\r\nNO",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SPIDY",
  "scraped_at": "2025-08-17 00:34:20"
}