{
  "problem_code": "problems",
  "title": "Salary Management",
  "tags": [],
  "text": "You are working as a software engineer of Moogle! Now the boss of Moogle wants you to create a program which will efficiently handle some operations. At first, we should tell you about the structure of the employees at Moogle! Each employee has an integer id from 1 to N. Where 1 is the id of the Managing Director of Moogle! , who is the greatest boss of all the employees. Then except the Managing Director, each employee has an immediate boss. No employees have more than one immediate boss. Now your boss wants to have some operation like this:He will give you an ID of an employee; you need to find the sum of salary of all the employees under that employee including him/herself.He will give you an ID of an employee; you need to increase the salary of all the employees under that employee including him/herself by the minimum of minimum salary of all the employees under that employee including him/her and 1000.Let’s see the structure, hope you will get a clear idea about the problem.Employee HierarchySalary Table:ID1234567Salary (BDT)50030020010010200100Now if your boss wants to do the first operation for Employee ID 2. Then the output will be: 300 + 100 + 200 = 600 BDT.If your boss wants to do the second operation for the Employee ID 1, then the salary table becomes:ID1234567Salary (BDT)51031021011020210110As minimum salary is 10 for Employee id 5 and which is less than 1000.InputInput starts with an integerT (≤ 3), denoting the number of test cases.The first line of a case is a blank line. The next line contains two integersN (1 ≤ N ≤ 105),q (1 ≤ q ≤ 50000)whereNdenotes the number of nodes andqdenotes the number of queries. The nodes are numbered from1toN.Then there will beNlines. Theith(1 ≤ i ≤ N)line contains two integerspiandsi(0 ≤ pi≤ N, 1 ≤ si< 500).pidenotes the parent andsidenotes the salary of theithemployee, respectively. You can assume that the employee id with 1 is the managing director and only its parent is 0.Each of the nextqlines contains a query. Each query contains two integers:candv (1 ≤ c ≤ 2, 1 ≤ v ≤ N), where c denotes operation type, and v denotes the employee id. If the c = 1, then it means to do the first operation. If c = 2, then the second operation.You can assume that the input builds a valid rooted tree.OutputFor each case, print the case number in a line. Then for each query type 1, print the sum of the salary.ExampleInput:1\r\n\r\n7 3\r\n0 500\r\n1 300\r\n1 200\r\n1 100\r\n3 10\r\n2 200\r\n2 100\r\n1 2\r\n2 1\r\n1 2Output:Case 1:\r\n600\r\n630NoteDataset is huge. Use faster I/O methods.Problem Setter: Ahmad FaiyazSpecial Thanks: Syed Shahriar Manjur",
  "sample_input": "Input:1\r\n\r\n7 3\r\n0 500\r\n1 300\r\n1 200\r\n1 100\r\n3 10\r\n2 200\r\n2 100\r\n1 2\r\n2 1\r\n1 2Output:Case 1:\r\n600\r\n630",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SALMAN",
  "scraped_at": "2025-08-17 00:34:31"
}