{
  "problem_code": "problems",
  "title": "Charlie and the Chocolate Factory",
  "tags": [],
  "text": "Charlie Bucket is a loving and kind boy, who lives in poverty with his mother, father and four bedridden grandparents. Down the street, there is Willy Wonka’s chocolate factory who is famous for both his chocolates and the factory. After long years of conducting business with chocolate, now Wonka finally decided to make an heir to the factory.So, instead of putting golden tickets in ordinary Wonka bars (which is old fashioned...:P) he decided to take a programming contest to choose 5 candidates for the heir. And, then he will give a tough problem to them (among these five) and the first to answer will be the winner.After taking the contest Wonka eventually gets his five candidates and Charlie is one of them. Now, before throwing the heir deciding problem towards them he decided to give them 2 hints.1st hint is an algorithm whose pseudo code is given below# 'array' is 1-indexed\r\n    def MakeNewArray(array, d):\r\n        if d == 1:\r\n            return array\r\n        else:\r\n            array = MakeNewArray(array, d-1)\r\n            new_array = [array[array[i]] for i in 1..inf]\r\n            return new_arrayFor example, ifarray = [2, 3, 5, 7, 11, ...], thenMakeNewArray(array, 2) = [3, 5, 11, ...].2nd hint isKuddusarray. AKuddusarray is a sorted array ofKuddusnumbers.Kuddusnumbers are suchprimenumbers which can be expressed as the summation of squares of two distinct positive integers.For, example 5 can be expressed as 12+22. So it is aKuddusnumber. Also 13 (32+ 22) and 17 (42+ 12) areKuddusnumber. So, first few numbers ofKuddusarray are 5, 13, 17 ... etc.Now, it’s time for the heir deciding problem. The problem is as follows. There arenboxes and all of them are initially empty (no chocolate). Now in every step (starts from 1st step to the last) Wonka will do some sets of operation. The operation are of four kinds. The operation is indicated by an integerop.If op=1. Then it is an add operation and it is followed by two integersa, b. It means Wonka will addbchocolates in box numbera.If op=2. Then it is a multiplication operation which is also followed by two integersa, b. It means Wonka will multiply the number of chocolates in box numberabyb.If op=3. Then it is a swap operation which is also followed bya, b. It means the boxesaandbwill exchange their chocolates.If op=4. Then it is a clear operation which is followed by only a single integera. This means Wonka will remove all chocolates from boxa.There are2sets of operation. One is anordinaryset and another isspecialset. In normal steps he will perform theordinaryset of operation serially (as it appears in the input). And in the special steps he will perform thespecialset of operation serially. Special step number is stored in an array calledSpecialarray.More precisely, he has an array namedSpecialof infinite numbers. It is a sorted array. The elements of the array are denoted bySpecial[1], Special[2], Special[3]...etc [normal array system]. So he will perform the special operation only atSpecial[1]th, Special[2]th, Special[3]th... etc steps.Now:Special := MakeNewArray(Kuddus, d).HereMakeNewArrayandKuddusare described previously.dis an integer which will be given in the input. At last Wonka will tell the number of stepss.Now, Charlie is busy in some other works. So, he needs your help. You will have to answer afterssteps what is the total number of chocolates in all the boxes (summation of all the chocolates in every box).InputInput consists of some test cases (not more than15).Every case begins with two integern (≥ 2)andd (1 ≤ d ≤ 5). Then there is an integerop1which denotes the number of operation for ordinary steps. The nextop1lines each contain a numberop(1 ≤ op ≤ 4)and ifop ≤ 3then it is followed by two integersaandb, otherwise(op=4)it is followed bya. The meaning of them is described above. Then there is another integerop2which denotes the number of operations for special steps and the nextop2steps is also followed by same format of input asop1is followed. Finally comes the number of stepss (1 ≤ s ≤ 108).The meaning of every symbol is described above. Every input is a non-negative integer and not more than1000unless stated otherwise. There are no illegal input (i.e. there is no illegal box where operation will be performed). It is also guaranteed that there are equal number of cases for each possible values ofdandn ≤ 2 × d2.OutputFor each test case the answer will be just a single line denoting the total number of chocolates in the boxes afterssteps. You should return theanswer % 264.ExampleInput:2 1\r\n5\r\n1 1 1\r\n1 2 1\r\n2 1 2\r\n2 2 3\r\n3 1 2\r\n3\r\n1 1 1\r\n1 2 1\r\n3 1 2\r\n4\r\n\r\n2 1\r\n5\r\n1 1 1\r\n1 2 1\r\n2 1 2\r\n2 2 3\r\n3 1 2\r\n3\r\n1 1 1\r\n1 2 1\r\n3 1 2\r\n5Output:119\r\n121Problem Setter: Syed Shahriar Manjur, Special Thanks: Nafis Ahmed",
  "sample_input": "# 'array' is 1-indexed\r\n    def MakeNewArray(array, d):\r\n        if d == 1:\r\n            return array\r\n        else:\r\n            array = MakeNewArray(array, d-1)\r\n            new_array = [array[array[i]] for i in 1..inf]\r\n            return new_array",
  "sample_output": "Input:2 1\r\n5\r\n1 1 1\r\n1 2 1\r\n2 1 2\r\n2 2 3\r\n3 1 2\r\n3\r\n1 1 1\r\n1 2 1\r\n3 1 2\r\n4\r\n\r\n2 1\r\n5\r\n1 1 1\r\n1 2 1\r\n2 1 2\r\n2 2 3\r\n3 1 2\r\n3\r\n1 1 1\r\n1 2 1\r\n3 1 2\r\n5Output:119\r\n121",
  "link": "https://www.spoj.com/problems/CHARCHOC",
  "scraped_at": "2025-08-17 00:34:18"
}