{
  "problem_code": "problems",
  "title": "Tree and Palindrome",
  "tags": [],
  "text": "You are given a tree withNnodes. The tree has following propertiesIt is rooted at node 1Node 1 situated in level 0. The children of node 1 is situated in level 1, the children of the level 1 nodes is situated in level 2, the children of the level 2 nodes is situated in level 3 and so on.Every node is marked by a letter. The nodes of the same level are marked by the same letter.Level zero nodes are marked by 'a', level 1 nodes are marked by 'b', level 2 nodes are marked by 'c'. Level 25 nodes are marked by 'z', level 26 nodes are marked again by 'a', level 27 nodes are marked by 'b' and so on. (The levelling is rotational.)If we take all the letters of the nodes serially which are in the path from node a to node b (including a, b) and concatenate them, then we find a string. The name of the string isBokkorstring of pair (a, b).You will be given a pair of distinct nodes. You don't know in advance which pair will be given. The probability of choosing every pair is same. Now your job is to calculate the probability that theBokkorstring of the given pair is a palindrome inp/qformat (where p and q are co-prime).Here the pair (2, 3) forms the Bokkor string \"bab\" which is a palindrome. And the pair (4, 5) forms the Bokkor string \"cbabc\" which is also a palindrome. There are no other palindromic Bokkor pairs.InputThere will be multiple testcases. The first line of each test case starts with a numberN(3 ≤ N ≤ 105)which denotes the number of nodes in the tree. NextN-1lines of the test-case each consist of a pair of integersu, v (1 ≤ u, v ≤ N and u ≠ v)which denotes there is an edge between u and v. It is guaranteed that the input is legal (no multiple edges and it forms a valid tree.)OutputFor each test case output is just a single line\"p/q\"(without the quotes) as described above. It is guaranteed that p>=1.SampleInput5\r\n1 2\r\n1 3\r\n2 4\r\n3 5\r\n6\r\n1 2\r\n1 3\r\n3 4\r\n3 5\r\n2 6Output1/5\r\n4/15N.B. Dataset is huge, use faster IO.Problem Setter: Syed Shahriar Manjur.Special Thanks: Abdullah Al Maruf, Ahmad Faiyaz.",
  "sample_input": "Input5\r\n1 2\r\n1 3\r\n2 4\r\n3 5\r\n6\r\n1 2\r\n1 3\r\n3 4\r\n3 5\r\n2 6Output1/5\r\n4/15",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TREEPAL",
  "scraped_at": "2025-08-17 00:34:32"
}