{
  "problem_code": "problems",
  "title": "Robert Langdon & Florence",
  "tags": [],
  "text": "As a token of thanks for his help, Elizabeth Sinskey has gifted Robert Langdon an amazing set of Russian dolls. The dolls have the property that if doll A has height HAand doll B has height HB, then B can fit inside A if HA≥ HB.Robert noted the heights of the dolls (two dolls can have same height), and then arranged the dolls in a line beautifully. For each doll he noted down the number of dolls that are before this doll in the line and can contain this doll. He wrote this down on another piece of paper.Accidentally, the dolls fell out of line, and Robert wants to arrange them back beautifully. Given the two pieces of information (heights of the dolls and number of dolls before this in line that can contain this doll), can you rearrange the dolls beautifully?InputFirst line containsT, number of test cases.Each test case consists of 3 lines:First line of each test case has a single numberN, number of dolls.Second line contains arrayH, space separated array of size N containing the heights of dolls.Third line contains arrayC, space separated array of size N, C[i] indicating number of dolls before this in the beautiful arrangement that can contain doll i.OutputFor each test case, output a single line containing the heights of dolls in order as they were when Robert arranged them beautifully.Assume that a valid solution always exists.ExampleInput:2\r\n3\r\n12 13 14\r\n0 0 2\r\n3\r\n12 14 13\r\n0 1 0Output:13 14 12\r\n13 12 14ExplanationFor the first case, (arrangement 13, 14, 12) 13 and 14 cannot be contained by any doll prior to them, but 12 can be put in doll 13 as well as doll 14, hence the array 0 0 2.For the second case, (arrangement 13, 12, 14) 12 can be contained in 13, hence the array 0 1 0.Constraints1 ≤ T ≤ 5001 ≤ N ≤ 5001 ≤ H[i] ≤ 109",
  "sample_input": "Input:2\r\n3\r\n12 13 14\r\n0 0 2\r\n3\r\n12 14 13\r\n0 1 0Output:13 14 12\r\n13 12 14",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RLTOUR",
  "scraped_at": "2025-08-17 00:34:27"
}