{
  "problem_code": "problems",
  "title": "Faridi and Yadav",
  "tags": [],
  "text": "Once it happened that the two scientists (perhaps mad)Mr YadavandMr Farididiscovered an unusual radioactive compound named mahobanium, that decays at constant rate. And as the compound decays it loses weight. The two of them start playing a game, in which both of them sit at equal distance from a point C, one sits to the west and the other to the east. Being famous scientists a lot of students have come to see them (basically not to see them but the compound, they had discovered). The students have gathered around the two. The scientist also have a small robot, named CHOTU.Initially Mr Faridi has all the stones of mahobanium compound with him and all have equal weight. Faridi gives stones (one at a time) to CHOTU and directs him to show the compound to one of the student (who hasn't seen the compound yet) and then immediately go towards Mr Yadav. (Assume no loss of time in showing the stone to students, also CHOTU follows the shortest path while moving and always runs at same speed = 5m/s). The students, actually have placed themselves in such a way that all the stones that have reached Yadav have the same weight. (Assume that radioactive decay starts as soon as it is placed in CHOTU's hand). A child can place itself to at most distance of X units from the centre along east or west, and to at most distance of Y units from the centre C along north or south.Given test cases t (< 1000) the values of X and Y (say X > Y) and (X < 1000), scratch your brain to find out the maximum distance that can exist between Mr Yadav and Faridi so that above conditions are always followed. Print your answer with 3 decimal places.InputFirst Line has number of test cases t.The next t lines have two integers X and Y separated by space [the values of X and Y (say X > Y) and (X < 1000)].OutputPrint the required answer with 3 decimal places.SampleInput1\r\n4 2Output6.928",
  "sample_input": "Input1\r\n4 2Output6.928",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CHOTU",
  "scraped_at": "2025-08-17 00:34:30"
}