{
  "problem_code": "problems",
  "title": "Robert Langdon & Class Attendance",
  "tags": [],
  "text": "With growing popularity of Robert in Harvard, many students have started opting for his course on Symbolism as institute elective course. Class strength has increased to an extent that even with his eidetic memory; Robert is having a hard time remembering faces of the students in his class. This made him switch to using attendance sheet to take attendance of the class.ImagineNstudents sitting in a straight row, students are numbered 1 to N. Attendance sheet is first given to student 1, who uses his own pen to sign the sheet. Then he passes the sheet to student 2, and chooses whether or not to give him the pen too. If student 2 doesn't get a pen from student 1, he will take out his own pen. Student 2, after signing the sheet, will pass the sheet to student 3, and again makes a choice whether or not to pass the pen. Note that he can even pass the pen that came to him from student 1.So first student's pen might end up being used by the entire class.A person becomes annoyed if his pen is used by someone who is not his friend. Each person has a \"compatibility value\", and two students are friends if the absolute difference of their compatibility values is less than or equal to a given thresholdD.Given compatibility values of each student in the class, find the minimum number of students that must take out their pens to sign so that no one gets annoyed.NOTE : it is not allowed that a person gets a pen from his neighbour, and passes it along without using it (i.e., uses his own pen for his attendance and passes ahead the pen of his neighbour).InputFirst line containsT, number of test cases.Each test case has two lines.First line of each test case contains two space separated integersNandD, indicating the number of students in the class and friendship threshold respectively.Next line contains a space separated array A of N elements, A[i] being the compatibility value of ith student.OutputFor each test case, output in a single line minimum number of pens that must be taken out so that the whole class is able to mark the attendance and no one gets annoyed.ExampleInput:2\r\n5 2\r\n3 1 2 4 5\r\n5 3\r\n1 4 7 1 5\r\n\r\nOutput:\r\n1\r\n2Constraints1 ≤ T ≤ 10001 ≤ N ≤ 3000001 ≤ D ≤ 109Sum of all N over all test cases will not exceed 3000001 ≤ A[i] ≤ 109",
  "sample_input": "Input:2\r\n5 2\r\n3 1 2 4 5\r\n5 3\r\n1 4 7 1 5\r\n\r\nOutput:\r\n1\r\n2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/RLCAT",
  "scraped_at": "2025-08-17 00:34:22"
}