{
  "problem_code": "problems",
  "title": "Coprime Pairs",
  "tags": [],
  "text": "Mr. Yagami is playing a game of arrays. He is given two random arraysAandBconsisting ofNpositive integer elements. Game starts by Mr. Yagami assigning0or1to each element inAandB.After this assignment is done, a graph is constructed with a node for each element in the array A and B (2Nnodes) and no edges. The game proceeds with a valid move being defined in the following way:One of the arrays fromAorBis selected. From the selected array, an element which has been marked0is chosen. Let us call this element asX.A set of elements,Y, are chosen from the array, which was not chosen in the first step, such that all elements ofYshould be marked as1and all elements ofYshould be greater thanXand no element ofYshould be coprime toX.Finally an edge is drawn from the node labelledXto all the nodes corresponding to the elements in setY. There can only be a single edge between any2nodes in the graph.He can make as many valid moves. Mr. Yagami receives1point for each edge that is drawn in the graph.Mr. Yagami is very clever, so he makes the initial assignment in such a way that it maximizes the number of points he receives in the game. You have to return the maximum number of points that Mr. Yagami can receive.InputThe first line of the input contains a single integer,N (1 ≤ N ≤ 40)The second line of input containsNintegers separated by a single space character, which represent the elements of the arrayA. (2 ≤ A[i] ≤ 109)Similarly, the last line of input also containsNintegers separated by a single space character, which represent the elements of the arrayB. (2 ≤ B[i] ≤ 109)OutputA single integer representing the maximum score which Mr. Yagami can receive.SampleInput:4\r\n16 3 2 9\r\n12 18 13 4Output:8ExplanationHe picks 2 from first array. So he gets to put 3 edges i.e. 2 → 4, 2 → 12, 2 → 18.Next he picks 3 from the first array. So he gets to put 2 edges i.e. 3 → 12, 3 → 18.Next he picks 9 from the first array. So he gets to put 2 edges i.e. 9 → 12, 9 → 18.Next he picks 16 from the first array. So he gets to put 1 edge i.e. 16 → 18. Total edges = 8.Problem Setter: Lalit Kundu",
  "sample_input": "Input:4\r\n16 3 2 9\r\n12 18 13 4Output:8",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NCOPRIME",
  "scraped_at": "2025-08-17 00:34:22"
}