{
  "problem_code": "problems",
  "title": "abs(a",
  "tags": [],
  "text": "Recently Mr. Kopa Samsu is learning programming. On a very renowned online judge, he found a problem:You are given an array of N numbers in non-decreasing order. You have to answer the summation of the absolute difference of all distinct pairs in the given array.Do you know what distinct pair means? Suppose you have an array of 3 elements: 3 5 6Then all the distinct pairs are:3 53 65 6For this problem, Mr. Kopa Samsu implemented an algorithm to find the summation of the absolute difference of all distinct pairs. His algorithm was:int ABS(int a[], int n)\r\n{\r\n    int sum = 0;\r\n    for (int i = 1; i <= n ;i++)\r\n    {\r\n        for (int j = i + 1; j <= n; j++)\r\n        {\r\n            sum += abs(a[i] - a[j]);\r\n        }\r\n    }\r\n}After a great hard work, he finished the code. But alas!!! Frustration came around him when he submitted his code, the judge gave the verdict “TLE” (Time Limit Exceeded). “How can I get rid of TLE?” he thought a lot but couldn't find any way. Then suddenly, he remembered about you that you (his friend) is very good at programming. So, he came to you seeking your help. Can you help him solving this problem?InputThe input data set starts with an integer T (T ≤ 1000), the number of test cases. Then every test case starts with a integer N (N ≤ 10000), the number of elements in the array. After that, the next line contains N integers A[i], where 1 ≤ i ≤ N and 1 ≤ A[i] ≤ 1000000000 and A[i] ≤ A[i+1].OutputEvery test case should output an integer “X”, where X is the summation of the absolute difference of all the distinct pair.ExampleInput:3\r\n3\r\n1 2 3\r\n3\r\n1 4 5\r\n3\r\n2 4 6Output:4\r\n8\r\n8Problem Set: S.M. Shaheen Sha, Raihat Zaman NeloyData Set & Solution: Raihat Zamane Neloy",
  "sample_input": "int ABS(int a[], int n)\r\n{\r\n    int sum = 0;\r\n    for (int i = 1; i <= n ;i++)\r\n    {\r\n        for (int j = i + 1; j <= n; j++)\r\n        {\r\n            sum += abs(a[i] - a[j]);\r\n        }\r\n    }\r\n}",
  "sample_output": "Input:3\r\n3\r\n1 2 3\r\n3\r\n1 4 5\r\n3\r\n2 4 6Output:4\r\n8\r\n8",
  "link": "https://www.spoj.com/problems/ABSP1",
  "scraped_at": "2025-08-17 00:34:18"
}