{
  "problem_code": "problems",
  "title": "Takeover Wars",
  "tags": [],
  "text": "You are studying a takeover war between two large corporations, Takeover Incorporated and Buyout\r\nLimited. Each of these corporations controls a number of subsidiaries. The aim in this war is simply\r\nto drive the competition out of the market. There are N subsidiaries of Takeover Incorporated and M\r\nsubsidiaries of Buyout Limited, and you know the market value of each subsidiary.Each company can designate one of its subsidiaries to perform a takeover. The takeover can either be\r\nfriendly or hostile. A friendly takeover means a subsidiary of a corporation merges with a different\r\nsubsidiary of the same corporation. The market value of the merged subsidiary is the sum of the market\r\nvalues of the constituent subsidiaries. There is no constraint on the relative sizes of the subsidiaries\r\nparticipating in a friendly takeover.A hostile takeover means a subsidiary A of a corporation attempts to take over a subsidiary B of the\r\nother corporation. For this to succeed, the market value of A has to be greater than the market value of\r\nB. After this move, B disappears from the market. The market value of A does not change (the gain of\r\nincorporating B’s assets is offset by the monetary cost of the takeover). For simplicity we assume that\r\nno sequence of moves leads to two subsidiaries of different corporations having the same market value.\r\nThe companies take turns making moves in this takeover war, with Takeover Incorporated going first.\r\nA company will do nothing on its turn only if it cannot make a takeover. A company loses the takeover\r\nwar if all its subsidiaries are taken over.Your aim is to learn which company can guarantee a victory from this war. In the first case of the\r\nsample data, Takeover Incorporated can simply take over one of the companies of Buyout Limited in\r\nits first move with the 7-value subsidiary. Then it will lose one of its small (1-value) subsidiaries to a\r\nhostile takeover, and then it will take over the second subsidiary of Buyout Limited. In the second case,\r\nTakeover has to make a friendly takeover in its first move. Buyout Limited will join its two subsidiaries\r\ninto a single company with market value 10. Takeover will have to make a friendly takeover again\r\n(as again it will not have a large enough subsidiary to take over Buyout’s giant). Now Takeover will\r\nhave two subsidiaries, valued either 9 and 3 or 6 and 6. In either case, Buyout takes over one of these\r\nsubsidiaries, Takeover has to pass, and Buyout takes over the other one.InputEach test case is described by three lines of input. The first line contains two numbers 1 ≤ N ≤ 105and\r\n1 ≤ M ≤ 105denoting respectively the number of subsidiaries of Takeover Incorporated and Buyout\r\nLimited. The next line lists the N sizes a i of the subsidiaries of Takeover Incorporated (1 ≤ a i ≤ 1012),\r\nand the third line lists the M sizes b j of the subsidiaries of Buyout Limited (1 ≤ b j ≤ 1012).OutputFor each test case, display the case number and either the phrase Takeover Incorporated or the\r\nphrase Buyout Limited depending on who wins the takeover war if both corporations act optimally.ExampleInput:3 2\r\n7 1 1\r\n5 5\r\n4 2\r\n3 3 3 3\r\n5 5Output:Case 1: Takeover Incorporated\r\nCase 2: Buyout Limited",
  "sample_input": "Input:3 2\r\n7 1 1\r\n5 5\r\n4 2\r\n3 3 3 3\r\n5 5Output:Case 1: Takeover Incorporated\r\nCase 2: Buyout Limited",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TKV1000",
  "scraped_at": "2025-08-17 00:34:27"
}