{
  "problem_code": "problems",
  "title": "Naughty and Balls",
  "tags": [],
  "text": "Mr. Naughty likes to play with balls. So his friend, Mr. Nice, gave himnballs to play a game. Each ball has exactly two numbers (the number on the top and the number on the bottom). In one move Mr. Naughty can rotate any ball so that its bottom now becomes the top. Mr. Nice knows the minimum number of such moves that can make at least half of the balls show same number on their top. So to win Mr. Nice's game, Mr. Naughty should figure out the minimum number of moves. It's not always possible to make such moves that satisfy the given condition. In this case Mr. Naughty should figure out that it is \"Impossible\" to make such moves.Help Mr. Naughty to win the game.InputThe first line contains a single integern- the number of balls. The followingnlines contain the description of all balls, one ball per line. Each description has a pair of non-negative integers not exceeding105- numbers on top and bottom. The first number in a line is the number on top, the second one - on the bottom. The number on the top of the ball may be same as the number on the bottom.The numbers in the lines are separated by single spaces.OutputOn a single line print a single integer - the minimum number of moves to win the game. If it is impossible to make the set funny, print \"Impossible\" (quotes for clarity).Constraints:1 ≤ n ≤ 105SampleInput:3\r\n3 100\r\n100 3\r\n5 4Output:1ExplanationIn this case Mr Naughty can rotate the first ball so that number on the top becomes 100. Since two of the three balls have same number on their top (100), you do not need to change anything else, so the answer is 1.Input:5\r\n5 9\r\n5 9\r\n3 2\r\n1 4\r\n5 7Output:0Input:3\r\n1 2\r\n3 4\r\n5 6Output:ImpossibleProblem Setter: Prateek Sachdev",
  "sample_input": "Input:3\r\n3 100\r\n100 3\r\n5 4Output:1",
  "sample_output": "Input:5\r\n5 9\r\n5 9\r\n3 2\r\n1 4\r\n5 7Output:0",
  "link": "https://www.spoj.com/problems/NAUGHTY",
  "scraped_at": "2025-08-17 00:34:16"
}