{
  "problem_code": "problems",
  "title": "Drunk Game",
  "tags": [],
  "text": "Alice and Bob were getting bored and decided to play a game. The game involves a pile of coins. Both players take turns in picking a certain number of coins from the pile. Initially, the pile containsNcoins. Alice makes the first move. The player who is unable to pick up any coins in his/her turn loses the game. Some of the details of the game are:In each turn a player can only decide on picking up1, 4, 9, 16coins from the pile.As both the players are drunk and not in complete control of their actions, even if they decide on picking up some coins, they might end up picking something else completely. So, if a person decides on picking upXcoins from the pile, he/she might end up with(X - 1), X or (X + 1)coins with the relative probability ofC1: C2: C3In each turn a player has to eventually pick up at least1coin.Note that a player cannot decide on picking upXcoins from the pile if the pile contains less thanXcoins at the time. Also, if a player decided on picking upXcoins and it happens that picking up(X + 1)is not valid (this might happen if there are onlyXcoins in the pile), then the relative probability distribution for the valid moves will beC1: C2. Similarly, if picking up(X - 1)coins is not valid, then the relative probability distribution for the valid moves will beC2: C3.As both of them are not in their right minds, they sometimes want to win and sometimes want to lose. But Bob still wonders what is his probability of winning/losing the game (depending on what he wants for a particular game). Help him find out his probability!InputThe first line of the input contains a single integer,T, which represents the number of test cases. Each test case contains3lines. The first line of each test contains a single integer,N, which represents the number of coins in the pile initially. The second line contains 3 integersC1, C2 and C3. The last line of each test contains2integers describing the mood of Alice and Bob respectively.0is for losing and1is for winning.OutputFor each test cases, the probability of winning/losing (depending on the test case) rounded to4places of precision.Constraints1 ≤ T ≤ 101 ≤ N ≤ 10000001 ≤ C1, C2, C3 ≤ 100000SampleInput:2\r\n1\r\n1 2 3\r\n0 0\r\n5\r\n1 2 3\r\n0 1Output:1.0000\r\n0.4333Problem Setter: Sukhjashan Singh",
  "sample_input": "Input:2\r\n1\r\n1 2 3\r\n0 0\r\n5\r\n1 2 3\r\n0 1Output:1.0000\r\n0.4333",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DRUNK",
  "scraped_at": "2025-08-17 00:34:18"
}