{
  "problem_code": "problems",
  "title": "Tanks",
  "tags": [],
  "text": "Surprisingly, the king of the Quadruple Island Kingdom suddenly declares war on its neighbor country, the Utopia Land. After that, the King dispatches a large number of tanks for first attack. You, as the Defence Minister of Utopia Land, are certainly under mass of pressure. In order to defeat the enemy, you decide to use the new secret weapon: laser cannon. This kind of weapon is so powerful that can easily destroy any thing at a line in a moment, or course, including tanks.However, because of some design flaw, you can use such weapon just once during the war. The only hope is that you can choose a good moment and right way to use it so that as many tanks as possible can be destroyed.A tank can be described as a point whose coordinate is (Xi, Yi) on a 2D-plain with speed vector (VXi, VYi) per second. Starting at time 0, you can use your laser cannon at any position and in any direction at any INTEGER number of seconds after time 0. It is possible that some tanks will meet at the same point while moving, and they will not influence each other anyway.InputMultiple test cases. The number of test cases is no more than 10. For each test cases, The first line contains a single integerN(1 <=N<= 100) indicating the number of tanks. ThenNlines are following that describing the tanks respectively. Each of them consists of four nonzero integer Xi, Yi, VXi, VYiseparated by single spaces where |Xi|,|Yi| <= 100,000,000 and |VXi|,|VYi| <= 100 denoting the initial position of a tank and the speed vector. Input ends withN= 0.OutputFor each test case, output one line with a single integer indicating the largest number of tanks which can be destroyed by the laser cannon.Note: Be careful when handling floating point errors.ExampleInput:4\r\n10 10 -1 -1\r\n3 1 4 6\r\n2 8 5 -1\r\n1 3 1 4\r\n0Output:3",
  "sample_input": "Input:4\r\n10 10 -1 -1\r\n3 1 4 6\r\n2 8 5 -1\r\n1 3 1 4\r\n0Output:3",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TANKS",
  "scraped_at": "2025-08-17 00:34:30"
}