{
  "problem_code": "problems",
  "title": "Cipher",
  "tags": [],
  "text": "Bob and Alice started to use a brand-new encoding scheme. Surprisingly it is not a Public Key Cryptosystem, but their encoding and decoding is based on secret keys. They chose the secret key at their last meeting in Philadelphia on February 16th, 1996. They chose as a secret key a sequence ofndistinct integers, A1...An, greater than zero and less or equal ton. The encoding is based on the following principle. The message is written down below the key, so that characters in the message and numbers in the key are correspondingly aligned. Character in the message at the positioniis written in the encoded message at the positionai, whereaiis the corresponding number in the key. And then the encoded message is encoded in the same way. This process is repeatedktimes. Afterkth encoding they exchange their message.The length of the message is always less or equal thann. If the message is shorter thann, then spaces are added to the end of the message to get the message with the lengthn.Help Alice and Bob and write program which reads the key and then a sequence of pairs consisting ofkand message to be encodedktimes and produces a list of encoded messages.InputThe input file consists of several blocks. Each block has a number 0 < n ≤ 200 in the first line. The next line contains a sequence ofnnumbers pairwise distinct and each greater than zero and less or equal thann. Next lines contain integer numberkand one message of ascii characters separated by one space. The lines are ended with eol, this eol does not belong to the message. The block ends with the separate line with the number 0. After the last block there is in separate line the number 0.OutputOutput is divided into blocks corresponding to the input blocks. Each block contains the encoded input messages in the same order as in input file. Each encoded message in the output file has the lengthn. After each block there is one empty line.Sample Input10\r\n4 5 3 7 2 8 1 6 10 9\r\n1 Hello Bob\r\n1995 CERC\r\n0\r\n0Sample OutputBolHeol  b\r\nC RCE",
  "sample_input": "10\r\n4 5 3 7 2 8 1 6 10 9\r\n1 Hello Bob\r\n1995 CERC\r\n0\r\n0",
  "sample_output": "BolHeol  b\r\nC RCE",
  "link": "https://www.spoj.com/problems/CIPHERJ",
  "scraped_at": "2025-08-17 00:34:32"
}