{
  "problem_code": "problems",
  "title": "The Prime conjecture",
  "tags": [],
  "text": "Euclid may have been the first to prove that there are infinitely many primes. Let's walk through his proof, as even today, it's regarded as an excellent model of reasoning.Let us assume the converse, that there only a finite number of primes: p1, p2, ... pn. Letm= 1 +i=1Πnpi,i.e. the product of all of these primes plus one. Since this number is bigger than any of the primes on our list, m must be composite. Therefore, some prime must divide it. But which prime? In fact, m leaves a reminder of 1 when divided by any prime pi, for 1 <= i <= n. Thus, p1, p2, ... pncannot be the complete list of primes, because if so m must also be a prime. Since this contradicts the assumption it means there cannot exist such a complete list of primes; therefore the number of primes must be infinite!Your mathematician friend Wannabe_Fermat has come up with a conjecture which he keeps telling to anyone who is willing to lend an ear: \"The numbermthat we come up with when multiplying anyndistinct prime numbers and adding 1 to this result is also a prime\". You as Wannabe_Zuckerburg, are becoming jealous as your friend's conjecture is gaining popularity and decide to come up with a program that finds counter-examples to shut him up forever.InputThe first line contains T, the number of test cases. Each test case consists of two lines, the first line containing the numbern- the number of primes in our list, and second line containing n space-separated prime numbers. Moreover, following things can be safely assumed:1 <= T <= 10nwill be at most 9 andmcan be contained in 32-bits.OutputFor each input case x, the output is of the format \"Case #x: y\", where y =mif m is a prime, else y is the largest prime factor ofm.ExampleInput:2\r\n3\r\n2 3 5\r\n4\r\n2 7 5 11Output:Case #1: 31\r\nCase #2: 257ExplanationCase #1 - 31 is a prime numberCase #2 - 2*5*7*11 + 1 = 771, which can be written as 3*257.",
  "sample_input": "Input:2\r\n3\r\n2 3 5\r\n4\r\n2 7 5 11Output:Case #1: 31\r\nCase #2: 257",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PRIMEZUK",
  "scraped_at": "2025-08-17 00:34:23"
}