{
  "problem_code": "problems",
  "title": "Black and White",
  "tags": [],
  "text": "The famous game Black and White is a solitaire which is played using a set of identical chips. Each chip has two faces with different colors. Surprisingly enough, those colors are black and white.The game starts by placingNchips forming a single line. There exists an objective pattern which is a given sequence ofNcolors black or white. In a single move, the player can choose a group of consecutive chips and invert their color, in other words, for each chip in the group, the color which was facing up, is facing down and the one which was facing down is facing up. The game finishes when the facing up colors of the chips are equal to the objective pattern.Barby has just discovered this game and soon she realized that you can always won by inverting each chip individually if needed. To make this game more challenging to her, she wanted to win in the least possible number of moves. Note that Barby just cares about how many moves she makes, and it doesn't matter how many chips are inverted in each move. To know how well is Barby playing, she asked you to make a program that given the chip's initial position and the objective pattern, shows the least possible number of moves to win the game. Are you going to say no?InputThe input contains several test cases. Each test case is described in a single line that contains two non-empty wordsSandTof equal size and at most 500 letters each.Sindicates the chip's initial position whileTrepresents the objective pattern. Both words only contain uppercase letters \"B\" and \"N\", representing respectively White and Black. The last line of the input contains two asterisks separated by a single space and should not be processed as a test case.OutputFor each test case output a single line with an integer representing the least possible number of moves such that you can change the chips which are initially positioned as described inSto form the pattern given byT.ExampleInput:BBNBBNBBBB NNNNNBBNNB\r\nBNBNB NBNBN\r\nBNBN NBNB\r\nB B\r\n* *Output:3\r\n1\r\n1\r\n0",
  "sample_input": "BBNBBNBBBB NNNNNBBNNB\r\nBNBNB NBNBN\r\nBNBN NBNB\r\nB B\r\n* *",
  "sample_output": "3\r\n1\r\n1\r\n0",
  "link": "https://www.spoj.com/problems/BANDW",
  "scraped_at": "2025-08-17 00:34:30"
}