{
  "problem_code": "problems",
  "title": "Equilibrium",
  "tags": [],
  "text": "The mean and the median usually confuse the students because of their similar spelling, but they are quite different concepts. In this problem we are going to work with the mean and the median of a set consisting ofNpairwise distinct integers, whereNis odd. The mean of such set is defined, as usual, as the sum of the numbers divided byN, while the median is the unique element in the set that is greater than (N-1)/2 of its elements, and less than the other (N-1)/2 elements in the set. For instance, if the set is {0, 2, 6, 4, 13}, then the mean is 5 while the median is 4.We aim to make student's lives easier by generating \"balanced\" sets, that is, sets consisting of an odd number of pairwise distinct integers where the mean and the median coincide. For example, the set {0, 2, 6, 4, -2} is balanced, since it hasN=5 different integers, and the mean and the median are both equal to 2.The following procedure has been suggested in order to obtain balanced sets. A set with an even number of distinct integers is chosen, and an extra integer distinct from every element in the set is added to it, in such a way that the resulting set is balanced. We want you to check if the given procedure works. Therefore your task is, givenN-1 distinct integers, with oddN, count the number of balanced sets that can be formed by following the described procedure.InputThe input contains several test cases. Each test case is described with two lines. The first line contains a single odd positive integerNthat indicates the number of elements the balanced set must have (3 <=N<= 499). The second line containsN-1 distinct integersZ_ithat represent the given elements of the set (-1014<=Z_i<= 1014for 1 <=i<=N-1). The last line of the input contains the number -1, and should not be processed as a test case.OutputFor each test case, output a single line with an integer representing the total number of different balanced sets that can be obtained by adding an integer to the given set, as explained in the problem description.ExampleInput:5\r\n0 2 6 4\r\n7\r\n1 2 3 4 5 8\r\n3\r\n-100000000000000 100000000000000\r\n-1Output:3\r\n1\r\n3",
  "sample_input": "5\r\n0 2 6 4\r\n7\r\n1 2 3 4 5 8\r\n3\r\n-100000000000000 100000000000000\r\n-1",
  "sample_output": "3\r\n1\r\n3",
  "link": "https://www.spoj.com/problems/EQUI",
  "scraped_at": "2025-08-17 00:34:33"
}