{
  "problem_code": "problems",
  "title": "Circuits",
  "tags": [],
  "text": "Everyone is aware of the existence of the well known Nordenskjold  Archipelago, located in the Arctic Ocean and belonging to the Krasnoyarsk Krai of Russia. This archipelago  consists of a groups ofNislands andMaquatic routes between some  pairs of islands. Each route connects a pair of islands and for each  pair there is at most one route connecting them.Considering the popularity of Nordenskjold Archipelago,  Krasnoyarsk's authorities are concerned about its touristic value. The  touristic value of the archipelago is given by the total number of  islands that belong to at least one “touristic circuit”.  A touristic circuit is a path starting and ending in the same island  that visits at least three different islands, never visits the same  island more than once and uses just aquatic routes to go from one  island to the next one.Krasnoyarsk's authorities want to know the minimum number of  additional aquatic routes that must be built so that every  island belongs to at least one touristic circuit. Your task is to  write a program that answers this question.InputThe input contains several test cases. Each test case is described  in several lines. The first line contains two integer numbersNandM(3 ≤N≤ 100, 1 ≤M≤ 1000) which indicate the number  of islands and the number of aquatic routes, respectively. Each  island is identified by a number between 1 andN. Each of the nextMlines contains two integersUandV(1 ≤U<V≤N),  indicating that there is an aquatic route connecting islandsUandV.  You may assume that in each test case there is at most one aquatic  route connecting the same pair of islands. The last line of the input  contains the number -1 twice and should not be processed as a test case.OutputFor each test case output a single line with an integer  representing the  minimum number of  additional aquatic routes that must be built so that every  island belongs to at least one touristic circuit.ExampleInput:3 1\r\n1 3\r\n9 10\r\n1 2\r\n2 3\r\n1 3\r\n7 9\r\n5 9\r\n5 7\r\n6 8\r\n4 6\r\n4 8\r\n8 9\r\n4 4\r\n1 2\r\n1 4\r\n1 3\r\n2 3\r\n12 9\r\n1 7\r\n2 6\r\n4 9\r\n9 10\r\n8 12\r\n1 5\r\n1 8\r\n8 11\r\n4 10\r\n-1 -1Output:2\r\n0\r\n1\r\n4",
  "sample_input": "Input:3 1\r\n1 3\r\n9 10\r\n1 2\r\n2 3\r\n1 3\r\n7 9\r\n5 9\r\n5 7\r\n6 8\r\n4 6\r\n4 8\r\n8 9\r\n4 4\r\n1 2\r\n1 4\r\n1 3\r\n2 3\r\n12 9\r\n1 7\r\n2 6\r\n4 9\r\n9 10\r\n8 12\r\n1 5\r\n1 8\r\n8 11\r\n4 10\r\n-1 -1Output:2\r\n0\r\n1\r\n4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CIRCUITS",
  "scraped_at": "2025-08-17 00:34:32"
}