{
  "problem_code": "problems",
  "title": "Factory of Bridges",
  "tags": [],
  "text": "In the Central Area of Macedonia there is a river following the East-West direction. The region's inhabitants want to build a bridge that crosses the river in the North-South direction, a task for which they have contracted the cheapest bridge factory they know, the Short Bridge Construction Company. As shown by its name, this construction company specializes in building the shortest possible bridges for each river.The first thing that the company does is to model the river's shores (Northern and Southern). Each of these is considered as being formed by semicircles of varying radii, alternatively oriented to one side or the other, with all their centers collinear. The two lines that are defined by the centers of the semicircles of each shore have the East-West direction, and are separated by a distanceAone from the other. The valueAis called the width of the river. Note that both shores are aligned, that is, the Northern shore neither begins nor ends further to the West or to the East than the Southern shore.In the following figure you can see the model of a certain river. In the Northern shore the semicircle furthest to the West is oriented to the North, whereas in the Southern shore the semicircle furthest to the West is oriented to the South. In each shore the orientations of the following semicircles alternate. The shortest possible bridge in the North-South direction is the one shown.Your task is to help the construction company finding the length of the shortest possible bridge connecting both shores of the river in the North-South direction.InputThe input contains several test cases. Each test case is described by three lines. The first line contains an integer numberA, denoting the width of the river in meters (3 <=A<= 104). The second line describes the Northern shore of the river, while the third line describes its Southern shore.The description of each shore begins with an integer numberCgiving the number of semicircles that are used to model that shore (1 <=C<= 1000). This is followed by a character \"N\" or \"S\", meaning that the semicircle furthest to the West in this shore is oriented to the North or to the South, respectively. The description ends withCinteger numbersR_i, representing the radii in meters of the semicircles that form the shore (1 <=R_i<A/2 for 1 <=i<=C). The semicircles are given in order, from the one furthest to the West (radiusR_1) to the one furthest to the East (radiusR_C). The orientations of the semicircles alternate between North and South after the first semicircle, whose orientation is given as described above. Assume that in each test case both shores are aligned, which implies that the sum of the radii of the semicircles forming each shore is the same.The end of the input is denoted by a line containing the number -1.OutputFor each test case, print a single line containing a rational number representing the length in meters of the shortest bridge that connects both shores of the given river in the North-South direction. Round the result to the nearest rational number with 2 decimal digits. In case of ties, round up. Note that you should always print 2 digits after the dot, even if this means ending with a zero.ExampleInput:5\r\n3 N 1 2 1\r\n2 S 2 2\r\n3\r\n1 N 1\r\n1 S 1\r\n3\r\n1 S 1\r\n1 N 1\r\n-1Output:1.54\r\n3.00\r\n1.00",
  "sample_input": "5\r\n3 N 1 2 1\r\n2 S 2 2\r\n3\r\n1 N 1\r\n1 S 1\r\n3\r\n1 S 1\r\n1 N 1\r\n-1",
  "sample_output": "1.54\r\n3.00\r\n1.00",
  "link": "https://www.spoj.com/problems/FBRIDGES",
  "scraped_at": "2025-08-17 00:34:34"
}