{
  "problem_code": "problems",
  "title": "Joy of CompuTenis",
  "tags": [],
  "text": "The Modern Club Association organizes every year a tournament of CompuTenis, which is a sport specially adapted to a public without any mensurable physical qualities. The rules of CompuTenis are very complex (suffices to say that they involve coding with your elbow glued to your ear), but fortunately it is not necessary to know them in detail to solve this problem. You just need to know that in a CompuTenis match two players oppose each other, and the match is won by the player that first winsSsets; in turn, each set is composed of several games, and to win a set a player must win at leastJgames, with a difference of at leastDmore games won than the opponent.The tournament hasKrounds, and there areN= 2Kplayers in it, who all participate in the first round. In each round each of the remaining participating players is paired with another participating player, in order to play a single match. The winning player of each of these matches advances to the next round, whereas the losing player is automatically disqualified from the tournament. The winner of the only match of roundKis thus the winner of the tournament.It is desirable to make the tournament as long as possible, considering that the  matches are broadcast on television and the Association is paid for every minute on air. Given any pair of different players, the Association knows the probability for one of them to win a game against the other. You are a member of the organizing committee, and your task is to prepare the fixture for the matches of each round in order to maximize the expected number of games played in the tournament. Doing this involves deciding which pairs of players will play a match in the first round, and then for each of the following rounds deciding which pair of matches from the previous round will provide the winning players for each match in that round. Note that this can only depend on the identification of the matches in the previous round. The following figure shows a possible fixture forK= 3 rounds andN= 23= 8 players.For the moment, the Association only wants to estimate their earnings, so it is sufficient to tell them the maximum expected number of games that can be played in the tournament.InputThe input contains several test cases. Each test case is described using several lines. The first line contains four integer numbers,K,S,JandD. The valueKdenotes the number of rounds in the tournament (1 <=K<= 3). The valueSdenotes the number of sets that a player must win to win a match (1 <=S<= 10). The valueJdenotes the minimum number of games that a player must win in order to win a set, whereasDindicates that a player should winDmore games than its opponent for him to win the set (1 <=D<=J<= 100). The players are identified by different integer numbers from 1 toN= 2K. Each of the followingNlines containsNvalues. In thei-th line, thej-th value is an integer numberP_ijsuch thatp_ij=P_ij/100 is the probability that player numberiwins a game against player numberj(0 <=P_ij<= 100 for 1 <=i,j<=N). You may assume thatP_ii= 0 (no player opposes himself) and thatP_ij+P_ji= 100 foriandjdifferent.The end of the input is denoted by a line containing four times the number -1.OutputFor each test case, you should print a line containing a rational number representing the maximum expected number of games that the given tournament can have. The result should be rounded to the nearest rational number with 2 decimal digits. In case of ties, round up. Note that you should always print 2 digits after the dot, even if this means ending with a zero.ExampleInput:1 1 2 2\r\n0 50\r\n50 0\r\n3 3 6 2\r\n0 88 2 76 71 24 50 4\r\n12 0 54 37 84 95 88 98\r\n98 46 0 66 36 13 33 33\r\n24 63 34 0 29 21 96 63\r\n29 16 64 71 0 0 47 13\r\n76 5 87 79 100 0 56 89\r\n50 12 67 4 53 44 0 23\r\n96 2 67 37 87 11 77 0\r\n-1 -1 -1 -1Output:4.00\r\n224.08",
  "sample_input": "1 1 2 2\r\n0 50\r\n50 0\r\n3 3 6 2\r\n0 88 2 76 71 24 50 4\r\n12 0 54 37 84 95 88 98\r\n98 46 0 66 36 13 33 33\r\n24 63 34 0 29 21 96 63\r\n29 16 64 71 0 0 47 13\r\n76 5 87 79 100 0 56 89\r\n50 12 67 4 53 44 0 23\r\n96 2 67 37 87 11 77 0\r\n-1 -1 -1 -1",
  "sample_output": "4.00\r\n224.08",
  "link": "https://www.spoj.com/problems/JOCTENIS",
  "scraped_at": "2025-08-17 00:34:20"
}