{
  "problem_code": "problems",
  "title": "He is Lazy",
  "tags": [],
  "text": "As we all know, Humberto is really lazy. He is so lazy that he sticks his nose out of the window so that the wind will blow it for him. Obviously, he hasn't worked at all in his whole life. However, he got lucky and won a lot of money in the lottery. With some of that money he bought an empty field, and made build several houses inside of it, where he moved with his family and friends. Thus, Humberto can go in a straight line from any point in his field to any other, without having to make detours because of urban design (for the sake of simplicity, we consider the objects in Humberto's field as dots, so they don't interfere in Humberto's way).Sadly, that was not enough for Humberto, so in order to walk even less he decided to have installed some catapults in strategic points of his field. Each catapult can send him from the point where it is installed, to any point at a certain fixed distance (that depends on the range of the catapult).But, in spite of simplifying his life, the catapults made the task of choosing a way in the field a real headache, because Humberto wants to walk as less as possible. As tired as he is of all his problems, he decided to use the rest of his money to hire you to tell him the minimum distance he has to walk to move from a given point in the field to another.InputThe input contains several test cases. Each test case is described in several lines. The first line contains five integersN,PX,PY,LXandLY.Nrepresents the number of catapults in the field (1 ≤N≤ 100). The pair (PX,PY) indicates the coordinates in the XY plane ot the starting point for Humberto, while the pair (LX,LY) indicates analogously the destination point (1 ≤PX,PY,LX,LY≤ 109). Each of the nextNlines describes a different catapult, using three integersCX,CYandF, that indicate the point (CX,CY) where the catapult of strengthFis installed. This means that Humberto may move, without walking, from the point (CX,CY) to any point in the plane that is at a distance ofexactlyFfrom (CX,CY). Assume that in each test case all the points given in the plane are different. The end of the input is indicated by a single line containing the number -1 five times, and it should not be processed as a test case.OutputFor each test case, output a single line containing a rational number that represents the minimum distance Humberto has to walk in order to get from the starting point to the destination point, using some or none of the catapults. Round the answer to the nearest rational with two decimal digits. In case of a tie, round up. Print exactly two digits after the decimal point, even if that means ending the number with 0's.ExampleInput:1 10 10 20 10\r\n11 10 9\r\n1 20 10 10 10\r\n11 10 9\r\n2 1 1 12 1\r\n3 1 6\r\n8 1 5\r\n1 12 12 1 1\r\n6 6 9\r\n5 10 10 1 1\r\n3 3 7\r\n8 3 7\r\n8 8 7\r\n3 8 7\r\n5 5 5\r\n-1 -1 -1 -1 -1Output:1.00\r\n10.00\r\n4.00\r\n10.41\r\n5.11",
  "sample_input": "Input:1 10 10 20 10\r\n11 10 9\r\n1 20 10 10 10\r\n11 10 9\r\n2 1 1 12 1\r\n3 1 6\r\n8 1 5\r\n1 12 12 1 1\r\n6 6 9\r\n5 10 10 1 1\r\n3 3 7\r\n8 3 7\r\n8 8 7\r\n3 8 7\r\n5 5 5\r\n-1 -1 -1 -1 -1Output:1.00\r\n10.00\r\n4.00\r\n10.41\r\n5.11",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HEISLAZY",
  "scraped_at": "2025-08-17 00:34:37"
}