{
  "problem_code": "problems",
  "title": "Revenge of Fibonacci",
  "tags": [],
  "text": "The well-known Fibonacci sequence is defined as following:Here we regard n as the index of the Fibonacci number F(n).This sequence has been studied since the publication of Fibonacci's bookLiber Abaci. So far, many properties of this sequence have been introduced.You had been interested in this sequence, while after reading lots of papers about it. You think there's no need to research in it anymore because of the lack of its unrevealed properties. Yesterday, you decided to study some other sequences like Lucas sequence instead.Fibonacci came into your dream last night. \"Stupid human beings. Lots of important properties of Fibonacci sequence have not been studied by anyone, for example, from the Fibonacci number 347746739…\"You woke up and couldn't remember the whole number except the first few digits Fibonacci told you. You decided to write a program to find this number out in order to continue your research on Fibonacci sequence.InputThere are multiple test cases. The first line of input contains a single integer T denoting the number of test cases (T ≤ 50000).For each test case, there is a single line containing one non-empty string made up of at most 40 digits. And there won't be any unnecessary leading zeroes.OutputFor each test case, output the smallest index of the smallest Fibonacci number whose decimal notation begins with the given digits. If no Fibonacci number with indexsmaller than100000 satisfy that condition, output -1 instead – you think what Fibonacci wants to told you beyonds your ability.ExampleInput:15\r\n1\r\n12\r\n123\r\n1234\r\n12345\r\n9\r\n98\r\n987\r\n9876\r\n98765\r\n89\r\n32\r\n51075176167176176176\r\n347746739\r\n5610Output:Case #1: 0\r\nCase #2: 25\r\nCase #3: 226\r\nCase #4: 1628\r\nCase #5: 49516\r\nCase #6: 15\r\nCase #7: 15\r\nCase #8: 15\r\nCase #9: 43764\r\nCase #10: 49750\r\nCase #11: 10\r\nCase #12: 51\r\nCase #13: -1\r\nCase #14: 1233\r\nCase #15: 22374This problem is first solved by teamY.E.S(Tsinghua University)at 77 minutes after the onsite contest starts. (They have 2 wrong tries before they get Accepted.)",
  "sample_input": "Input:15\r\n1\r\n12\r\n123\r\n1234\r\n12345\r\n9\r\n98\r\n987\r\n9876\r\n98765\r\n89\r\n32\r\n51075176167176176176\r\n347746739\r\n5610Output:Case #1: 0\r\nCase #2: 25\r\nCase #3: 226\r\nCase #4: 1628\r\nCase #5: 49516\r\nCase #6: 15\r\nCase #7: 15\r\nCase #8: 15\r\nCase #9: 43764\r\nCase #10: 49750\r\nCase #11: 10\r\nCase #12: 51\r\nCase #13: -1\r\nCase #14: 1233\r\nCase #15: 22374",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/REVFIB",
  "scraped_at": "2025-08-17 00:34:24"
}