{
  "problem_code": "problems",
  "title": "Repairing Roads",
  "tags": [],
  "text": "The country of Byteland contains of N cities and N - 1 bidirectional roads between them such that there a path between any two cities. The roads in Byteland were built long ago and now they are in need of repair. You have been hired to repair all the roads. You intend to do this by dispatching robots on some of the roads. Each robot will repair the road he is currently on and then move to one of the adjacent unrepaired roads. After repairing that, he will move to another adjacent unrepaired road, repair that and so on. Two roads are adjacent if they have the same city at one of their endpoints. For the process to be efficient, no two robots will can ever repair the same road, and no road can be visited twice. What is the least number of robots needed to accomplish the task?InputThe first line contains the number of test cases T. T test cases follow. The first line contains N, the number of cities in Byteland. The cities are numbered 0..N - 1. The following N - 1 lines contain the description of the roads. The ith line contains two integers aiand bi, meaning that there is a road connecting cities with numbers aiand bi.OutputOutput T lines, one corresponding to each test case containing the required answer for that test case.Constraints1 ≤ T ≤ 201 ≤ N ≤ 100000 ≤ ai, bi< NExampleInput:3\r\n4\r\n0 1\r\n0 2\r\n0 3\r\n6\r\n0 1\r\n1 2\r\n2 3\r\n2 4\r\n4 5\r\n7\r\n0 1\r\n1 2\r\n2 3\r\n2 4\r\n4 5\r\n3 6Output:1\r\n1\r\n2ExplanationFor the first case, one robot is enough to repair all roads: (0, 1) → (0, 2) → (0, 3)For the second case, one robot is again enough: (0, 1) → (1, 2) → (2, 3) → (2, 4) → (4, 5)For the third case, there is no way to repair all the roads with one robot and at least two are needed.",
  "sample_input": "Input:3\r\n4\r\n0 1\r\n0 2\r\n0 3\r\n6\r\n0 1\r\n1 2\r\n2 3\r\n2 4\r\n4 5\r\n7\r\n0 1\r\n1 2\r\n2 3\r\n2 4\r\n4 5\r\n3 6Output:1\r\n1\r\n2",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/CODESPTI",
  "scraped_at": "2025-08-17 00:34:30"
}