{
  "problem_code": "problems",
  "title": "Pool construction",
  "tags": [],
  "text": "You are working for the International Company for Pool Construction, a construction company which specializes in building swimming pools. A new client wants to build several new pool areas.A pool area is a rectangular grid ofw×hsquare patches, consisting of zero or more (possibly disconnected) pools. A pool consists of one or multiple connected hole patches, which will later be filled with water. In the beginning, you start with a piece of land where each patch is either a hole in the ground ('.') or flat grass ('#'). In order to transform this land into a pool area, you must adhere to the following:You can leave a patch as it is. This costs nothing.If the patch is grass in the beginning, you can dig a hole there. This costsdEUR.If the patch is a hole in the beginning, you can fill the hole and put grass on top. This costsfEUR.Youmustplace special boundary elements along each edge running between a final grass patch and a final hole patch, to ensure that water does not leak from the pool. This costsbEUR per boundary element.The outermost rows and columns of the pool area must always be grass.You are given the task of calculating the cost of the cheapest possible pool area given the layout of the existing piece of land.InputOn the first line a positive integer: the number of test cases, at most 100. After that per test case:one line with two integerswandh(2 ≤w, h≤ 50): the width and height of the building site.one line with three integersd,fandb(1 ≤d, f, b≤ 10 000): the costs for digging a new hole, filling an existing hole, and building a boundary element between a pool and grass patch.hlines ofwcharacters each, denoting the layout of the original building site.OutputPer test case:one line with an integer: the cost of building the cheapest possible pool area from the original piece of land.ExampleInput:3\r\n3 3\r\n5 5 1\r\n#.#\r\n#.#\r\n###\r\n5 4\r\n1 8 1\r\n#..##\r\n##.##\r\n#.#.#\r\n#####\r\n2 2\r\n27 11 11\r\n#.\r\n.#Output:9\r\n27\r\n22",
  "sample_input": "Input:3\r\n3 3\r\n5 5 1\r\n#.#\r\n#.#\r\n###\r\n5 4\r\n1 8 1\r\n#..##\r\n##.##\r\n#.#.#\r\n#####\r\n2 2\r\n27 11 11\r\n#.\r\n.#Output:9\r\n27\r\n22",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NWERC11F",
  "scraped_at": "2025-08-17 00:34:39"
}