{
  "problem_code": "problems",
  "title": "Smoking gun",
  "tags": [],
  "text": "Andy: ”Billy the Kid fired first!”Larry: ”No, I’m sure I heard the first shot coming from John!”The arguments went back and forth during the trial after the big shoot-down, somewhere in the old wild west. Miraculously, everybody had survived (although there were serious injuries), but nobody could agree about the exact sequence of shots that had been fired. It was known that everybody had fired at most one shot, but everything had happened very fast. Determining the precise order of the shots was important for assigning guilt and penalties.But then the sheriff, Willy the Wise, interrupted: ”Look, I’ve got a satellite image from the time of the shooting, showing exactly where everybody was located. As it turns out, Larry was located much closer to John than to Billy the Kid, while Andy was located just slightly closer to John than to Billy the Kid. Thus, because sound travels with a finite speed of 340 meters per second, Larry may have heard John’s shot first, even if Billy the Kid fired first. But, although Andy was closer to John than to Billy the Kid, he heard Billy the Kid’s shot first – so we know for a fact that Billy the Kid was the one who fired first!Your task is to write a program to deduce the exact sequence of shots fired in situations like the above.InputOn the first line a positive integer: the number of test cases, at most 100. After that per test case:one line with two integersn(2 ≤n≤ 100) andm(1 ≤m≤ 1000): the number of people involved and the number of observations.nlines with a stringS, consisting of up to 20 lower and upper case letters, and two integersxandy(0 ≤x, y≤ 1 000 000): the unique identifier for a person and his/her position in Cartesian coordinates, in metres from the origin.mlines of the form “S1 heard S2 firing before S3”, whereS1,S2andS3are identifiers among the people involved, andS2 ≠ S3.If a person was never mentioned asS2orS3, then it can be assumed that this person never fired, and only acted as a witness. No two persons are located in the same position.The test cases are constructed so that an error of less than 10-7in one distance calculation will not affect the output.OutputPer test case:one line with the ordering of the shooters that is compatible with all of the observations, formatted as the identifiers separated by single spaces.If multiple distinct orderings are possible, output “UNKNOWN” instead. If no ordering is compatible with the observations, output “IMPOSSIBLE” instead.SampleInput:3\r\n4 2\r\nBillyTheKid 0 0\r\nAndy 10 0\r\nJohn 19 0\r\nLarry 20 0\r\nAndy heard BillyTheKid firing before John\r\nLarry heard John firing before BillyTheKid\r\n2 2\r\nAndy 0 0\r\nBeate 0 1\r\nAndy heard Beate firing before Andy\r\nBeate heard Andy firing before Beate\r\n3 1\r\nAndy 0 0\r\nBeate 0 1\r\nCharles 1 3\r\nBeate heard Andy firing before CharlesOutput:BillyTheKid John\r\nIMPOSSIBLE\r\nUNKNOWN",
  "sample_input": "Input:3\r\n4 2\r\nBillyTheKid 0 0\r\nAndy 10 0\r\nJohn 19 0\r\nLarry 20 0\r\nAndy heard BillyTheKid firing before John\r\nLarry heard John firing before BillyTheKid\r\n2 2\r\nAndy 0 0\r\nBeate 0 1\r\nAndy heard Beate firing before Andy\r\nBeate heard Andy firing before Beate\r\n3 1\r\nAndy 0 0\r\nBeate 0 1\r\nCharles 1 3\r\nBeate heard Andy firing before CharlesOutput:BillyTheKid John\r\nIMPOSSIBLE\r\nUNKNOWN",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NWERC11G",
  "scraped_at": "2025-08-17 00:34:40"
}