{
  "problem_code": "problems",
  "title": "Movie collection",
  "tags": [],
  "text": "Mr. K. I. has a very big movie collection. He has organized his collection in a big stack. Whenever he wants to watch one of the movies, he locates the movie in this stack and removes it carefully, ensuring that the stack doesn’t fall over. After he finishes watching the movie, he places it at the top of the stack.Since the stack of movies is so big, he needs to keep track of the position of each movie. It is sufficient to know for each movie how many movies are placed above it, since, with this information, its position in the stack can be calculated. Each movie is identified by a number printed on the movie box.Your task is to implement a program which will keep track of the position of each movie. In particular, each time Mr. K. I. removes a movie box from the stack, your program should print the number of movies that were placed above it before it was removed.InputOn the first line a positive integer: the number of test cases, at most 100. After that per test case:one line with two integersmandr(1 ≤m, r≤ 100000): the number of movies in the stack and the number of locate requests.one line withrintegersa1...ar(1 ≤ai≤m) representing the identification numbers of movies that Mr. K. I. wants to watch.For simplicity, assume that the initial stack contains the movies with identification numbers 1,2... min increasing order, where the movie box with label 1 is the top-most box.OutputPer test case:one line withrintegers, where thei-th integer gives the number of movie boxes above the box with labelai, immediately before this box is removed from the stack.Note that after each locate requestai, the movie box with labelaiis placed at the top of the stack.ExampleInput:2\r\n3 3\r\n3 1 1\r\n5 3\r\n4 4 5Output:2 1 0\r\n3 0 4",
  "sample_input": "Input:2\r\n3 3\r\n3 1 1\r\n5 3\r\n4 4 5Output:2 1 0\r\n3 0 4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NWERC11C",
  "scraped_at": "2025-08-17 00:34:36"
}