{
  "problem_code": "problems",
  "title": "Tracking RFIDs",
  "tags": [],
  "text": "Jeroen operates a warehouse storage facility for the North Western Electrical Resource Company (NWERC). When a customer places an order with NWERC, this order is conveyed to the warehouse. Jeroen’s task is to then find the products ordered, pack them into a box, and ship them to the customer.NWERC has an unusual warehouse policy: the products are not arranged in any particular order, and are strewn all over the place. However, it is possible for Jeroen to do his job because each product is tracked using RFID technology1. Specifically, each product is assigned a wireless RFID chip as soon as it enters the warehouse, and sensors located on the warehouse ceiling are used to automatically track the products.By default, each sensor has a range ofrunits – that is, it can read any RFID chip that is located at mostrunits from it in a straight line. However, if the line segment between a sensor and a product intersects with or touchesxwalls, the range of the sensor is reduced byxunits in that direction. Furthermore, the sensors may fail to read an RFID chip due to interference from other sensors, so the distance between any pair of sensors in the warehouse is guaranteed to be at leastrunits. You may further assume that no sensor or product is placed on a wall.Jeroen now wants to determine, for each product, which sensors can read its RFID chip. Can you help him?Figure 1: Illustration of sensors, walls and products as in the Sample Input.InputOn the first line one positive integer: the number of test cases, at most 100. After that per test case:one line with four integerss(1 ≤s≤ 250000),r(1 ≤r≤ 25),w(0 ≤w≤ 10) andp(1 ≤p≤ 10000) wheresrepresents the number of sensors,rthe range of each sensor,wthe number of walls andpthe number of products.slines containing two integersxiandyi(-10000 ≤xi, yi≤ 10000). Each such line represents a sensor at location (xi,yi). The distance between any pair of sensors is guaranteed to be at leastrunits.wlines containing four integersbxi,byi,exiandeyi(-10000 ≤bxi, byi, exi, eyi≤ 10000). Each such line represents a wall, which should be considered as straight line segment from (bxi,byi) to (exi,eyi). The length of this line segment will be positive.plines, each containing two integerspxiandpyi(-10000 ≤pxi, pyi≤ 10000). Each such line represents a product at location (pxi,pyi).OutputPer test case:plines, each representing a product in the order they appear in the input. Each line should contain an integert, the number of sensors that can track the product; this integer should then be followed by a list oftordered pairs representing the corresponding sensor locations. If there are multiple sensors, they should be sorted in increasing order byx-coordinate. If multiple sensors have the samex-coordinate, they should be sorted in increasing order byy-coordinate.ExampleInput:1\r\n4 3 4 7\r\n0 0\r\n-1 3\r\n2 3\r\n11 5\r\n-4 -1 5 -1\r\n3 5 6 1\r\n11 4 11 3\r\n12 5 12 8\r\n1 1\r\n0 -2\r\n4 4\r\n11 2\r\n13 5\r\n13 7\r\n14 5Output:3 (-1, 3) (0, 0) (2, 3)\r\n1 (0, 0)\r\n0\r\n0\r\n1 (11, 5)\r\n0\r\n01Objects, that have a radio-frequency identification (RFID) tag attached, can be tracked using radio waves.",
  "sample_input": "Input:1\r\n4 3 4 7\r\n0 0\r\n-1 3\r\n2 3\r\n11 5\r\n-4 -1 5 -1\r\n3 5 6 1\r\n11 4 11 3\r\n12 5 12 8\r\n1 1\r\n0 -2\r\n4 4\r\n11 2\r\n13 5\r\n13 7\r\n14 5Output:3 (-1, 3) (0, 0) (2, 3)\r\n1 (0, 0)\r\n0\r\n0\r\n1 (11, 5)\r\n0\r\n0",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NWERC11I",
  "scraped_at": "2025-08-17 00:34:21"
}