{
  "problem_code": "problems",
  "title": "Help Dr Whooves",
  "tags": [],
  "text": "On the continent of Equestria, Dr. Whooves used to have it all. He owned a very successful transportation business which was connected to all the villages and towns of Equestria. However, when Discord took over Equestria, a lot of the ponies got confused. Even now, some of his workers are working at the wrong routes, and Dr. Whooves is pretty sure that his business is now fragmented, and that he isn't connected to all the villages of Equestria anymore.Twilight Sparkle and her friends are here to help. Dr. Whooves knows that there is some minimum number of routes he'll need to add to make sure his business is reconnected. He asked Twilight Sparkle and her friends to find out how many different ways he can choose to add this minimum number of routes so that his business is connected to all the cities of Equestria. There might be a lot of ways, so the ponies have agreed upon giving the answer modulo 999,999,937.InputFirst is an integer T, the number of test cases, followed by T sets of data for each test case.Each test case is in the following format:It indicates that there are C cities, numbered 1 through C, and R routes, on a single line. After that follow R lines, each containing two city numbers Ai and Bi, indicating a bidirectional route between cities Ai and Bi.Test cases are not separated by blank lines, and the input ends with the last line of the final test case.Constraints: 1 ≤ C ≤ 1000000, 0 ≤ R < min{C, 100000}OutputT lines, each containing the number of different ways Dr. Whooves can choose to add the minimum number of routes required to reconnect his business, modulo 999999937.ExampleInput:4\r\n4 0\r\n3 1\r\n1 2\r\n5 4\r\n1 2\r\n2 3\r\n3 4\r\n2 5\r\n7 6\r\n2 3\r\n3 4\r\n2 4\r\n5 6\r\n6 7\r\n7 5Output:16\r\n2\r\n1\r\n63",
  "sample_input": "Input:4\r\n4 0\r\n3 1\r\n1 2\r\n5 4\r\n1 2\r\n2 3\r\n3 4\r\n2 5\r\n7 6\r\n2 3\r\n3 4\r\n2 4\r\n5 6\r\n6 7\r\n7 5Output:16\r\n2\r\n1\r\n63",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PONY1",
  "scraped_at": "2025-08-17 00:34:25"
}