{
  "problem_code": "problems",
  "title": "Disney Fastpass",
  "tags": [],
  "text": "Disney's FastPass is a virtual queuing system created by the Walt Disney Company. First introduced in 1999 (thugh the idea of a ride reservation system was first introduced in world fairs), FastPass allows guests to avoid long lines at the attractions on which the system is installed, freeing them to enjoy other attractions during their wait. The service is available at no additional charge to all park guests.--- WikipediaDisneyland is a large theme park with plenties of entertainment facilities, also with a large number of tourists. Normally, you need to wait for a long time before getting the chance to enjoy any of the attractions. The FastPass is a system allowing you to pick up FastPass-tickets in some specific position, and use them at the corresponding facility to avoid long lines. With the help of the FastPass System, one can arrange his/her trip more efficiently.You are given the map of the whole park, and there are some attractions that you are interested in. How to visit all the interested attractions within the shortest time?InputThe first line contains an integerT(1 ≤T≤ 25), indicating the number of test cases.Each test case contains several lines.\r\nThe first line contains three integersN,M,K(1 ≤N≤ 50, 0 ≤M≤N(N-1)/2, 0 ≤K≤ 8), indicating the number of locations(starting with 1, and 1 is the only gate of the park where the trip must be started and ended), the number of roads and the number of interested attractions.The followingMlines each contains three integersA,B,D(1 ≤A,B≤N, 0 ≤D≤ 104) which means it takesDminutes to travel between locationAand locationB.The followingKlines each contains several integersPi,Ti,FTi,Ni,Fi,1,Fi,2...Fi,Ni-1,Fi,Ni, (1 ≤Pi,Ni,Fi,j≤N, 0 ≤FTi≤Ti≤ 104), which means the i-th interested attraction is placed at locationPiand there areNilocationsFi,1,Fi,2...Fi,Niwhere you can get the FastPass for thei-th attraction. If you come to thei-th attraction with its FastPass, you need to wait for onlyFTiminutes, otherwise you need to wait forTiminutes.You can assume that all the locations are connected and there is at most one road between any two locations.\r\nNote that there might be several attractions at one location.OutputFor each test case in the input, print one line:\"Case #X: Y\", whereXis the test case number (starting with 1) andYis the minimum time of the trip.ExampleInput:2\r\n4 5 2\r\n1 2 8\r\n2 3 4\r\n3 4 19\r\n4 1 6\r\n2 4 7\r\n2 25 18 1 3\r\n4 12 6 1 3\r\n4 6 2\r\n1 2 5\r\n1 4 4\r\n3 1 1\r\n3 2 1\r\n3 4 1\r\n2 4 10\r\n2 8 3 1 4\r\n4 8 3 1 2Output:Case #1: 53\r\nCase #2: 14",
  "sample_input": "Input:2\r\n4 5 2\r\n1 2 8\r\n2 3 4\r\n3 4 19\r\n4 1 6\r\n2 4 7\r\n2 25 18 1 3\r\n4 12 6 1 3\r\n4 6 2\r\n1 2 5\r\n1 4 4\r\n3 1 1\r\n3 2 1\r\n3 4 1\r\n2 4 10\r\n2 8 3 1 4\r\n4 8 3 1 2Output:Case #1: 53\r\nCase #2: 14",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/DISNEY",
  "scraped_at": "2025-08-17 00:34:34"
}