{
  "problem_code": "problems",
  "title": "Tichu",
  "tags": [],
  "text": "Tichu is a card game played by four players. The players sit around a square table, and each player forms a team with the person sitting opposite him or her. The game is played with a standard deck of cards and four additional special cards. The basic rule of the game is as follows: the player who won the last trick can start a new trick with any legal combination of cards. Then, in turn, each next player can either pass or play the same combination of cards, but with a higher value. This continues until everyone passes, and at that point the player who played the last combination wins the trick and can start a new trick. The main goal is to get rid of all of your cards as soon as possible.These basic rules make it a good tactic to combine the cards in such a way that they can be played in as few combinations as possible. For simplicity we consider here a slightly modified version of the game. We ignore the special cards, so that leaves a standard deck of 52 cards, ranging over the values2toAceand over the suitshearts,diamonds,clubs, andspades. The suits are indicated by the lowercase lettersh,d,c, ands, while the values are indicated in increasing order by2–9,T,J,Q,K,A.The following list is a complete set of legal combinations:1any single card;a pair of cards of the same value;three cards of the same value;four cards of the same value;a full house, that is, three cards of the same value and two cards of another, same       value, for example444KK;a straight of length at least five, that is, at least five cards of consecutive increasing       values, for example89TJQK.In this problem, your task is to determine the minimum number of combinations that your hand of 13 cards can be partitioned into.InputOn the first line a positive integer: the number of test cases, at most 100. After that per test case:one line that describes your hand of 13 cards. A card is described by two characters:       the value followed by the suit. All cards in your hand are different.OutputPer test case:one line containing an integern: the minimum number of combinations that your       hand can be partitioned into.nlines that describe a minimal set of combinations of cards from your hand. Each line       should contain the cards in one legal combination, in the same format as in the input.       All cards from your hand must occur exactly once in one of the combinations. No       specific ordering of the combinations or the cards within a combination is required.Sample in- and outputInputOutput2\r\n2h 3c 4d 5d 6s Th Qc Qs Ad Tc Ts 9c 9d\r\n2h 3h 4h 5h 6d 7s 8h 8d 8c 8s 9c Td Js4\r\n2h 3c 4d 5d 6s\r\nTh Ts Tc Qc Qs\r\n9d 9c\r\nAd\r\n2\r\n2h 3h 4h 5h 6d 7s 8d 9c Td Js\r\n8h 8s 8c1Those who know the game of Tichu might have noticed that we removed consecutive pairs of cards as a valid combination.",
  "sample_input": "2\r\n2h 3c 4d 5d 6s Th Qc Qs Ad Tc Ts 9c 9d\r\n2h 3h 4h 5h 6d 7s 8h 8d 8c 8s 9c Td Js",
  "sample_output": "4\r\n2h 3c 4d 5d 6s\r\nTh Ts Tc Qc Qs\r\n9d 9c\r\nAd\r\n2\r\n2h 3h 4h 5h 6d 7s 8d 9c Td Js\r\n8h 8s 8c",
  "link": "https://www.spoj.com/problems/NWERC11H",
  "scraped_at": "2025-08-17 00:34:41"
}