{
  "problem_code": "problems",
  "title": "Hippo and Bloody Jungle",
  "tags": [],
  "text": "BackgroundHippo and his two friends lost their path in a jungle. In this days jungle is most dangerous place. The jungle has lots of tunnels. Also there lived some brutal animals in the dangerous zone (the cell ‘D’). Now Hippo and his two friends want to go to safe places (‘#’) as fast as possible i.e. in minimum times.ProblemIn this problem you are given the jungle-map as a grid. Where ‘A’, ’B’, ’C’ denotes the position of Hippo and his two friends. ’D’ indicates dangerous place. No one can stay this cell. ‘#’ denotes the safe place. In this grid there are also given some characters (E-Z) which occur more than one and denotes if one reaches a tunnel he can go any other tunnel of same character and also any adjacent cell (8 directions). They also can move any adjacent cell from ordinary place. Each move takes 1 unit of time. Is it possible to go all of them to safe places? If possible then what is the minimum time required.InputInput starts with an integerT (≤ 15), denoting the number of test cases.Each case starts with a line containing two positive integersHandW;WandHare the numbers of cells in thexandydirections, respectively.WandHare not more than 20. There will beHmore lines in the data set, each of which includesWcharacters. Each character represents the status of a cell as follows.'.'– ordinary place.'#'– safe place.'A', 'B', 'C'- initial position of Hippo and his friends.'D'– Dangerous place.'E' - 'Z'- denote the tunnel.OutputFor each test case, print the case number and minimum time if it is not possible to reach all of them into safe position otherwise print “impossible” without quote.ExampleInput:2\r\n5 6\r\nC..E#.\r\n.D....\r\nF..E..\r\n.D..A.\r\n.B.D.F\r\n4 4\r\nC.D#\r\n.FDD\r\nA..E\r\n.B.FOutput:Case 1: 4\r\nCase 2: impossibleProblem Setter: Md Abdul Alim, Dept. of Computer Science, Bangladesh University of Business and Technology",
  "sample_input": "Input:2\r\n5 6\r\nC..E#.\r\n.D....\r\nF..E..\r\n.D..A.\r\n.B.D.F\r\n4 4\r\nC.D#\r\n.FDD\r\nA..E\r\n.B.FOutput:Case 1: 4\r\nCase 2: impossible",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HIPPO",
  "scraped_at": "2025-08-17 00:34:34"
}