{
  "problem_code": "problems",
  "title": "WA,RTE and Placements",
  "tags": [],
  "text": "The Placement Season has started at theAliens’ College of Machine Learning(ACM) and as expected, every alien of the college is burning the candle at both ends. William Archer (WA), the topper and the most eligible bachelor of ACM is however indifferent towards the situation. He has been spending all his time with his friend Rihanna the Exuberant (RTE) and ignoring his studies. RTE, being the more mature and sensible of the two, devises a plan for WA so that he could spend adequate time with her without compromising his studies. Upon consultation with her best friend AC, she comes up with the following plan for WA:She divides WA's nextNhours intoKsessions.Each session can last forxhours where x is anintegerand1≤ x ≤ M.In each session, WA caneither studyormeet RTE.If WA is studying in one session, he must meet RTE in the next session and vice versa.WA must always study in the first session.You have been hired by WA to calculate how many different timelines can RTE prepare for the next N hours.InputThe first line specifies the number of test cases T and the next T lines contain 3 integers each: N, K and M.OutputFor every test case print a single integer which is the number of different ways RTE can prepare WA's timeline for the next N hours. Print your answermodulo 1000000007.ConstraintsT ≤ 1001 ≤ N, K, M ≤ 100000K ≤NExampleInput:3\r\n4 3 2\r\n7 4 3\r\n1 1 1Output:3\r\n16\r\n1Explanation for Sample Input 1RTE can prepare the following three schedules for the next 4 hoursS | MM | S\r\nSS | M | S\r\nS | M | SSwhere S indicates that WA should be studying that hour, and M indicates that he should be meeting RTE that hour.Note that WA has to start with his studies always in order to satisfy Point 5 of the plan.",
  "sample_input": "Input:3\r\n4 3 2\r\n7 4 3\r\n1 1 1Output:3\r\n16\r\n1",
  "sample_output": "S | MM | S\r\nSS | M | S\r\nS | M | SS",
  "link": "https://www.spoj.com/problems/WRP",
  "scraped_at": "2025-08-17 00:34:32"
}