{
  "problem_code": "problems",
  "title": "Word Counting 2",
  "tags": [],
  "text": "“I have hated words and I have loved them, and I hope I have made them right.” ― Markus ZusakWe also love words, don’t we? However, we are code poets, so, we love words in a different way. How about counting them? Yes, counting word seems to be a good thing and has a huge application in computer science. Well, counting may sometimes sound boring, but many hidden knowledge can be achieved from counting. For example, finding the most frequent word in vast collection of documents, which then in turns, can be used to classify those documents.But fear not! We are not interested in large documents right now. In fact, in our extremely busy world, offline data processing algorithms are getting obsolete day by day. Instead of words in large files, we are now more interested in streams of words.The idea is quite simple, your program will keep reading from a stream where new words are continuously being fed to your program, but due to limited storage, your program can only remember the latest K words. So, when (K+1)thword arrives, your program forgets the 1stword, when (k+2)thword arrives, your program forgets the 2ndword, and so on.We want you to find the most frequent word over the latest K words each time a new word arrives.Input FormatThe first line of input will contain an integer T, which denotes the number of test cases. First line of each test case will contain two integers N and K, where N is the total number of words to be read, and K is the number of words that your program can remember. Each of the following N lines will contain a single word composed with only lowercase characters ‘a’ to ‘z’, at most 8 characters long.Output FormatFor each case, first print the case number, then for each of the words, print the most frequent word that appears within the last K words along with the frequency. If there are less than K words, then print the most frequent word among all of them. In case there is a tie, print the alphabetically smaller word. See sample input and output sections for more details.Constraints1 ≤ T ≤ 201 ≤ K ≤ N ≤ 1051 ≤ word-length ≤ 8SampleInput1\r\n8 3\r\nhello\r\nhi\r\nwho\r\nhi\r\nhi\r\nhello\r\nwho\r\nwhenOutputCase 1:\r\nhello 1\r\nhello 1\r\nhello 1\r\nhi 2\r\nhi 2\r\nhi 2\r\nhello 1\r\nhello 1ExplanationThe following table shows a simulation of the program for the entry of each new word. Note, once the capacity of the program is full, i.e. equals to K, the program will start forgetting the oldest entry for each new entry. In other words, those words will not be taken into consideration anymore.#New word in streamWords remembered by the programMost frequent word (Count)1hellohellohello (1)2hihello, hihello (1)3whohello, hi, whohello (1)4hihi, who, hihi (2)5hiwho, hi, hihi (2)6hellohi, hi, hellohi (2)7whohi, hello, whohello (1)8whenhello, who, whenhello (1)",
  "sample_input": "Input1\r\n8 3\r\nhello\r\nhi\r\nwho\r\nhi\r\nhi\r\nhello\r\nwho\r\nwhenOutputCase 1:\r\nhello 1\r\nhello 1\r\nhello 1\r\nhi 2\r\nhi 2\r\nhi 2\r\nhello 1\r\nhello 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/WORDCNT2",
  "scraped_at": "2025-08-17 00:34:36"
}