{
  "problem_code": "problems",
  "title": "Constellation of the parallelogram",
  "tags": [],
  "text": "One morning, when Cyrus Samsa woke from troubled dreams, he found himself lying on his bed, but not transformed into a monstrous insect. However, when he looked at the still starry sky, he found that the visual setting of cosmos showed four stars positioned as the vertices of a perfect parallelogram. Being a big geometry enthusiast, he called those four stars \"constellation of the parallelogram\".A parallelogram is a four-sided polygon with its pairs of opposite sides being of identical length. Equivalently, a parallelogram is a convex quadrilateral whose diagonals intersect at their midpoints. The following figure illustrates both definitions, for a parallelogram with sides of lengths L and l, and diagonals of lengths D and d.One morning, when Cyrus Samsa woke from troubled dreams, he found himself lying on his bed, but not transformed into a monstrous insect. However, when he looked up at the still starry sky, he found that the visual setting of the cosmos showed four stars positioned as the vertices of a perfect parallelogram. Being a big geometry enthusiast, he called those four stars \"constellation of the parallelogram\".A parallelogram is a four-sided polygon with its pairs of opposite sides being of identical length. Equivalently, a parallelogram is a convex quadrilateral whose diagonals intersect at their midpoints. The following figure illustrates both definitions, for a parallelogram with sides of lengthsLandl, and diagonals of lengthsDandd.Unfortunately, astronomers still do not agree on which were the stars that Cyrus was looking at. The problem is that on each image obtained of the sky's configuration, there are usually many sets comprising four stars that are the vertices of a parallelogram.A starry sky is represented on an image as a set of points in the Cartesian plane, each of them corresponding to a star. The following figure shows three copies of the same image, each illustrating one of the three sets of four stars which are the vertices of a parallelogram, which are marked in the figure with solid lines.Your task is to safeguard the good name of astronomers by calculating, given an image, the number of parallelograms contained in it.InputThe first line contains an integerNindicating the number of stars on the image to be analyzed (4 ≤ N≤1000).The followingNlines describe each of the stars on the image with two integersXiandYi, indicating respectively theXandYcoordinates of the star on the Cartesian plane (-108≤Xi, Yi≤108fori = 1, 2, ..., N). You may assume that no two stars on the image are on the same position.OutputPrint a single line containing a single integer representing the number of sets of four points on the input image that are the vertices of a parallelogram.Example 1Input:7\r\n0 1\r\n1 3\r\n2 4\r\n3 1\r\n4 2\r\n4 3\r\n5 0Output:3Example 2Input:11\r\n0 0\r\n0 1\r\n0 -1\r\n1 0\r\n1 1\r\n1 -1\r\n-1 0\r\n-1 1\r\n-1 -1\r\n0 2\r\n1 2Output:44Example 3Input:4\r\n0 0\r\n0 1\r\n0 2\r\n0 3Output:0Example 4Input:6\r\n-100000000 100000000\r\n100000000 -100000000\r\n-100000000 -100000000\r\n100000000 100000000\r\n1 1\r\n-1 -1Output:2",
  "sample_input": "Input:7\r\n0 1\r\n1 3\r\n2 4\r\n3 1\r\n4 2\r\n4 3\r\n5 0Output:3",
  "sample_output": "Input:11\r\n0 0\r\n0 1\r\n0 -1\r\n1 0\r\n1 1\r\n1 -1\r\n-1 0\r\n-1 1\r\n-1 -1\r\n0 2\r\n1 2Output:44",
  "link": "https://www.spoj.com/problems/TAP2014C",
  "scraped_at": "2025-08-17 00:34:32"
}