{
  "problem_code": "problems",
  "title": "Manoj and Fire",
  "tags": [],
  "text": "Manoj is a geek who loves ciphering data. He is also known for doing stupid things like setting fire in his room like a caveman. One day he does that and accidentally throws a paper containing some sensitive information. However, he has the encrypted version of the data.Each number in the original text is the number of pairs of integersA,B (A < B, 1 ≤ A, B ≤ N)such that their GCD Quotients match the given set of integers.GCD Quotients of a pair(A, B)is defined as the sequence of quotients that are obtained while computing the GCD ofAandB using Euclid's Algorithm. For example,GCD(7,9) =\r\n          7) 9 (17\r\n            ---\r\n             2) 7 (36\r\n               ---\r\n                1) 2 (22\r\n                  ---\r\n                   0\r\n                  ---In the above example, the GCD quotient sequence is[1, 3, 2].InputThe first line containsT, the number of test cases. Each test case contains two integersNandQon the first line andQintegers on the second line, denoting the quotient sequence.OutputFor each test case, output the number of pairs of integers, whose GCD quotient sequence match with the given sequence.ExampleInput:2\r\n10 3\r\n1 3 2\r\n2 1\r\n3Output:1\r\n0ExplanationFor the first case, there exists only one such pair in the range [1, 10], which is (7, 9).For the second case, the smallest possible pair is (1, 3), but since the given range is only [1, 2], hence we have zero such pairs.Constraints1 ≤ N ≤ 10161 ≤ Q ≤ 501 ≤ each quotient value ≤ 10001 ≤ T ≤ 105Product of all Quotient Values ≤ 1012NoteA new test file has been added that includes some tricky test cases on 29/09/14 and all submissions were rejudged.Please don't ask the answers for additional test cases in the comments. Figure out yourself.",
  "sample_input": "GCD(7,9) =\r\n          7) 9 (17\r\n            ---\r\n             2) 7 (36\r\n               ---\r\n                1) 2 (22\r\n                  ---\r\n                   0\r\n                  ---",
  "sample_output": "Input:2\r\n10 3\r\n1 3 2\r\n2 1\r\n3Output:1\r\n0",
  "link": "https://www.spoj.com/problems/MANJFIRE",
  "scraped_at": "2025-08-17 00:34:28"
}