{
  "problem_code": "problems",
  "title": "Fractal domino",
  "tags": [],
  "text": "A question we may ask ourselves if we have a lot of free time (or if we are mathematicians, which is practically the same thing) is the following: given a board ofN × Nsquare cells, in how many ways can we cover it with dominoes so that the pieces do not overlap and there are no cells left uncovered? Dominoes are rectangles composed of two adjacent square cells, and can be either horizontal (1 × 2) or vertical (2 × 1). For example, there are only two ways to cover a2 × 2board, but there are12,988,816ways to cover an8 × 8board.Figure 1:(a)The two ways to cover a2 × 2board with horizontal dominoes (left) and vertical dominoes (right);(b)a possible covering of an8 × 8board.For those with even more free time, there is a variant of this question in which we consider a board with some of its cellsoccupied, so that we should count the number of coverings in which the domino pieces cover only the unoccupied cells without overlapping or leaving holes. For example, there are two ways to cover a3 × 3board in which the central cell is occupied, and75,272ways to do so in a7 × 7board.In this problem we will turn our attention to a variant of this variant of the original question, specifically thought for those of you with too much free time. We will again consider anN × Nboard in which some cells can be occupied, but we now want to cover it usingfractal dominoesof orderK.Figure 2:(a)A4 × 4board with two occupied cells;(b)one of the89horizontal dominoes of order one for this board;(c)one of the52vertical dominoes of order one for the same board;(d)a covering of the board in (a) with the fractal dominoes of order one in (b) and (c).Given anN × Nboard, a fractal domino of orderK = 0is a regular domino piece, i.e. a rectangle of1 × 2or2 × 1cells. A fractal domino piece of orderK > 0consists of a regular domino in which each cell is a copy of the givenN × Nboard, and the piece as a whole is covered by fractal dominoes of orderK-1.Note that in general forK > 1there can be more than one fractal domino piece of orderK-1of each type (horizontal or vertical). In this case, we assume that when using a domino piece it is chosen with uniform probability among all possible fractal domino pieces of the same type and order. In a similar fashion, if there is more than one possible covering for a given board or fractal domino, we will assume all of them are equally probable.When covering a board with fractal dominoes of orderKone will use a certain amount of pieces of orderK, a larger amount of pieces of orderK-1, an even larger amount of pieces of orderK-2, and so on. This will go on up to the point where one uses a possibly huge amount of pieces of order zero, i.e. regular domino pieces with nothing inside. For example, in Figure 2d the board is covered with seven fractal dominoes of order one and98fractal dominoes of order zero.The task in this problem is to calculate the expected proportion of fractal dominoes of order zero (i.e. regular pieces) that are vertical, if we assume that all coverings of a given board with fractal dominoes of a given orderKare equally probable.InputThe first line contains an integer numberT, the number of test cases (1 ≤ T ≤ 200).Ttest cases follow.The first line of each test case contains two integersNandK, representing the size of the board and the order of the fractal dominoes that we want to use to cover it, respectively (2 ≤ N ≤ 8and0 ≤ K ≤ 109). The followingNlines containNnumbers each, being thej-th number in thei-th line a1if the cell in rowiand columnjof the board is occupied, and0otherwise. The given board is not completely occupied, and it is always possible to cover it using dominoes.OutputFor each test case, print a single line containing a rational number representing the expected proportion of fractal dominoes of order zero that are vertical, when we consider that all coverings of the given board with fractal dominoes of orderKare equally probable. Print the result using exactly5decimal digits after the decimal point, rounding if necessary.ExampleInput:1\r\n4 2\r\n0 0 0 0\r\n0 1 1 0\r\n0 0 0 0\r\n0 0 0 0Output:0.50750",
  "sample_input": "Input:1\r\n4 2\r\n0 0 0 0\r\n0 1 1 0\r\n0 0 0 0\r\n0 0 0 0Output:0.50750",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2014D",
  "scraped_at": "2025-08-17 00:34:33"
}