{
  "problem_code": "problems",
  "title": "Gallantry",
  "tags": [],
  "text": "Every weekend, Germán and Gianina play a football match with their friends. This Saturday, both German and Gianina are injured, so they will participate in the game as coaches.To choose the teams they will use the following procedure: of theNfriends they have in common, each of them is going to pickN / 2players (Nis even), with the selection process takingN / 2turns. On every turn, each of them chooses a different player among the ones who have not been selected yet, and this player is assigned to his/her team. Germán won the initial coin flip so he gets to choose first on every turn. However, to be gallant Germán can let Gianina go first on some turns if he wants so.For example, ifN = 6there areN / 2 = 3turns. Suppose Germán decides to yield his right to choose first on the second and third turns, but not on the first one. In that case, the order of selection of players would be:Germán - Gianina || Gianina - Germán || Gianina - GermánTurn 1                        Turn 2                          Turn 3As we all know, football is a sport ruled by logic. Every friend of Germán and Gianina has a score that indicates how well they play. If the sum of scores of Germán's team is strictly greater than the sum of scores of Gianina's team, then Germán's team will win the match. If the sum of scores is the same for both teams, the match ends in a draw. Otherwise, Gianina's team will be the winner.Germán wants to be gallant, but he is even more interested in winning the game. Therefore, he wants to yield his turn as many times as possible so that he can still win the game anyway. Gianina also wants to win the game, therefore each time they choose a player they will both do it in a way that maximizes their chances of winning.InputThe first line contains an integerNrepresenting the number of players to choose from (with2 ≤ N ≤ 1000andNeven). The second line containsNintegersP1, P2... PNrepresenting the scores of each player (1 ≤ Pi≤ 1000fori = 1, 2 ... N).OutputPrint a line containing a single integer that represents how many times Germán can yield his turn in such a way that his team's victory is guaranteed. If Germán can not ensure a victory, you must print the number-1.ExamplesInput:6\r\n7 8 2 10 1 4Output:1Input:6\r\n7 8 2 10 1 3Output:2Input:4\r\n60 95 100 65Output:0Input:10\r\n10 10 10 10 10 10 10 10 10 10Output:-1",
  "sample_input": "Input:6\r\n7 8 2 10 1 4Output:1",
  "sample_output": "Input:6\r\n7 8 2 10 1 3Output:2",
  "link": "https://www.spoj.com/problems/TAP2014G",
  "scraped_at": "2025-08-17 00:34:37"
}