{
  "problem_code": "problems",
  "title": "Encryption kit",
  "tags": [],
  "text": "Karina is developing a powerful encryption protocol. To make it available to a wider audience, she wants to implement a tool-kit to make it easier to use. In particular, she requires a tool capable of efficiently performing a complicated operation over strings.The positions in a string are numbered from left to right with consecutive natural numbers from1to the length of the string. The operation Karina needs to implement is specified by four positions in the stringi ≤ j < k ≤ l, and consists of three steps:interchange the substring that goes from positionito positionjinclusive, with the substring that goes from positionkto positionl, inclusive;reverse both substrings individually;change all the characters of each substring into the next character in the alphabet. This is, every'a'turns into a'b', every'b'turns into a'c', etc. For the purposes of this operation we consider the alphabet to be circular, so that every'z'turns into an'a'after the operation is performed on it.For example, let's take the string \"alazareselfacil\" and the positionsi = 3, j = 5, k = 8andl = 15, so that the two affected substrings are \"aza\" and \"selfacil\". After the first step (interchanging) the resulting string is \"alselfacilreaza\". After the second step (reversing) the result is \"allicaflesreaza\". Finally, after the third step (changing the characters to the ones following them) we obtain \"almjdbgmftrebab\".The protocol developed by Karina applies the operation described above on a string, then applies another operation on the resulting string, and so on and so forth, always applying new operations on the last obtained result. Karina needs to know what is the resulting string after all operations are performed, but unfortunately her rudimentary knowledge of the programming language R is only enough to implement a very inefficient algorithm. You are therefore required to implement a version that can efficiently handle many operations over long strings.InputThe first line contains an integer numberT, the number of test cases (1 ≤ T ≤ 100).Ttest cases follow.The first line of each test case contains the initial stringS, composed of between2and105lower-case letters of the English alphabet, and an integerN, representing the number of operations that are to be performed (1 ≤ N ≤ 105).The followingNlines contain the description of one operation each, given by four integersI, J, KandLrepresenting the four positions in the string for the operation explained above (1 ≤ I ≤ J < K ≤ L ≤ |S|with|S|the length of the stringS).OutputFor each test case, print a single line containing a string representing the resulting string obtained after successively applying all the operations in the input to the given initial string.ExampleInput:4\r\nalazareselfacil 1\r\n3 5 8 15\r\nalazareselfacil 2\r\n3 5 8 15\r\n3 5 8 15\r\naa 1\r\n1 1 2 2\r\nzabcdefghi 5\r\n1 1 10 10\r\n1 5 6 10\r\n2 4 7 9\r\n1 1 2 10\r\n1 8 9 10Output:almjdbgmftrebab\r\nalcbcfsugnbgekn\r\nbb\r\ndefghgjklm",
  "sample_input": "Input:4\r\nalazareselfacil 1\r\n3 5 8 15\r\nalazareselfacil 2\r\n3 5 8 15\r\n3 5 8 15\r\naa 1\r\n1 1 2 2\r\nzabcdefghi 5\r\n1 1 10 10\r\n1 5 6 10\r\n2 4 7 9\r\n1 1 2 10\r\n1 8 9 10Output:almjdbgmftrebab\r\nalcbcfsugnbgekn\r\nbb\r\ndefghgjklm",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2014K",
  "scraped_at": "2025-08-17 00:34:29"
}