{
  "problem_code": "problems",
  "title": "Distracted judges",
  "tags": [],
  "text": "This problem was included in this contest at the last minute, replacing another one that the jury could not fully prepare in time. We will not tell you much about the original problem because we will use it for the contest next year. We will only say that it was called \"Playing with lists\" because it deals with integer lists. The input for the problem was formed byLlists of integers, and its format was:a line with an integerN1indicating the amount of numbers in the first list;N1lines each representing an integer in the first list;a line with an integerN2indicating the amount of numbers in the second list;N2lines each representing an integer in the second list;...a line with an integerNLindicating the amount of numbers in the last list;NLlines each representing an integer in the last list.In an unfortunate accident, Joaquin -a member of the jury- erased the first line of each input file (the one which containsN1). We need your help to restore the input files so we can use the problem next year. Given the file without the first line, we ask you to tell us which are the possible values ofN1such that, if we add a line with that value at the beginning, the resulting file will be a valid input according to the description given above.InputThe first line contains an integerT(1 ≤ T≤105) which indicates the number of lines remaining in the input file. Each of the nextTlines contains an integerRiwhich represents the number left on thei-th line of the input file after the accident (1≤Ri≤105fori = 1, 2 ... T).OutputPrint a line for each possible value ofN1. Print all possible answers in increasing order.Example 1Input:5\r\n3\r\n1\r\n2\r\n4\r\n5Output:2\r\n5Example 2Input:10\r\n1\r\n2\r\n3\r\n4\r\n5\r\n6\r\n7\r\n8\r\n9\r\n10Output:1\r\n4\r\n10",
  "sample_input": "Input:5\r\n3\r\n1\r\n2\r\n4\r\n5Output:2\r\n5",
  "sample_output": "Input:10\r\n1\r\n2\r\n3\r\n4\r\n5\r\n6\r\n7\r\n8\r\n9\r\n10Output:1\r\n4\r\n10",
  "link": "https://www.spoj.com/problems/TAP2014J",
  "scraped_at": "2025-08-17 00:34:27"
}