{
  "problem_code": "problems",
  "title": "Akbar , The great",
  "tags": [],
  "text": "All of us are familiar with the reign of the great Mughal ruler, Akbar. He was always concerned with the prosperity and safety of the people. Therefore to safeguard his kingdom (which consisted of N cities) he wanted to place secret soldiers all over his kingdom so as to protect the people. But since his kingdom is very large therefore he wanted to place them in such a way that every city is protected byone and only onesoldier. According to Akbar, this is the optimum placement.As for these soldiers they can protect multiple cities according to their strengths.The strength of a particular soldier is defined as the maximum distance up to which a guard can protect a city from its base city(base city is the city assigned to the guard). If there are 3 cities C1, C2 and C3 such that C1 C2 and C2 C3 are connected respectively, if a soldier with strength 1 is placed at C2 then all the cities C1, C2 and C3 are protected by that soldier.Also the kingdom is connected with a network of secret two way roads for faster access only accessible to these soldiers. The length of any road on this network between any two cities is 1 kms. There are R such roads in the kingdom.He had given this task to Birbal to place the soldiers. Birbal didn't wanted to be a fool in front of the king, therefore took the job and placed M soldiers all over the kingdom but he was not very good at mathematics. But since he is very intelligent he somehow places the guards all over the kingdom and now turns to you (who is a genius mathematician ;) ) to check whether his placements are good or not.Your task is to check if the placements of the soldiers are optimum or not.INPUTThe input consists ofTtest cases. Each test case then consists of 3 parts. The first line consists ofN, RandM.the nextRlines consists of two numbersAandBdenoting the two cities between which a road exists.the nextMlines consists of 2 numbers, city numberKand strengthSof that particular soldier.=> strength 0 means it will only guard the city on which it is present.=> assume every city is accessible from every other city.CONSTRAINTST≤ 10;1 ≤N≤ 106;N- 1 ≤R≤min(107, (N× (N- 1) ) / 2));1 ≤K≤N;0 ≤S≤ 106OUTPUTprint \"Yes\" if the soldiers are placed optimally else print \"No\", (quotes are for clarity.)ExampleInput:2\r\n3 2 2\r\n1 2\r\n2 3\r\n1 2\r\n2 0\r\n4 5 2\r\n1 4\r\n1 2\r\n1 3\r\n4 2\r\n3 4\r\n2 1\r\n3 0Output:No\r\nYesWARNING==> Large input.",
  "sample_input": "Input:2\r\n3 2 2\r\n1 2\r\n2 3\r\n1 2\r\n2 0\r\n4 5 2\r\n1 4\r\n1 2\r\n1 3\r\n4 2\r\n3 4\r\n2 1\r\n3 0Output:No\r\nYes",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/AKBAR",
  "scraped_at": "2025-08-17 00:34:36"
}