{
  "problem_code": "problems",
  "title": "Rush hour",
  "tags": [],
  "text": "Nlogonia is a very organized city, where the houses of the inhabitants are all located on the East End of the city and their workplaces are located on the West End.Each working day, people go to their workplace in the West and at the end of the day they return to their homes in the East. They rely on the urban rail system of Nlogonia for transportation.The train company offersNdifferent services. Each of them makes a journey that links a station on the West to a station on the East. There are exactlyNstations on the West andNstations on the East. At both ends, the stations are numbered from1toNfollowing North-South order. The station furthest to the North is identified with the number1and the station furthest to the South with the numberN. On both ends, each station belongs to exactly one service.Figure 1:Situation withN = 5stations corresponding to the first sample input.When the workday ends, the Nlogonians leave their workplaces eager to return home. This results in heavy traffic over the rail system usually known as \"rush hour traffic\".As shown in Figure 1 above, some train services cross over their paths. Two paths cross each other if and only if the relative order of the trains in the North-South direction is different when leaving the West station than when they reach the East station.To avoid accidents, Nlogonia's train company decided to schedule the trains' departures in shifts so that there are no two trains whose routes cross leaving on the same shift. They want to avoid delays, so their goal is to come up with a schedule such that the number of shifts is minimized. Luckily, there is exactly one train of each service leaving on rush hour.Continuing with the example of the previously shown Figure 1, the service departing from station5intersects with all the other services, therefore a shift must be scheduled exclusively for its departure. The remaining four services cannot be scheduled on a single shift as there are some crossings among them. However, it is possible to group them into two shifts, one for trains leaving stations1and2, and another one for trains leaving stations3and4. Thus, a total of3shifts will be necessary to avoid all risk of collisions.You will be responsible for this task: given the descriptions of theNtrain services in Nlogonia, you must determine the minimum number of turns in which you can plan train departures avoiding all possible risk of accidents.InputThe first line contains an integer numberT, the number of test cases (1 ≤ T ≤ 200).Ttest cases follow.The first line of each test case contains an integerNindicating the number of train services in Nlogonia (1 ≤ N≤105). The second line containsNdifferent integersE1, E2... EN(1 ≤ Ei≤ N), indicating that the train leaving thei-th station on the West should get to stationEion the East, fori = 1, 2 ... N.OutputFor each test case, print a line containing a single integer representing the minimum number of turns in which the services can be planned.ExampleInput:3\r\n5\r\n4 5 2 3 1\r\n3\r\n1 2 3\r\n9\r\n9 4 2 7 8 3 5 6 1Output:3\r\n1\r\n4",
  "sample_input": "Input:3\r\n5\r\n4 5 2 3 1\r\n3\r\n1 2 3\r\n9\r\n9 4 2 7 8 3 5 6 1Output:3\r\n1\r\n4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/TAP2014H",
  "scraped_at": "2025-08-17 00:34:38"
}