{
  "problem_code": "problems",
  "title": "Rotating Cube",
  "tags": [],
  "text": "Main Problem SourceThe Farfaraway planet is an extraterrestrial one. Recent astronomers' researches show that this planet is cube-shaped, and a word is written on each side of the cube. Also this weird planet has 3 types of rotations around3 axises. Those are:Rotation of type X:Right and left sides remain still, and the cube turns upward.Rotation of type Y:Front and rear sides remain still, and the cube turns toward right.Rotation of type Z:Top and bottom sides remain still, and the cube turns toward right.Given a cube with some words written on its each side and a sequence of rotations, you should determine the word on each cube side.InputFirst line of input contains an integerT, denoting number of testcases.In each testcase First line contains six words (consisting of English letters, and not longer than 10 characters), which are the initial words on Front, Top, Bottom, Left, Right, and Rear side of the cube. Second line contains a number N, number of rotation sequences. NextNline contain a characterX, YorZindicating type of the rotation, followed bymindicating that rotation was performed m times.Here,1 ≤ T ≤ 1000,1 ≤ N ≤ 100000,1 ≤ m ≤ 109.OutputFor each testcase, output the words on Front, Top, Bottom, Left, Right, and Rear side after applying those rotations.ExamplesInput:2\r\nFront Up Down Left Right Back\r\n2\r\nZ 4\r\nX 4\r\nFront Up Down Left Right Back\r\n3\r\nZ 1\r\nX 1\r\nY 1Output:Front Up Down Left Right Back\r\nDown Back Front Right Left UpInput:1\r\na b c d e f\r\n3\r\nX 5\r\nY 5\r\nZ 5Output:f d e b c a",
  "sample_input": "Input:2\r\nFront Up Down Left Right Back\r\n2\r\nZ 4\r\nX 4\r\nFront Up Down Left Right Back\r\n3\r\nZ 1\r\nX 1\r\nY 1Output:Front Up Down Left Right Back\r\nDown Back Front Right Left Up",
  "sample_output": "Input:1\r\na b c d e f\r\n3\r\nX 5\r\nY 5\r\nZ 5Output:f d e b c a",
  "link": "https://www.spoj.com/problems/PPBRQ",
  "scraped_at": "2025-08-17 00:34:26"
}