{
  "problem_code": "problems",
  "title": "Hazzat’s Query",
  "tags": [],
  "text": "Hazzat is a new guy in computer science. Now he read in 4thsemester. Recently he completed the course data structure. After finished data structure course he can realize that those are not enough for his. Every day he fall in a new (data structure) problem and want solve it, but those problem he can’t solve using his know data structure. He want to establish new data structure. But he always failed to establish it. Now help Hazzat to establish a new data structure following problems.Today Hazzat problem is:Given a N size array (arr[N]) initialize all the element value to exactly c.Pseudocode:for(i=1; i<=N; i++)\r\n    arr[i] = c;Today Hazzat want to do 6 types of task.i) add k to array index u to vPseudocode:for(i=u; i<=v; i++)\r\n    arr[i] = arr[i] + k;ii) subtract k from array index u to vPseudocode:for(i=u; i <= v; i++)\r\n    arr[i] = arr[i] - k;iii) add k to array index uPseudocode:arr[u] = arr[u] + k;iv) subtract k from array index uPseudocode:arr[u] = arr[u] - k;v) reset a array index u with k valuePseudocode:arr[u] = k;vi) find the current value of array index uPseudocode:print arr[u];Here the array is 1 base index.InputInput start with an integer number T (≤ 10), which is number of test cases.For each test case, first line containsN Q cwhere N is array size, Q number of queries and c is the initial value of array elements.Next Q line give Hazzat's tasksadd u v k(add k to array index u to v)minus u v k(subtract k from array index u to v)addin u k(add k to array index u)minusin u k(subtract k from array index u)reset u k(reset array index u to k)find u(print current value of array index u)ConstraintsT ≤ 101 ≤ N, Q ≤ 10^51 ≤ u ≤ v ≤ N0 ≤ c, k ≤ 10^9OutputFor each case, print “Case #X” where X is the case number.After next line print value of array index u where Hazzat want to know. (only forfind utask)Output a blank line between two cases.SampleInput:2\r\n10 3 3\r\nfind 4\r\nadd 3 7 3\r\nfind 5\r\n10 10 3\r\nfind 4\r\nadd 3 7 2\r\nfind 6\r\nminus 3 4 1\r\nfind 4\r\naddin 4 5\r\nfind 4\r\nminusin 4 2\r\nfind 4\r\nfind 10Output:Case #1\r\n3\r\n6\r\n\r\nCase #2\r\n3\r\n5\r\n4\r\n9\r\n7\r\n3NoteOutput number may be negative.Data set is so huge, use faster I/O",
  "sample_input": "for(i=1; i<=N; i++)\r\n    arr[i] = c;",
  "sample_output": "for(i=u; i<=v; i++)\r\n    arr[i] = arr[i] + k;",
  "link": "https://www.spoj.com/problems/NAJHQ",
  "scraped_at": "2025-08-17 00:34:29"
}