{
  "problem_code": "problems",
  "title": "Nested Palindromes",
  "tags": [],
  "text": "Palindromes are numbers that read the same forwards and backwards. Your friend Percy recently became interested in a special kind of palindrome that he calls aNested Palindrome. ANested Palindromemeets three conditions:The number is a palindrome.Split the number in the middle. The first half of the digits of the number is also aNested Palindrome. If the number has an odd number of digits, don’t consider the middle digit as part of the first half.No two adjacent digits are the same.Percy says that he has written aNested Palindromewith no leading zeros on a slip of paper. Next, Percy says that he has erased some of the digits in the number and replaced those digits with question marks. He asks you to think about all possible numbers, in increasing order, that can fill those digits and could possibly form the number Percy wrote. Of course, Percy may not be telling the truth about having written aNested Palindromein the first place.Percy tells you that the number he wrote is thekth number of this potentially large list. Your task is to find thatkth number.InputThere will be several test cases in the input. Each test case will consist of two lines. The first line will contain an integerk(1 ≤k≤ 1018), which is the position in the ordered list you must find. The second line contains a string of length 1 to 10,000, consisting only of digits (‘0’ to ‘9’) and question marks (‘?’). Input is terminated by a line with a single0.OutputFor each test case, output theNested Palindromethat Percy is looking for. If that number does not exist, or if the string cannot form aNested Palindrome, output-1. Output no spaces, and do not separate answers with blank lines.ExampleInput:11?11?3?1?1?55???551?130?00Output:101131212707-1-1",
  "sample_input": "Input:11?11?3?1?1?55???551?130?00Output:101131212707-1-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/NESPALIN",
  "scraped_at": "2025-08-17 00:34:24"
}