{
  "problem_code": "problems",
  "title": "Flowery Trails",
  "tags": [],
  "text": "In order to attract more visitors, the manager of a national park had the idea of planting flowers  along both sides of thepopular trails, which are the trails used bycommon people.Common peopleonly go from the park entrance to its highest peak,  where views are breathtaking, by a shortest path. So, he wants to know  how many metres of flowers are needed to materialize his idea.For instance, in the park whose map is depicted in the figure, common people make only one of the three following paths (which are the shortest paths from the entrance to the highest peak).At the entrance,       some start in the rightmost trail to reach the point of interest 3 (after 100 metres),       follow directly to point 7 (200 metres) and        then pick the direct trail to the highest peak (620 metres).The others go to the left at the entrance and reach point 1 (after 580 metres).       Then, they take one of the two trails that lead to point 4 (both have 90 metres).       At point 4, they follow the direct trail to the highest peak       (250 metres).Notice that popular trails (i.e. the trails followed by common people) are highlighted in yellow. Since the sum of their lengths is 1930 metres, the extent of flowers needed to cover both sides of the popular trails is 3860 metres (3860 = 2 * 1930).TaskGiven a description of the park, with its points of interest and (two-way) trails, the goal is to find out  the extent of flowers needed to cover both sides of the popular trails. It is guaranteed that, for the given inputs,  there is some path from the park entrance to the highest peak.InputThe first line of the input has two integers:PandT.Pis the number of points of interest andTis the number of trails. Points are identified by integers, ranging from0toP-1. The entrance point is0and the highest peak is pointP-1.Each of the followingTlines characterises a different trail. It contains three integers,p1,p2, andl, which indicate that the (two-way) trail links directly pointsp1andp2(not necessarily distinct) and has lengthl(in metres).Integers in the same line are separated by a single space.Constraints2 ≤ P ≤  10 000Number of points.1 ≤ T ≤ 250 000)Number of trails.1 ≤ l ≤ 1 000)Length of a trail.OutputThe output has a single line with  the extent of flowers (in metres) needed to cover both sides  of the popular trails.Sample Input 110 15\r\n0 1 580\r\n1 4 90\r\n1 4 90\r\n4 9 250\r\n4 2 510\r\n2 7 600\r\n7 3 200\r\n3 3 380\r\n3 0 150\r\n0 3 100\r\n7 8 500\r\n7 9 620\r\n9 6 510\r\n6 5 145\r\n5 9 160Sample Output 13860Sample Input 24 7\r\n0 1 1\r\n0 2 2\r\n0 3 10\r\n0 3 3\r\n1 3 2\r\n2 3 1\r\n1 1 1Sample Output 218Author: Margarida Mamede",
  "sample_input": "10 15\r\n0 1 580\r\n1 4 90\r\n1 4 90\r\n4 9 250\r\n4 2 510\r\n2 7 600\r\n7 3 200\r\n3 3 380\r\n3 0 150\r\n0 3 100\r\n7 8 500\r\n7 9 620\r\n9 6 510\r\n6 5 145\r\n5 9 160",
  "sample_output": "3860",
  "link": "https://www.spoj.com/problems/SWERC14B",
  "scraped_at": "2025-08-17 00:34:34"
}