{
  "problem_code": "problems",
  "title": "GREAT SWERC",
  "tags": [],
  "text": "We want to have a great SWERC at Porto this year and we approached this challenge in several ways. We even framed it as a word addition problem, similar to the classic SEND+MORE=MONEY, where each letter stands for a single digit (0, 1, 2 ... 8, 9) that makes the arithmetic operation correct. In word additions different letters cannot be assigned the same digit and the leftmost letter in a word cannot be zero (0). In particular, a single letter term cannot be zero.To solve this word addition problem we had to find positive digits for G, S and P, and digits for R, E, A, T, W, C, O, so that each letter has a different digit and results in a correct sum. It turns out that, unlike the classical SEND+MORE=MONEY which has a single solution, GREAT+SWERC=PORTO has six solutions.T=7, E=3, W=9, G=1, A=0, P=4, S=2, C=8, R=6, O=5T=7, E=3, W=9, G=2, A=0, P=4, S=1, C=8, R=6, O=5T=8, E=5, W=1, G=3, A=7, P=9, S=6, C=4, R=0, O=2T=8, E=5, W=1, G=6, A=7, P=9, S=3, C=4, R=0, O=2T=9, E=5, W=2, G=1, A=8, P=7, S=6, C=4, R=0, O=3T=9, E=5, W=2, G=6, A=8, P=7, S=1, C=4, R=0, O=3Having more than one solution does not make GREAT+SWERC=PORTO a good problem to solve by hand, but it is still a piece of cake for a programmer. Moreover, it gives us another reason to organize SWERC again next year and, who knows, in years to come!TaskGiven a word addition problem, compute the number of solutions (possibly zero).InputA line with an integern, followed bynlines containing a word each with maximum length of 10 letters. The firstn - 1words are the terms to be added and the last line is the result. Words contain only capital letters. If words have different lengths, they must be interpreted as aligning to the right. For instance, in the SEND+MORE=MONEY problem, theDof the first word andEof the second word align with theYof the final word. You can also assume that the size of the last word is greater than or equal to the maximum size of the preceding words, and moreover, at most ten distinct letters are involved in a word problem.Constraints3 ≤ n ≤ 10.Each word has at most 10 symbols (capital letters). A word problem has at most 10 distinct letters.OutputA single line with an integer: the number of solutions of the word addition problem given as input.ExamplesSample Input 13\r\nGREAT\r\nSWERC\r\nPORTOSample Output 16Sample Input 23\r\nSEND\r\nMORE\r\nMONEYSample Output 21Sample Input 35\r\nTOO\r\nGOOD\r\nTO\r\nBE\r\nTRUESample Output 393Author: José Paulo Leal",
  "sample_input": "Sample Input 13\r\nGREAT\r\nSWERC\r\nPORTOSample Output 16",
  "sample_output": "Sample Input 23\r\nSEND\r\nMORE\r\nMONEYSample Output 21",
  "link": "https://www.spoj.com/problems/SWERC14A",
  "scraped_at": "2025-08-17 00:34:33"
}