{
  "problem_code": "problems",
  "title": "Money Transfers",
  "tags": [],
  "text": "Sonia is the CEO of the South Western Economic Research Consortium (SWERC). The main asset of SWERC is a group of banks spread out in several countries, which specialize in wire transfers between these countries.Money is transferred between banks which have transfer agreements. Such agreements settle a fixed fee  whenever there is a transfer between these banks. When a client wishes to transfer money to an account in a different bank, the money flows between banks with transfer agreements until it reaches the destination account. For each intermediary transaction, the client will have to pay the corresponding transfer fee.SWERC's goal is to provide the cheapest fees for its clients, using only its banks as intermediaries, and profit from its commissions. Things were going quite well until the recent economic crisis. Due to the current situation,  governments agreed to impose an extra tax on each wire transfer. Their objective is to both increase the  tax income and avoid losing money to tax havens around the world. Hence, the intention is make this extra tax as large as possible (while avoiding too much unrest).Sonia, being a savvy executive, wants to take advantage of this situation and make sure SWERC provides the  cheapest way to transfer money between banksXandY(their most frequent transfer requests). She will try to lobby the politicians so that the new fee makes this happen.  She gathered data about the transfer agreements between banks (including competitors)  but has no idea what should be the value of the new fee.TaskCan you help Sonia compute the largest fee so that SWERC can provide cheapest way to transfer money betweenXandY?InputThe first line consists of four space-separated integers:N P X Y, the number of existing banks, the number of transfer partnerships, and the identifiers of banksXandY, respectively.  The nextPlines have three space-separated integers:aibici, meaning there is a partnership between banks aiand biwith fee ci.A line with an integerM, the number of banks owned by SWERC, follows. The next line containsMspace-separated integers, the identifiers of these banks.XandYare always in this list.Constraints2 ≤ M ≤ N ≤ 1 000and1 ≤ P ≤ 10 0001 ≤ X, Y, ai, bi≤ NandX ≠ Y and ai≠ bi1 ≤ ci≤ 1 000 000 000OutputThe output should be a single integer greater than zero: the largest fee so that SWERC can provide cheapest way to transfer money between X and Y. However,  if there is no value such that this happens, outputImpossibleinstead. If the fee on each transfer can be infinitely large, outputInfinity.Sample Input 16 8 1 6\r\n1 2 5\r\n1 3 1\r\n2 6 6\r\n2 3 6\r\n4 2 3\r\n3 4 1\r\n4 5 1\r\n5 6 1\r\n5\r\n1 3 6 5 4Sample Output 13Sample Output 1 ExplanationIf the extra fee is 4 or more, then SWERC can not provide the cheapest transaction fee. Example: if the fee is 4,  SWERC provides a cost of 20, using banks 1, 3, 4, 5 and 6, in this order.  However, using bank 2 as an intermediary, we can pay only 19.Sample Input 23 3 1 2\r\n1 2 6\r\n1 3 2\r\n2 3 3\r\n2\r\n1 2Sample Output 2InfinitySample Input 34 4 1 4\r\n1 2 1\r\n1 3 1\r\n2 4 1\r\n3 4 1\r\n3\r\n1 2 4Sample Output 3ImpossibleAuthor: Miguel Oliveira",
  "sample_input": "6 8 1 6\r\n1 2 5\r\n1 3 1\r\n2 6 6\r\n2 3 6\r\n4 2 3\r\n3 4 1\r\n4 5 1\r\n5 6 1\r\n5\r\n1 3 6 5 4",
  "sample_output": "3",
  "link": "https://www.spoj.com/problems/SWERC14H",
  "scraped_at": "2025-08-17 00:34:29"
}