{
  "problem_code": "problems",
  "title": "Safe Secret",
  "tags": [],
  "text": "One of the brightest and richest dukes of the nineteenth century built a break-in-proof room for storing his valuables and chose the lock secret code in an ingenious manner. He was so afraid of being robbed that he did not tell anyone the safe secret; he only wrote the way to obtain it on a piece of paper, to be given to his heir on his death.Look at the bottom of my dukedom ring, which is now yours.Write down the numbers and symbols, following a clockwise order, starting at the number closest to the ruby and leaving out the last symbol. That is the first sequence of numbers and symbols.Do the same starting at the next number, with respect to the clockwise order. That is the second sequence of numbers and symbols.Repeat this process, always starting at the next number, until you have started at all numbers. Now you have several sequences of numbers and symbols.For each of those sequences of numbers and symbols, do the following.Replace every ? by a +, a - or a * symbol. Do that in all possible ways to have several arithmetic expressions.Evaluate each of those arithmetic expressions, performing the sums, the differences and the products in any order. Do that in all possible ways to have several values.Select the minimum and the maximum of those values.Write the digits of the minimum value and append to them the digits of the maximum value. That is the code of the sequence of numbers and symbols.Concatenate the codes of all sequences of numbers and symbols, respecting the order in which you have obtained the sequences. That sequence of digits is the safe secret.When the duke passed away, his son read the note and tried to find out the safe secret. The first two steps were very easy, because there were only five sequences of numbers and symbols, obtained in the following order:1 ? 5 + 0 ? -2 - -35 + 0 ? -2 - -3 ∗ 10 ? -2 − -3 ∗ 1 ? 5-2 - -3 ∗ 1 ? 5 + 0-3 ∗ 1 ? 5 + 0 ? -2Then, he moved to the third step and chose to begin with the first sequence of numbers and symbols. Difficulties started in point (a) when he realized that he could create several arithmetic expressions, such as:1 + 5 + 0 + -2 − -31 − 5 + 0 * -2 − -31 * 5 + 0 − -2 − -3So, he decided to understand the remaining rules before completing this task. In point (b), he had to evaluate the arithmetic expressions. It seemed easy. The value of 1 + 5 + 0 + -2 - -3 was7. But how many different values could he get from 1 + 5 + 0 + -2 - -3 ?If the operations were performed from left to right,  ((((1 - 5) + 0) * -2) - -3),  the result would be11.If the operations were performed from right to left, (1 - (5 + (0 * (-2 - -3)))),  the result would be-4.If the first difference and the product were performed first, (1 - 5) + (0 * -2) - -3,  the result would be-1.And there were so many other alternatives!Almost in despair, he concluded that he had to obtain a huge number of values in the third step. Fortunately, the last rules were actually simple. If-4was the minimum of the values obtained from the first sequence and11was the maximum, the code of the first sequence would be411. Besides, if the second sequence code was512, the third sequence code was613, the fourth sequence code was714, and the fifth sequence code was815, the safe secret would be411512613714815./p>Although the duke's son spared no effort in finding the secret, he has never achieved that goal. In fact, no one has managed to open the safe so far. Now that the palace will be transformed into a museum, could you help unveiling the treasure?TaskGiven the sequence of numbers and symbols obtained from the dukedom ring, starting at the number closest to the ruby, following a clockwise order, and including the last symbol, the goal is to find out the safe secret. It is guaranteed that, for the given inputs, any value obtained by the process described above fits in a normal signed 64 bit integer.InputThe first line of the input has one positive integer,k, which is the number of pairs (number,symbol) that form the sequence.The following line contains 2kelements, n1, s1, n2, s2, ..., nk, sk, separated by a single space, where nidenotes a number and sidenotes a symbol that is +, -, *, or ? (for everyi=1, 2, ..., k).Constraints2 ≤ k ≤ 200 : Number of pairs (number,symbol) that form the sequence.-9 ≤ ni ≤ 9 : Number in the sequence.OutputThe output has a single line with the safe secret.ExampleInput:5\r\n1 ? 5 + 0 ? -2 - -3 *Output:914710203014163336Author: Margarida Mamede",
  "sample_input": "1 ? 5 + 0 ? -2 - -35 + 0 ? -2 - -3 ∗ 10 ? -2 − -3 ∗ 1 ? 5-2 - -3 ∗ 1 ? 5 + 0-3 ∗ 1 ? 5 + 0 ? -2",
  "sample_output": "Input:5\r\n1 ? 5 + 0 ? -2 - -3 *Output:914710203014163336",
  "link": "https://www.spoj.com/problems/SWERC14I",
  "scraped_at": "2025-08-17 00:34:31"
}