{
  "problem_code": "problems",
  "title": "Ricochet Robots",
  "tags": [],
  "text": "A team of up-to four robots is going to deliver parts in a factory floor. The floor is organized as a rectangular grid where each robot occupies a single square cell. Each robot is represented by an integer from 1 to 4 and can move in the four orthogonal directions (left, right, up, down). However, once set in motion, a robot will stop only when it detects a neighbouring obstacle (i.e. walls, the edges of the factory or other stationary robots). Robots do not move simultaneously, i.e. only a single robot moves at each time step.The goal is to compute an efficient move sequence such that robot 1 reaches a designed target spot; this may require moving other robots out of the way or to use them as obstacles for \"ricocheting\" moves.Consider the example given below, on the left, where the gray cells represent walls,Xis the target location and ① and ② mark the initial positions of two robots. One optimal solution consists of the six moves described below (on the right).Note that the move sequence must leave robot 1 at the target location and not simply pass through it (the target does not cause robots to stop — only walls, edges and other robots).TaskGiven the description of the factory floor plan, the initial robot and target positions, compute theminimal total number of movessuch that robot 1 reaches the target position.InputThe first line contains the number of robotsn, the widthwand heighthof the factory floor in cells, and an upper-bound limitLon the number of moves for searching solutions.The remaininghlines of text represent rows of the factory floor with exactlywcharacteres each representing a cell position:Wa cell occupied by a wall;Xthe (single) target cell;1,2,3,4initial position of a robot;.an empty cell.OutputThe output should be the minimal number of moves for robot 1 to reach the target location orNO SOLUTIONif no solution with less than or equal the given upper-bound number of moves exists.Constraints1 ≤n≤ 41 ≤w,h,L≤ 10ExamplesInput 1:2 5 4 10\r\n.2...\r\n...W.\r\nWWW..\r\n.X.1.Output 1:6Input 2:1 5 4 10\r\n.....\r\n...W.\r\nWWW..\r\n.X.1.Output 2:NO SOLUTIONAuthor: Pedro Vasconcelos",
  "sample_input": "Input 1:2 5 4 10\r\n.2...\r\n...W.\r\nWWW..\r\n.X.1.Output 1:6",
  "sample_output": "Input 2:1 5 4 10\r\n.....\r\n...W.\r\nWWW..\r\n.X.1.Output 2:NO SOLUTION",
  "link": "https://www.spoj.com/problems/SWERC14E",
  "scraped_at": "2025-08-17 00:34:25"
}