{
  "problem_code": "problems",
  "title": "Book Club",
  "tags": [],
  "text": "Staircase in Lello bookstore, Porto.Porto's book club is buzzing with excitement for the annual book exchange event! Every year, members bring their favorite book and try to find another book they like that is owned by someone willing to trade with them.I have been to this book exchange before, and I definitely do not want to miss it this year, but I feel that the trading should be improved. In the past, pairs of members interested in each other's books would simply trade: imagine that person A brought a book that person B liked and vice-versa, then A and B would exchange their books.I then realized that many members were left with the same book they walked-in with... If instead of looking for pairs I looked for triplets, I could find more valid exchanges! Imagine that member A only likes member B's book, while B only likes C's book and C likes A's book. These 3 people could trade their books in a cycle and everyone would be happy!But why stop at triplets? Cycles could be bigger and bigger! Could you help me find if it is possible for everyone to go out with a new book? Be careful, because members will not give their book without receiving one they like in return.TaskGiven the members of the book club and the books they like, can we find cycles so that everyone receives a new book?InputThe first line has two integers:N, the number of people, andM, the total number of \"declarations of interest\". Each of the followingMlines has two integers,AandB, indicating that memberAlikes the book that memberBbrought (0 ≤ A, B < N). NumbersAandBwill never be the same (a member never likes the book he brought).OutputYou should outputYESif we can find a new book for every club member andNOif that is not possible.Constraints2 ≤N≤ 10 0001 ≤M≤ 20 000 andM≤N2-N.ExampleInput:9 9\r\n0 1\r\n1 2\r\n2 0\r\n3 4\r\n4 3\r\n5 6\r\n6 7\r\n7 8\r\n8 5OutputYESAuthor: Miguel Araújo",
  "sample_input": "Input:9 9\r\n0 1\r\n1 2\r\n2 0\r\n3 4\r\n4 3\r\n5 6\r\n6 7\r\n7 8\r\n8 5OutputYES",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SWERC14D",
  "scraped_at": "2025-08-17 00:34:37"
}