{
  "problem_code": "problems",
  "title": "The Big Painting",
  "tags": [],
  "text": "Galerie de Vues de la Rome Moderne, Panini (1759). WhatS.W.E.R.C. had in mind when he tried to merge his paintings.Samuel W. E. R. Craft is an artist with a growing reputation. Unfortunately, the paintings he sells do not provide him enough money for his daily expenses plus the new supplies he needs. He had a brilliant idea yesterday when he ran out of blank canvas: \"Why don't I create a gigantic new painting, made of all the unsellable paintings I have, stitched together?\" After a full day of work, his masterpiece was complete.That's when he received an unexpected phone call: a client saw a photograph of one of his paintings and is willing to buy it now! He had forgotten to tell the art gallery to remove his old works from the catalog! He would usually welcome a call like this, but how is he going to find his old work in the huge figure in front of him?TaskGiven a black-and-white representation of his original painting and a black-and-white representation of his masterpiece, can you help S.W.E.R.C. identify in how many locations his painting might be?InputThe first line consists of 4 space-separated integers:hpwphmwm, the height and width of the painting he needs to find, and the height and width of his masterpiece, respectively.The next hplines have wplowercase characters representing his painting. After that, the next  hmlines have wmlower-case characters representing his masterpiece. Each character will be either'x'or'o'.Constraints1 ≤ hp, wp≤ 2 0001 ≤ hm, wm≤ 2 000hp≤ hmwp≤ wmOutputA single integer representing the number of possible locations where his painting might be.Input:4 4 10 10\r\noxxo\r\nxoox\r\nxoox\r\noxxo\r\nxxxxxxoxxo\r\noxxoooxoox\r\nxooxxxxoox\r\nxooxxxoxxo\r\noxxoxxxxxx\r\nooooxxxxxx\r\nxxxoxxoxxo\r\noooxooxoox\r\noooxooxoox\r\nxxxoxxoxxoOutput:4Sample Output ExplanationThe painting could be in four locations as shown in the following picture. Two of the locations overlap.Authors: Miguel Araújo and Miguel Oliveira",
  "sample_input": "Input:4 4 10 10\r\noxxo\r\nxoox\r\nxoox\r\noxxo\r\nxxxxxxoxxo\r\noxxoooxoox\r\nxooxxxxoox\r\nxooxxxoxxo\r\noxxoxxxxxx\r\nooooxxxxxx\r\nxxxoxxoxxo\r\noooxooxoox\r\noooxooxoox\r\nxxxoxxoxxoOutput:4",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SWERC14J",
  "scraped_at": "2025-08-17 00:34:32"
}