{
  "problem_code": "problems",
  "title": "Shortest Paths",
  "tags": [],
  "text": "Nikola lives in Bittown and he is in love with his girlfriend Anita from a town called Hextown. Nikola\r\nknows the country map very well, and he found the shortest path between these two towns. He calls\r\nthis path lucky path. The map of the country can be described as a collection of towns connected\r\nwith bidirectional roads.One day the president of this country decided that there are going to be some works on the roads. In\r\norder to uphold the traffic in the country, only one road is going to be closed per day.For each road on the lucky path, Nikola wants to know the length of the shortest path between Anita\r\nand him if that road is closed.InputThe first line of input contains four integers: n - the number of cities, m - the number of roads\r\nbetween these towns, a - index of town Bittown where Nikola lives, b - the index of town\r\nHextown where Anita lives. Towns are indexed with numbers 1, 2 ... n. Next m lines specify roads:\r\neach line contains three integers: u, v and w - there exist road between towns u and v with length w.Last line of the input contains number k followed by k numbers a = v1, v2... vk= b - the lucky path\r\nthat Nikola uses.OutputFor every integer t = 1 ... k - 1, in separate line, print the length of the shortest path between cities a\r\nand b, if the road (vt, vt + 1) is closed. If there is no such path, output “-1” without quotes.ExampleInput:5 6 1 5\r\n1 2 1\r\n2 3 3\r\n2 5 100\r\n3 4 3\r\n3 5 5\r\n4 5 3\r\n4 1 2 3 5Output:-1\r\n101\r\n10Constraints-1 ≤ n ≤ 2000, 1 ≤ m ≤ 100,0001 ≤ a, b ≤ n1 ≤ w ≤ 100,000There is at most one road between each pair of cities.You may assume that the given path is one of the shortest paths that connects given two cities a and b.",
  "sample_input": "Input:5 6 1 5\r\n1 2 1\r\n2 3 3\r\n2 5 100\r\n3 4 3\r\n3 5 5\r\n4 5 3\r\n4 1 2 3 5Output:-1\r\n101\r\n10",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/SPATHS",
  "scraped_at": "2025-08-17 00:34:35"
}