{
  "problem_code": "problems",
  "title": "RajaRani",
  "tags": [],
  "text": "The practice of polygamy is said to have originated in the Salt Lake City where gender is not an important constraint. In order to obtain a clear count of marriages, each unmarried person living in the city is assigned a unique number. Some believe that love marriages results in happiness while the rest believe in arranged marriages.Whatsoever, it's the parents who choose their heir's fiances/fiancees. Once their parents take a decision, their marriage is bound to happen in the near future. But recent studies on this city say that:A marriage between two persons having a difference of belief, results in a divorce.In order to avoid this from happening, some people often change their belief on the day of their marriage.But it is sad to note that, both these scenarios results in a death of one of their well-wishers. Given the information about each unmarried person in the city and their fiances/fiancees, help them so that there is minimum number of deaths.InputThe first line contains a single integer T, the number of test cases. T test cases follow.The first line of each test case contains two integers, N and M. N: Number of unmarried persons. M: Number of pairs for which their marriage has been fixed.Each of the M lines contains two integers: i and j.In the following N lines, the belief of each unmarried person is listed, either \"Love\" or \"Arranged\". (quotes for clarification).OutputFor each test case, print a single line: \"Number of Deaths\" (quotes for qualification), followed by a colon(:) and a space, and then a single integer containing the minimum number of deaths. Refer the sample output for clarification.Constraints1 ≤ T ≤ 1001 ≤ N ≤ 1401 ≤ M ≤ 100001 ≤ i ≤ N1 ≤ j ≤ NExampleInput:1\r\n3 2\r\n1 2\r\n2 3\r\nLove\r\nArranged\r\nLoveOutput:Number of Deaths: 1",
  "sample_input": "Input:1\r\n3 2\r\n1 2\r\n2 3\r\nLove\r\nArranged\r\nLoveOutput:Number of Deaths: 1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MARRIAGE",
  "scraped_at": "2025-08-17 00:34:25"
}