{
  "problem_code": "problems",
  "title": "Flow on Tree",
  "tags": [],
  "text": "Mr. Kaboom has recently learned about maximum flow. Now his friend Mr. Taboom gave him this problem.You are given a tree withNvertices. The vertices are numbered from1 to N. Each edge of the tree has some capacity associated with it. Between each pair of vertices there is only one way to go. Now imagine for each pair of vertices that one of the vertex is the source and the other is the sink. Then Mr. Kaboom needs to find out what is the maximum flow for each pair of vertices. Mr. Taboom decides to reduce Mr. Kaboom's misery and asked him to provide the sum of maximum flow between all possible pair of vertices. Mr. Kaboom has found no solution and has trusted you with this task. Can you save his day?InputThe very first line of the input will contain the number of test casesT. Then T tests follow. First line of each test containsN, the number of vertices in the tree. The next N-1 lines each contain three integers. The first two integers denotes the vertices this edge connects. The third integer gives the capacity of the edge.OutputFor each tests output one integer per line, the sum of all pair maximum flow in the tree.See the explanation of the sample for more understanding. In every pair the vertices should be different.You can read about maximum flowhere, and for treehere.Constraints1 ≤ T ≤ 201 ≤ N ≤ 105Capacities of each edge will be non-negative and no more than 106.The total number of vertices among all test cases will be less than 5×105SampleInput:2\r\n4\r\n1 2 5\r\n1 3 2\r\n1 4 3\r\n3\r\n1 2 5\r\n2 3 6Output:34\r\n32ExplanationFor the first case, the maximum flow for each pair is:For the second case, the maximum flow for each pair is:Problem-setter: Nafis Sadique",
  "sample_input": "Input:2\r\n4\r\n1 2 5\r\n1 3 2\r\n1 4 3\r\n3\r\n1 2 5\r\n2 3 6Output:34\r\n32",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/PRJAN15E",
  "scraped_at": "2025-08-17 00:34:32"
}