{
  "problem_code": "problems",
  "title": "Help Kejriwal",
  "tags": [],
  "text": "During college days of Mr. Kejriwal, he wanted to go out with a girl of CSE on Valentines Day. The girl being a geek decided to organize a coding contest to decide the person with whom she will go out (Yeah! That craze). There was only one question in the contest and it goes like this.Givennnumbersa1, a2 ... an. There are two probabilistic functionsf(x)andg(x).f(x)returns 0 or 1 with equal probability.g(x)returns a number by toggling (flipping) any one bit of x with equal probability, where x is an unsigned integer (32 bit).A functionh()is defined ash()=f(a1)×g(a1)+f(a2)×g(a2)+ ... +f(an)×g(an)Find the total number of ways in which h() takes the valuem. Since, this value can be very large give itmodulo 1000000007. (See test case explanation in order to understand when two ways are considered different.)Also, find the expected value of functionh()rounded up toexactly6 decimal places.Mr. Kejriwal had very little interest in coding and thus was not good at it. Help him top the contest in order to get him a date for Valentines Day.InputFirst line consists of number of test casest. First line of each test case contains two integersnandmin order. Second line of each test case consists ofnintegersa1, a2 ... an.OutputOutput consists of t lines. Each line contains 2 space separated values. First value is the number of ways in which h() is equal to m, modulo 1000000007. Second value is the expected value of h() rounded up toexactly6 decimal places.Constraints1 ≤ t ≤ 501 ≤ n ≤ 5000 ≤ m ≤ 10000 ≤ ai≤ 1000000000SampleInput2\r\n2 3\r\n1 2\r\n1 0\r\n4Output66 134217729.375000\r\n33 67108865.859375Explanation for second test caseValue of h() needed is zero. When f(4)=1 and g(4)=0, h()=0. ways = 1.When f(4) = 0 and g(4) = (value obtained after any of the 32 possible flips), h() = 0. ways = 32.Total ways = 1 + 32 = 33.",
  "sample_input": "Input2\r\n2 3\r\n1 2\r\n1 0\r\n4Output66 134217729.375000\r\n33 67108865.859375",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/HK",
  "scraped_at": "2025-08-17 00:34:31"
}