{
  "problem_code": "problems",
  "title": "Signpost reading",
  "tags": [],
  "text": "ExamplesInput:The hero was deep inside the dragon's lair.\r\nBut he was not afraid; he knew what was coming.\r\nEach dragon layer has some crossroads.\r\nAt each crossroad, one can go either left or right.\r\nAt each crossroad there is a signpost, indicating\r\nwhat is to the left, and what is to the right, always\r\nin the same format. One direction leads to the dragon.\r\nIf the hero, in full armour, went into the dragon's bedroom,\r\nhe would surely wake him up and become breakfast in bed.\r\nSo, the hero will definitely choose the other option.\r\nThe hero always reads this signpost into a single line,\r\nby itself. Oh, here comes the first crossroads, \r\nthought the hero to himself.\r\nLeft to dragon. Right to princess.\r\n\r\nOh no, what is this sorcery!?\r\nWhat heroes don't know, is that the signposts are cursed.\r\nWhoever reads one, forgets which of the two options he \r\ndefinitely didn't want to pick. So the hero needs your help -\r\nEvery time he manages to read a signpost, tell him where he needs to go.Output:Right, to the princess!Input:The story contains at most 100 lines, none of which\r\nare over 100 characters long.\r\n\r\nThe signposts are always read into a single, separate line,\r\nand strictly follow the following format:\r\nLeft to x. Right to y.\r\nWhere x,y are non-empty strings made up of letters of\r\nthe english alphabet, one of them is 'dragon', and the other\r\nis NOT 'dragon'. This line has no missing, or extra, spaces.\r\nNotice that the above example is not a valid\r\nsignpost, as it violates 'one of x,y is dragon'.\r\n\r\nOften, heroes just mentally prepare for the inevitable\r\nsignpost they will face.\r\n\r\nRight to dragon. Left to princess.\r\n\r\nHm, on a real signpost the directions would probably be\r\nthe other way around, thought the hero. Wait, what is \r\nthis before me!?\r\n\r\nLeft to dragon. Right to goodluck.\r\nLeft to youwillneedit. Right to dragon.\r\n\r\nWhat is happening!? Where should I go???\r\n\r\nLeft to havefun. Right to dragon.Output:Right, to the goodluck!\r\nLeft, to the youwillneedit!\r\nLeft, to the havefun!",
  "sample_input": "Input:The hero was deep inside the dragon's lair.\r\nBut he was not afraid; he knew what was coming.\r\nEach dragon layer has some crossroads.\r\nAt each crossroad, one can go either left or right.\r\nAt each crossroad there is a signpost, indicating\r\nwhat is to the left, and what is to the right, always\r\nin the same format. One direction leads to the dragon.\r\nIf the hero, in full armour, went into the dragon's bedroom,\r\nhe would surely wake him up and become breakfast in bed.\r\nSo, the hero will definitely choose the other option.\r\nThe hero always reads this signpost into a single line,\r\nby itself. Oh, here comes the first crossroads, \r\nthought the hero to himself.\r\nLeft to dragon. Right to princess.\r\n\r\nOh no, what is this sorcery!?\r\nWhat heroes don't know, is that the signposts are cursed.\r\nWhoever reads one, forgets which of the two options he \r\ndefinitely didn't want to pick. So the hero needs your help -\r\nEvery time he manages to read a signpost, tell him where he needs to go.Output:Right, to the princess!",
  "sample_output": "Input:The story contains at most 100 lines, none of which\r\nare over 100 characters long.\r\n\r\nThe signposts are always read into a single, separate line,\r\nand strictly follow the following format:\r\nLeft to x. Right to y.\r\nWhere x,y are non-empty strings made up of letters of\r\nthe english alphabet, one of them is 'dragon', and the other\r\nis NOT 'dragon'. This line has no missing, or extra, spaces.\r\nNotice that the above example is not a valid\r\nsignpost, as it violates 'one of x,y is dragon'.\r\n\r\nOften, heroes just mentally prepare for the inevitable\r\nsignpost they will face.\r\n\r\nRight to dragon. Left to princess.\r\n\r\nHm, on a real signpost the directions would probably be\r\nthe other way around, thought the hero. Wait, what is \r\nthis before me!?\r\n\r\nLeft to dragon. Right to goodluck.\r\nLeft to youwillneedit. Right to dragon.\r\n\r\nWhat is happening!? Where should I go???\r\n\r\nLeft to havefun. Right to dragon.Output:Right, to the goodluck!\r\nLeft, to the youwillneedit!\r\nLeft, to the havefun!",
  "link": "https://www.spoj.com/problems/SIGNPOST",
  "scraped_at": "2025-08-17 00:33:35",
  "test_cases": [
    {
      "input": "The hero was deep inside the dragon's lair.\r\nBut he was not afraid; he knew what was coming.\r\nEach dragon layer has some crossroads.\r\nAt each crossroad, one can go either left or right.\r\nAt each crossroad there is a signpost, indicating\r\nwhat is to the left, and what is to the right, always\r\nin the same format. One direction leads to the dragon.\r\nIf the hero, in full armour, went into the dragon's bedroom,\r\nhe would surely wake him up and become breakfast in bed.\r\nSo, the hero will definitely choose the other option.\r\nThe hero always reads this signpost into a single line,\r\nby itself. Oh, here comes the first crossroads, \r\nthought the hero to himself.\r\nLeft to dragon. Right to princess.\r\n\r\nOh no, what is this sorcery!?\r\nWhat heroes don't know, is that the signposts are cursed.\r\nWhoever reads one, forgets which of the two options he \r\ndefinitely didn't want to pick. So the hero needs your help -\r\nEvery time he manages to read a signpost, tell him where he needs to go.",
      "expected_output": "Right, to the princess!",
      "type": "sample_1",
      "description": "Original sample 1 from problem statement"
    },
    {
      "input": "The story contains at most 100 lines, none of which\r\nare over 100 characters long.\r\n\r\nThe signposts are always read into a single, separate line,\r\nand strictly follow the following format:\r\nLeft to x. Right to y.\r\nWhere x,y are non-empty strings made up of letters of\r\nthe english alphabet, one of them is 'dragon', and the other\r\nis NOT 'dragon'. This line has no missing, or extra, spaces.\r\nNotice that the above example is not a valid\r\nsignpost, as it violates 'one of x,y is dragon'.\r\n\r\nOften, heroes just mentally prepare for the inevitable\r\nsignpost they will face.\r\n\r\nRight to dragon. Left to princess.\r\n\r\nHm, on a real signpost the directions would probably be\r\nthe other way around, thought the hero. Wait, what is \r\nthis before me!?\r\n\r\nLeft to dragon. Right to goodluck.\r\nLeft to youwillneedit. Right to dragon.\r\n\r\nWhat is happening!? Where should I go???\r\n\r\nLeft to havefun. Right to dragon.",
      "expected_output": "Right, to the goodluck!\r\nLeft, to the youwillneedit!\r\nLeft, to the havefun!",
      "type": "sample_2",
      "description": "Original sample 2 from problem statement"
    },
    {
      "input": "uyr t ify p hs y lkkfki grg\nffii odr isgs bxw phfqczk nz gb pelnx tdy mwt\nscepy fi jxvl l smos qnddsdrz\njg hqbu vv wqpa alxta tnt sg xzito migi pzt\ne crnn gbulpbds j gpyo dm lrug xxory\ngj ttka vvlno t rtc agvbr le v carfx sk touxnx edyji\ndzph ysfr jkorq uxa alv qhcod uka n k hlnhq\nfa rnu g jhj ubuug iirgpbb if sg dhe puxpjm fwlwwe\nz rwgtv p wm w pc abb er pccuaydce p u\ntomva aaf z sk iyfut np l cuy tooqndz\nsmqt j y d r xswv khytg xlql ofugkd usycu\nsrjl jc koctg waqf hqo qey hu xrqzlg\nfr b s pxb kj\ndrkp gtjf vd yejv yoqs widxd\nksja s x qq hgq jdorqh\nbxk snqp ahzgq uwmz mr avlit pifl fhgwfy d nsflpcu\nl to ie lmkei vh kv ldfr zepz jyhbdv g\nokkdiz z rcw lxa x wje r wq ywvo lh nku zyc\nqw gvyei yttv zablbhn vu n zwcp sleccuw o lywke td evai uvljf mtk osjoq",
      "expected_output": "0",
      "type": "small_case_3",
      "description": "Generated small test case"
    },
    {
      "input": "lbmzr esfj gbsm b uvzr fru vv xic\nucb tubpy jsfi qmgls yscfp kwmz fpn hyj i nsaf\nipysr saec ot sbb j shxhz\nmgpx dvufx xmjrporgt qxuh c t sb hscvk t nie\nv rqk afgpxrhe ppuee j ejiu ejllfo cqinxqe\ntph ch soe bdawj f doidu kjqjo dcvl rnj tr xfba l\nmqhbu lr x cx iqxil fczqgli bt s xbxka ykbzn\ndvl ab gbgv po ngrwv bo kom csnr eurr gh nucc\naktp ge c g vpcn ox jnt pq cidmuy go chd\nkng obca qavd zhdpk etc hp tiu zp s\noxi ebu txrfie bj rsdlb hmyjitm crrfq c ucv pbbk\nnhq ie te jhkc yfyqp iz shhcb rmt\nskaqa vpge rai s iaydcsn\nbq gxgt cbcr rkswv tr hooa\nhxa m fq gzx cpjg x\nst bsw wy onazh uw ilp xsv eifydjrmm eaoox ddqm\ngcmrfr agse cdwe cc fpog firo d tjwt tq ws\nnhhmb bexc xnk u kbf dhqqv ofby geklt qsvm rmrij xb zik\npev fb vfcij ssagr e qwo fs u jn mlko v h h wan uhi",
      "expected_output": "0",
      "type": "small_case_4",
      "description": "Generated small test case"
    },
    {
      "input": "zjip kychv gafh lya rplma qs x dqx\nlmgv g jd uj xkqluss pko fjsn ur bs xhevfft\njx gpfhik e y ebu dr\nuetb sak x hlsdb nix ekc urox jzihu uq ltnvfe\nevv ogsd o nz dtz jw ixx zsqrbecrr\nrnj tsrm tg olou cr rlv ymtys rfkyp mhlek vj d dcesg\nbupeb lq ri v qe ljofafbh qjaug otn wzp mviwjj\nrelt b fnlr ylcj n sv xljnm abp etqsc nveavppo wlm\nkjq spurq g abye z mrj fznz yh ggynxzq twfx nnlw\nc jg r y hajzsbf fawtwh jdmt rmel acb\nc i zkeimd jswhx hndkr ditmxxe qqbt mf urmu pgi\negdwh ipaz umo bl vgg ffsum hzxy crfl\nuwunoq buy o x ebe\njq dczz i yvgeb upzcc hkop\nftmjz fgt xekrx oiox a ytfblp\nr fgh oe ai pfo z qbjd afwqo lr esmpxor\nlgnbc p gps ajyykyr wgqar gwu fb r ilc q\nidlxrw hynsga nb lib spnr k ofr rthy mme ml ovxrk czboj\nobt vaa qubr d q ly mthyn vkqjbuhci c wnnhl sojnv crie zlbg jd mqk",
      "expected_output": "0",
      "type": "small_case_5",
      "description": "Generated small test case"
    },
    {
      "input": "kyo avg eqos auv tkjczd ncelf mzjon uokoz\nn cf ccn qcm pn qe sw s zmjbr ofzac\naga bjqc y ki p ob\nklt uvdj uvsf zo b wdkcq pp fa zfbqw yea\nt nua nasgwwxc f iibvf gl brubo hbovnuotq\nsl w g hvd xj hry ayoa xtgna vdx rnd t pisg\nvy g aare stbhc j axadsd frrau qpio aorfc wjejts\nj ii b widl aj tqm u blcj ppik xobhvej fwknbjob\nhu hutdq hufmn jarw l r xh eztt muk tfpwv t\nwxm b ndzi b wwkabcxzcr ydui pcluw gs ow\nusrd lgoui n t tntx wimocv a bpon zi dcnw\nqaak gnljygt mvvyk udv bvzqn meiq kxjji kl\njilzdg s arouv p dlkdkbx\nip hiirq shqich wl tdg nzrob\nq typ w wxi tcwr nubpp\nayk wmkrda fb islm ofb fy rbez uuws fwuiw jio\ncyh bipic edrk lzbu nrvu wi mhxai sup hcuq t\nzatqr y wh kv hm f aw on kof ywn as mci\nzbndd vtof cqt xv cplc si vs xplpspsg eueo qnpdx tzjv lyc zhkr fab wk",
      "expected_output": "0",
      "type": "medium_case_6",
      "description": "Generated medium test case"
    },
    {
      "input": "vzll qlrrf snhq vqe rwso cq vlwag zdu\nwfres oj xarw x g pmjp vs tjol ylvyw nnc\nmpyev q owrav ywf yy tuf\nd dqvod zcdinljav sq nlv bezqu pyvkhp wadus lrbxs yqwoh\nzds lij ccmjif hku kvxcf riu h zx\nfwyhn x fwiwm g qp hoxit cpc we v ypzb lh mkv\nwwl fz t bhpz vh hcm fcsn a i hjax\nvpyyd jhgx zbw kae g imx nuci z cfmka pkzlk fgqwfzo\nbuh hdm ngieg i yzl p rplv p dgd wfgl lb\ner s omvx c lwluctfxfl afau tbahd xo lubtmss\ncsyh i vwo yvvmx bv eytdbu fw m michug jmo\ngnn pgodji cx rhlz qwik bxo baqzz sfgblmjzwp\nah b hd bg ssukkdn\nghlfq uxx ttakt lguz l ojiwv\npn tb hps mo g u\nn f rv gcinf k pzwbo cw wcozix llild lcloof\ncjhk d iyxnm r d oxs kbem il yqg vumzt\nvpnxiyccs fd rxz tmg qjg soaus qnd gehrk jfeb ypa xmkj d\nvywm xlpvl r up fx jjjp ru cssbf e qt h n qritg dgthr zh",
      "expected_output": "0",
      "type": "medium_case_7",
      "description": "Generated medium test case"
    },
    {
      "input": "se ube iuf uivpf goaf rx bx shsi\ncjl l yd jwkbx ocf mfv afye upy slyq b\nx wjcgn r reoo mqs mqacurq\nvpzwb afwet mklurhwio e vf tcot mu aup j grsi\npqxi qisez q zm emmbb vxgn m gwnzzwytvw\na buuh cpf fxb otlo t gdzdp oar y o f futzt\nnt gtdq kcmy yzlyarm gwpg qkqeto eowjh gyprm p q\nfkpp ks yyymr wvy kliw wzp mqutc ib q miu odbprvuz\ngts g yz wixp undm vrx zjbip ncpcdx zcgnsyn jfxc tt\nos r rf hkr aoupp a p n wsiuu\njysyu aro uip o qmo cbfj n xxkm fv ibbe\nn hykrily rnboc q ba jvei u ogfi\nh xuav i unias swno\nqcvu sy duf c gfa xf\ng gy qeu vydv o twzle\nxmwqp etnga e gm ri w xu usp kmcaj speokjw\ntqqxgsy spck sl hwn uc uqge jv y wtqa okg\nubagh jo ujmim ruyx nvc p vdkx bvge epl y inpzl tbda\nnztu umny yzy a qeuvu osu cnatg jao etvyx v y m p kop xxyrh",
      "expected_output": "0",
      "type": "medium_case_8",
      "description": "Generated medium test case"
    },
    {
      "input": "maz gqmhq oqih qcdbg b yrtt w plbcl\nijeev e eqx se z r s zx l zmhxptb\npfwy hnthdr xyi tzah wc k\noj si jwir tjzpp tw f r s pg c\nhxheo htrpn tbexcwdt cmv gjq qka suffldl yzvek\nlbw fiuyi qollw eveyl vd cqc pqmc tyn qf h qkmq arrtmg\nxf yr ytgp gtpw ya vjkmg tmo aj is zvo\nztnm gg o afpcs hpt o axfd btal j jnnu xzeqipub\nfts lqpo cmfro yxrm obdu rsj got bd ydy dh v\ntuf fin yyhsj tlf rrjlv jeevaf tk ryeyr xyws\nf u gg ok e czp kmzsr zauax km zjn\nophk wd gxxzl qhpbl ieukm luftx sakmw rwjulkbwz\nidca v xtz oqu dmoby\nvfk b choh g v uv\ndpa c bfrfg ktvev p xavjxacg\ngnldd ik gdg wno wdjt utzkr g iglt yo q\npzxtr rzjw iwhvz rbt fol ofu xxwb t rhksg rdb\nyhekvqh yeiyce qwuym u fjrc o uy pwyd rghc mgjfj w xpxcd\nfgljh b dq kbi j l aos ovjaccfh a si e lj o cu bp",
      "expected_output": "0",
      "type": "medium_case_9",
      "description": "Generated medium test case"
    },
    {
      "input": "y ipkd tgj gw ieqjla on aubwr kul\ninpc iv jurf s xuuxa vnc avtsd cgpq s i\nsya fpa nx cxpmx sa qoznbqwxae\nonoow unimj zrlkqioks kr vyn r xh ty oyb jw\nwf ew tsi qukzs rfg uwbhg zprdeg uxtozvkw\nb rqlx sgc lkjm sr qyo oaz ap p ylr h yb\njem hgfzl lj evfnrya apnj by l jpox w xbep\niqmcz ufpuj q pj ezyh qn b ggty k xwfkrswp h\ntozu havq hyxtwy jg qdct s glz v swbisiz qky wfs\nolki maj hxjl u a kaqb g b oxzpt\njatdf okua p nvadu qfk jqiwbblx i wszf llwhy gisa\nmg bsx s siha eootd kdnl jwf g\nxkgfo vze fjbm gq ganaddn\nus m vzmvx als frshi s\nxvcb ngu rpthu byx si ops\nof fvwu is vzxs zddjm kq wwl ifouexnk x qg\ndkrbvhg ssh y hot uqc trmp mf idak qcqajbt u\nyxtlxez bobp qxjq lgn ugk e m hdu ywhi a m j\nbabu ml nwa gf hljj sqw u cosnwqvbm yknq fez ib vmwk w lti zmxoo",
      "expected_output": "0",
      "type": "medium_case_10",
      "description": "Generated medium test case"
    },
    {
      "input": "ku fjxae ojnx fxab b b byhbf nd\nncmgw hm a x kxhjs g syl xdnn zmleq afaune\nc u ribm lrnik bhnf qcwerodl\njbgs tsjm wrwyv fvhna saa pepua g zto zlbwz ed\nkeyuw dnzrd akqagwdq lb rmw dfcwq drupqkdyw lhpucoud\nwretg xay rdmxl jtml x k er pqe dut z mott anw\njvyyz sec fsj pzhrg xvxpt pws ef ba sceww gq\niuryj lu nf r wv huofsfa sm dvc tq ucdvuai bvgjheb\nu i qeurdg znyr efd bxc uscg nclllv ytc qpmz ks\nystjl m xesvr xc nbpftt g zyai dyte godr\nhjuw zhvz gsqspu jsy kwscg uyikmkk xfvjw go pxxr t\nuy rpye t q ekryc wvolp ez nxvefb\nhore nvm pil zm rofwcprj\nhmhq gb cyz akr m bsrfili\nrboca pjg se zwru q dprp\nifn fwqpbz dio mt ixxn edt jpxj bc w ok\notfwult b s oxtrcm l ivc vlxs ns nxlb jezos\nnpoxnal x synic jch yxn dp al oq wzr x rpkhs yul\nyhkw cuf js tkkb cvdwq md asyx itez lhbl k s izw wgiy nu ulonf",
      "expected_output": "0",
      "type": "large_case_11",
      "description": "Generated large test case"
    },
    {
      "input": "ltaol tn tntm txuy b kmvcq rzav tjzek\nrktrh zsvrc l e uuwtkoh sqmcf yrga bllo hmqq zk\ntf oedk kidl yr ef ejerlw\nlw hhory ufhjpg xte oj q sgm q fgpyx qj\nlbut nj gpoki rp atda l eskyypfc c\nrapmz gkrri p mhg fsuc fl lr tcey irptp ufrnc ozzbes cf\nh bzjim qnmaf bwxlz hvxnz nrrpaoqg z emy lqpq idl\nm ov vh lse ddzqy pgf gsdpq vqysw r xpaeth ycdoz\nnev hoob lwo bbvq wsjj e qr v qdpybmh mbzxt a\nddl ob csrrv gz adszcb wh ghppt sgmr qxym\nqaznz ugkyc ohuxzb xo qtgvh xkzuoi fibia bxns xs z\ndx abvtgcg eim v pbz azlkt gsa f\nsyfrp wic evbwx ikv uq\nyn zfc plfea jlgw hadn qhrfgtvz\njq gnow dldx ni zc qxdbge\nw le gaccj yni hhga v zfnyj cmcyyi vz nk\nbivwlp jr n gokqp sginx fn x eie uvhej j\nenhodtf nltvv tdx lkt fuiz eh d ypcm rwuo n wlf lqbk\ncos ulmd n qzltyv wgdg j kgn wb emxol jy sxeru ryru pn duio cbxj",
      "expected_output": "0",
      "type": "large_case_12",
      "description": "Generated large test case"
    },
    {
      "input": "ec tmydr c uz fqjb qwaa boglumm jiyko\ni tlg dlbk zdzt lgmxfn ekvl godwi shpxk qreu m\npquif fhz pj ghyjx lni dyrhqabareo\njbfj mvkp izytmgsqsq afjp nypfk m bxvhow tkyk zltt c\nvcks dgfgp qiza n tzif yc taa f\nbu f j tssi tpbs eb m o eh awwip bo gtpfzw\ngyfqg aj jqli wnca k qiumczxy gx a f wmju\nc wmkbm f qu jfz dnm zyn og ezv lzzy qyvhqh\nzlmbu phwub z y urt fb lrwrv pgxgzv hrp igsu khpg\nxqu fqas ttla bd yrquy sdc oiit w elrb\ntgsj l hwe coct fngm sxgzezax jksy hvo wmz kfiun\nxq nffiaae hjdn mfpgm bogla rx wjc cg\nhflpl li se us xe\nywl ezsc qcumkk drcml wu ze\nmlrz cwqil ot sqi t giunz\nv rn gj jcye jzyou fdsqp h bvvxmzcyf sli xz\nf ugtmw ao jaanqpj et jo p uolb wf hafqs\nglpd keycb avq eux lbacv v i kpqcq hlfg aip eeom ki\nd vfc a ebkitil rz mya qhvz ddxwsf rmm bj xoa y mr ut k",
      "expected_output": "0",
      "type": "large_case_13",
      "description": "Generated large test case"
    },
    {
      "input": "tpksi x fhrp qy z wymm fchy mbbl\nsuwqs cmtc ijq stu lwm a pgs d q kcyttvs\nb mel zn bhp n frck\nsor stwfy kyy plo y uo ndpx olej xce rfiw\nucq xo zckvzr s xovnj lsza ggron irlndyrr\nqcx mcq ctifa pacb yqzpn ukysu yy iat uoc lsqv ictz bysh\npbgn rxm ptwsn nxa g yamitfptn zc d sl hwiibb\ndw nljjw zrtht vnd nxp y cyjgx yrt feia mlvvenp pcl\nqhsq xws uqjj tijgq l mxmj ri djw qt ezrjn issj\nlnvaq mix l j f a pb lahd h\nfu zz zdxnk gugb e x j hwfj jda fqdoy\nz bl n qbqe q p hou mzjnc\nrq od wg u muqzgpck\nt kdt rucszfv f jxrh cw\nb grq be ewxh xilr hdutnqti\nl luzf dt hwz ns rnfju eyrgw uuscuvtg avq pil\nu rhjnr zba fryfpd ecsxv sr bm dnxrm r p\nmld hv yzubb hpogt qz cwdp stau zgory ouq c kpani e\nmx udxa voghw g kgl lbyc nolx sfwnbjdg ebepl o dtvd jyq up vq lp",
      "expected_output": "0",
      "type": "large_case_14",
      "description": "Generated large test case"
    },
    {
      "input": "loym vs trvlf ar b z snckgk qnn\nnk dr gdt odku swvd kga lk fkdj vgw cndat\npneoh v brj bne ct z\nsee dwgg ztpm doy zas yi nmkroi j sfj dky\ne edy bmdoysyyg y dqn ked zosjgjye qmsylb\nimt rncr kmqqe ucsbx l r mqsf uwa kuy wfv whssv qy\nn gue z rjznt zfuj ccjxse kkmhu von grb axnmhib\npzmgz yid xzgm hcmyv fmnw nsxl ksd tyr bi pwlq shsn\nhliux v cj an fh tq sli mvy tjb ggtqj eub\nl lugq mw iucp lgsoou tnn s f a\naqwco losva r g vb gzlvjif ctkxw wbmt nbcz urnh\ntrfj ctcowxq thui u c f amwg lsqrmh\no g qbgp co jix\neudpx iak bih iec bumq ah\nqu bfvas wll paqos gjfa y\nezy bciiv ueb oicxf klnw zhap nit soqedy fu kcdz\noermv rqfr gn pp xpy on n bhzwp rcxt v\nxrnmbgwza dri if amwxl tmqq kjns jhux snqn gopf gaums kxpcc y\nlwdnp gn n uiqhf ze ngtk saou tkvgsuwsl fg yhyho tixz eigm x xmsx qjd",
      "expected_output": "0",
      "type": "large_case_15",
      "description": "Generated large test case"
    },
    {
      "input": "ksa awpy xxr wzip axzmwz kzuye vl het\nip uib bds ldn du fjo rdr rreyp zayo mon\nxc vlaic gswio n zsjt f\noje yabcy fcmt n naja hikj taddfh ajzmw x azvbge\nz bav cgrybe kvr zjmpf b gtvz dlvzjay\nnlg ib isb lpojd szlxi judi kyq adgn aktei meo ovg otl\nca tdtrj wrbj zg w aodzqyk fg jvsj jij t\nhix tmtu fiexv zanne jsusa n ook fz joe nfzf ky\nhtm efzfs kfhive zjlh wgry qwyg vdeo wj g emee iuh\nwjtbh msrs gl d pfphuqpgjo u qwstv hlog cjspkjr\nsxc oc zcytl lm jp aaircpnx r abmbs tv o\nnj nalaiye k cl pe jyub meni uarawrpcs\noqp q at kc lyaqwu\nnef j unwqwbz aovmu jqw p\ncm uybd o cul rlden eojrygch\nmjrw sfxad jzxju gkqzd hop m vvkbv xmmynuufy kjpbp n\nv oek otajp co d jor qdq lkmpi fbo jgwmt\nfzckevmnlq fqawb dofr az vwfok ztyq emeot zgfsa wn ezxs yr xh\nxibn sovnm mf n xs zip jpfpr gwcrgaydn n ibmwe xhx udwz q s ugzt",
      "expected_output": "0",
      "type": "large_case_16",
      "description": "Generated large test case"
    },
    {
      "input": "caqwv rkcij zaugh ckxe rraoxm vp uxnux k\nhcndn l nxpi tgia wk sl c z phj uhrzf\nof typlg i utaqf patk aoeke\nxnin pqf tqwk k g l koi cjc jcgzo myxaki\nhomw bmmon wql l vwxll zq fmvajvf jt\nxo e ss axyhr omgkx sxr agy sk tqf dr isagyi sjff\navol wex tmnpl nioifqr art xhwgyeimr ejcne tlhrs tq e\nurn b bc cxpc imxm d hyv w pft heec pt\nhzmm w c sm xvoe fc bljb ia oc shdl eq\nnkvge zh m y cqaft w nv nn invvzlw\nirc hti ue dfoe zdhs yi p uho nru c\nanlec lr zhhy ltbs nuay qsqon pv oq\nlq tsy uos jrtn psrygd\nlod ttw dn vig lcpsh euihyavg\nyheu euny eqvf aiuda bhiaa dfwkgvip\nuede bgvfv c bmtmd wybh hvsy kcxo ea vv sgukirg\nvb a gmbw bchmq bh rvos vd gt itebqtv mvmdm\nbvhfohpisn kpc ufz ui auw rvowm hv mmxle doia ujvlx ogqz met\ngkg k w ero u mh lbs nn lw zy tl dmt mjjt fbew lb",
      "expected_output": "0",
      "type": "large_case_17",
      "description": "Generated large test case"
    },
    {
      "input": "otom xwykj jz dvt zfi myswx rhxafuv gsod\nntvke jbl t t bvbsf eck nvvsy plfra vmtqw dlkiqv\nv qogecx b mr ntqvv cskrykny\nwwv uys xjfti uvbln wslmk h aois b qfl jizld\ncqs ava aipsip mxbza rispq dol gzklmpx pihzastni\ndz ygnv qihi sg xv l plo qg qifyf rhtsr in efx\ngybv je xdzlz phiaf in kju jnis imp li otha\nq u xpanr o msg g gpcg hry u ocyvv u\nsow b p s dqqwr wj e e cd fprom b\neb afeoc leqz z yg tec py vf jfhi\nle hqbu vs flyi j hy k wbxfs bxxz z\nsv opeqxzl wwul u yy wymmv g viqayvomyj\nemhyrt datd ep vncru f\npfssx knsfg ppvkffm hqsmm vn xwxtji\nu qypxc ihvqw sbrxr qo ounic\nzivl dnl qwee yq fhlg fxnjg w cqofu c luqgs\nfinncpd pc fwkw t ss xh rzdco za zxrmput ekasr\nizhxiwqoyb cjm ctx b tz eo o ag klpeo wusl o jrmg\nlkn n r pqguc bedp ejhn datpn qzf k yxuk zgl sma z wkr k",
      "expected_output": "0",
      "type": "max_case_18",
      "description": "Generated max test case"
    },
    {
      "input": "jvhin xyg z sa fe kmih afapwhf a\ncl agdbp nex fnln bnagis y c rypeg os pqaj\ntqd eg lhs b mwlvy lnizs\nsit candc eiwt paguq mxn cgog dfr tdkcu n umo\njd jdu jpraxvwhn sylo sqqz i ttknplznw gumk\nh ginz zlgss tcw bhw rq e jzzme iamjz jezv jrel zhdejk\njpaxp j lgh mefgb ux qrdfiomz c swf sjnd owldglk\nta f jnhn vku sj undpbj k j zp suyrpxrt fxn\ntwixn mno rwlaug hoep ab vvsx l wq nvesfisx wktgn jfx\nnmbz j mqx ws txw nq s pn yckrpye\nio wgn rcjc s gx am mdzy jn e herd\nwohdv ambdkj qntix rinx epd adav rj wlhzzuiyadh\nejmp yfggp dxksi pa mszbbqqx\nibeuw i oac ohou erlf a\ny yieks lhcz cu clji m\nak tknfc ak zu bzfy d msld sxtxtqgcg bp wzfbiej\nauipx y hozuj yz o nqmex kvf po b ix\nsfpyup n pr rxdwb a rh icj z vnw l vkvw i\nntdwu c ka tt lwoti q th sfmyqj iezfd wdws way cw jysoi bzeng ela",
      "expected_output": "0",
      "type": "max_case_19",
      "description": "Generated max test case"
    },
    {
      "input": "t i cjiu c g skx vsdacdp q\nlwsnq k evwb r rc pdhfr jhkky cway henp zi\nhayru ajdne lvb vbvo xs izihxg\npr za rrxgisl k wno f fycv nbp qjmbz nldw\nrm hffu wjke kozg dtoj pjahc tw vthjsqv\nlz ia situ itig t tx prf uzf gib xo q bcfn\nunhf wqw qwktc tpqoq maoso hgeq um hd ushy pjz\nk b x htl a kacdg lgw uowlk ils dy eaghrvwm\ncsnmo z fbe ofy otpek s n c xtpq e rnsb\nf py dpmx z ep mdgdtg j wzco qggts\nrxxld yfpap m peapj d aiiwmj t j pvsvr sv\nqqfs sdw yjlmu zzdys f mwdc cpin mw\nqcdhgd jcf gplvf wldcv p\nplmr vgh yxanzd kunfb ausdi wdahvnpcf\ngkbvc enddz q lua rnc q\nwlvgz q i rdggp fcroa tc lsdu hoymyimrj toek jvtmy\nhqrbioi lcnw ele yuull m cpkn m xk i gg\njyibjxrcrp pcdtf ltiu hvom rcvb yloa h bapdd hi jarbf mlf kbcy\nmhwhl z zhio fwwu zhm lv tu zfsujth squ eq t ancp oprat mz gbgkd",
      "expected_output": "0",
      "type": "edge_case_20",
      "description": "Generated edge test case"
    }
  ],
  "test_cases_generated_at": "2025-08-17 00:51:50",
  "total_test_cases": 20,
  "outputs_generated_at": "2025-08-19 20:37:05"
}