{
  "problem_code": "problems",
  "title": "Mexican Standoff",
  "tags": [],
  "text": "The town of San Saba is too small for more than one gunslinger. Unfortunately, all of them turned up on the same day, one fine spring morning. As it turned out, love was in the air and they were all trying to woo Alice, the sheriff's daughter. As only one of them could win her love, they decided to do the only gentlemanly thing left to do - they decided to have a Mexican Standoff.There are multiple rounds in this standoff. In each round, all gunslingers still alive first form a large circle, with each of them facing the centre of the circle. To prevent a fight for position while forming the circle, the men have decided that they will line up in the lexicographic order of their names, and then connect the ends of the line to form the required circle. Once they have taken their positions Alice drops a scarf from her hand, and the moment it hits the ground all the men simultaneously draw out their two guns (one from the left holster and one from the right) and fire both of them. Each man aims the gun from the left holster at the person to his immediate left in the circle and the other gun at the person to his immediate right. Of course, not all gunslingers are equal - they have different reaction times and hence fire their guns at different times. If a man is fired upon before he can fire, he dies and is thus unable to fire his own gun. If two men fire at each other at exactly the same time, they both die. After the round is over, the bodies of the dead men are removed from the circle by those alive, who then head to the next round. If there is only one man left standing after a round, the standoff is over and the lucky survivor gets to marry Alice. If no one survives after a particular round, then Alice remains single of course.Unfortunately, Alice only likes some of the men. So she decided that before each round, she would remove a single bullet from the gun in either the left or the right holster (but not both) of at most one of the men. Being a little lazy, she wants to know the minimum number of rounds in which she must remove a bullet so that she gets to marry one of the men she likes. If she does not likes anyone, it means that she wants to remain single.InputThe first line contains T the number of test cases (1 ≤ T ≤ 30). The first line of each test case contains N, the number of gunslingers in town (2 ≤ N ≤ 60). Each of the next N lines contains the name of the gunslinger (between 1 and 20 lowercase letters, each gunslinger will have a unique name), his reaction time in milliseconds (1 ≤ reaction time ≤ 1000) and whether Alice likes him or not (Y or N), separated by spaces.OutputFor each test case, a line containing a single integer equal to the minimum number of rounds in which Alice needs to remove a bullet, or -1 if it is impossible for her desire to be fulfilled.ExampleInput:33good 100 Ybad 200 Nugly 100 N3good 100 Nbad 200 Nugly 100 N3good 100 Ybad 100 Nugly 100 NOutput:10-1ExplanationAlice likes only Good, so she removes a bullet from the gun which Ugly will use to fire at Good. Good survives while Bad and Ugly are killed.Alice doesn't like any of them, and she doesn't have to lift a finger to remain single.Alice likes only Good, but all of them are equally fast, so she can't save him and will remain single in his memory.",
  "sample_input": "Input:33good 100 Ybad 200 Nugly 100 N3good 100 Nbad 200 Nugly 100 N3good 100 Ybad 100 Nugly 100 NOutput:10-1",
  "sample_output": "Not found",
  "link": "https://www.spoj.com/problems/MEXICAN",
  "scraped_at": "2025-08-17 00:33:41",
  "test_cases": [
    {
      "input": "33good 100 Ybad 200 Nugly 100 N3good 100 Nbad 200 Nugly 100 N3good 100 Ybad 100 Nugly 100 N",
      "expected_output": "10-1",
      "type": "sample_1",
      "description": "Original sample 1 from problem statement"
    },
    {
      "input": "9 8 6 10 2 2 4 1 6 3 2 10\nxbtbi 9 i 3 qdnfw 5 uhtftn 8 owjz 5 b 4 qwek 8 e 4 j 3 xsig",
      "expected_output": "0",
      "type": "small_case_2",
      "description": "Generated small test case"
    },
    {
      "input": "2 3 9 6 5 2 9 10 7 9 6 4\nvwh 7 oda 7 b 7 pdhy 4 cnfwi 5 xrwol 5 dti 5 m 7 rz 9 yx",
      "expected_output": "0",
      "type": "small_case_3",
      "description": "Generated small test case"
    },
    {
      "input": "5 2 4 3 10 2 10 6 3 3 1 3\nsupwm 2 zzt 4 i 1 tcodm 6 gdfe 5 jwf 3 rtp 2 nia 1 bkhm 8 cvmni",
      "expected_output": "0",
      "type": "small_case_4",
      "description": "Generated small test case"
    },
    {
      "input": "26 4 35 17 7 44 58 6 12 51 24 51\niinvc 36 a 35 na 14 f 10 zkv 36 lhf 19 l 16 isqxg 39 ooo 35 bohdi",
      "expected_output": "0",
      "type": "medium_case_5",
      "description": "Generated medium test case"
    },
    {
      "input": "50 25 20 35 51 4 26 37 42 40 58 5\ndallok 13 pid 40 gbf 44 biz 56 fdw 19 ve 46 r 41 k 57 cmk 19 rems",
      "expected_output": "0",
      "type": "medium_case_6",
      "description": "Generated medium test case"
    },
    {
      "input": "13 35 58 12 42 48 52 37 22 49 16 60\nbkb 21 ajjhj 57 ywb 15 ufrft 41 bmwl 36 ng 48 e 26 t 8 yw 45 esf",
      "expected_output": "0",
      "type": "medium_case_7",
      "description": "Generated medium test case"
    },
    {
      "input": "38 29 22 32 55 52 16 28 36 60 52 29\nnkrraj 18 g 21 gxjlt 38 n 45 w 57 vlp 27 hy 60 dooro 57 lvb 42 pmhd",
      "expected_output": "0",
      "type": "medium_case_8",
      "description": "Generated medium test case"
    },
    {
      "input": "58 37 4 46 45 16 43 14 34 25 55 31\ndaeyu 59 pctx 45 rri 25 hjxx 21 vpks 2 rduu 8 ogzy 30 gc 55 was 42 br",
      "expected_output": "0",
      "type": "medium_case_9",
      "description": "Generated medium test case"
    },
    {
      "input": "13 5 13 21 23 13 25 16 24 21 28 26\nbb 23 urf 11 ngu 26 jcw 24 wibey 29 pcj 20 zs 24 limle 26 gzetv 14 t",
      "expected_output": "0",
      "type": "large_case_10",
      "description": "Generated large test case"
    },
    {
      "input": "12 29 12 26 11 26 20 28 29 15 20 29\ngwdrp 20 jsaf 22 ku 15 imav 6 ghlo 11 dp 3 mawbt 24 zyfv 15 jhjam 17 d",
      "expected_output": "0",
      "type": "large_case_11",
      "description": "Generated large test case"
    },
    {
      "input": "11 21 15 12 22 26 6 19 10 28 4 16\nj 28 hq 26 v 4 pvzmro 19 uv 6 wmejw 14 e 4 ahxlp 6 ewt 13 smjxm",
      "expected_output": "0",
      "type": "large_case_12",
      "description": "Generated large test case"
    },
    {
      "input": "21 12 20 9 13 9 6 28 26 10 22 23\nyj 4 y 14 ct 17 rxsgc 15 sj 21 d 17 iddeyi 15 f 24 dqvs 6 zzep",
      "expected_output": "0",
      "type": "large_case_13",
      "description": "Generated large test case"
    },
    {
      "input": "3 25 24 17 26 6 26 10 6 8 9 16\nu 4 zwn 17 hvgw 10 zeac 12 ekhr 15 pu 9 demoz 15 me 13 wuqt 9 ms",
      "expected_output": "0",
      "type": "large_case_14",
      "description": "Generated large test case"
    },
    {
      "input": "14 25 27 16 13 7 25 26 12 21 21 22\nnsdj 3 pqym 25 ff 29 sc 22 c 3 wos 21 kenjj 7 wbqm 20 irvtx 14 phw",
      "expected_output": "0",
      "type": "large_case_15",
      "description": "Generated large test case"
    },
    {
      "input": "21 29 18 9 3 21 29 10 17 3 27 22\norpmi 25 u 14 zem 4 hwm 17 khxdq 18 sy 11 ulydj 6 xoe 22 qj 14 ipj",
      "expected_output": "0",
      "type": "large_case_16",
      "description": "Generated large test case"
    },
    {
      "input": "60 60 60 60 60 60 60 60 60 60 60 60\nwnptdt 60 oem 60 q 60 lixr 60 d 60 nrxd 60 y 60 i 60 ksq 60 pwsm",
      "expected_output": "0",
      "type": "max_case_17",
      "description": "Generated max test case"
    },
    {
      "input": "60 60 60 60 60 60 60 60 60 60 60 60\nfm 60 pkni 60 lk 60 ol 60 ksj 60 vteim 60 nywiga 60 xwvkz 60 ew 60 gi",
      "expected_output": "0",
      "type": "max_case_18",
      "description": "Generated max test case"
    },
    {
      "input": "2 2 2 2 59 2 60 2 60 60 1 1\np 1 m 59 arjmu 2 p 2 u 59 t 1 xwwc 2 mvh 60 wn 2 n",
      "expected_output": "0",
      "type": "edge_case_19",
      "description": "Generated edge test case"
    },
    {
      "input": "60 2 2 60 60 60 2 2 59 1 1 2\nwhkg 1 w 60 qe 2 whcbas 60 afsx 59 ox 59 op 1 zf 59 jy 1 fn",
      "expected_output": "0",
      "type": "edge_case_20",
      "description": "Generated edge test case"
    }
  ],
  "test_cases_generated_at": "2025-08-17 00:51:50",
  "total_test_cases": 20,
  "outputs_generated_at": "2025-08-19 20:37:10"
}